garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Generated 24/03/2025 GMT

/*
 * Copyright © 2025, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F15Q20_H_
#define _PIC18F15Q20_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F15Q20
 */
#ifndef _XC_H_
#warning Header file pic18f15q20.h included directly. Use #include <xc.h> instead.
#endif

/*
 * Interrupt Source IRQ numbers
 */

// Software Interrupt
#define                                 IRQ_SW              0
// External Interrupt 0
#define                                 IRQ_INT0            1
// External Interrupt 1
#define                                 IRQ_INT1            2
// External Interrupt 2
#define                                 IRQ_INT2            3
// DMA1 Source Count Interrupt
#define                                 IRQ_DMA1SCNT        4
// DMA1 Destination Count Interrupt
#define                                 IRQ_DMA1DCNT        5
// DMA1 Overflow Interrupt
#define                                 IRQ_DMA1OR          6
// DMA1 Abort Interrupt
#define                                 IRQ_DMA1A           7
// DMA2 Source Count Interrupt
#define                                 IRQ_DMA2SCNT        8
// DMA2 Destination Count Interrupt
#define                                 IRQ_DMA2DCNT        9
// DMA2 Overflow Interrupt
#define                                 IRQ_DMA2OR          10
// DMA2 Abort Interrupt
#define                                 IRQ_DMA2A           11
// DMA3 Source Count Interrupt
#define                                 IRQ_DMA3SCNT        12
// DMA3 Destination Count Interrupt
#define                                 IRQ_DMA3DCNT        13
// DMA3 Overflow Interrupt
#define                                 IRQ_DMA3OR          14
// DMA3 Abort Interrupt
#define                                 IRQ_DMA3A           15
// DMA4 Source Count Interrupt
#define                                 IRQ_DMA4SCNT        16
// DMA4 Destination Count Interrupt
#define                                 IRQ_DMA4DCNT        17
// DMA4 Overflow Interrupt
#define                                 IRQ_DMA4OR          18
// DMA4 Abort Interrupt
#define                                 IRQ_DMA4A           19
// NVM Interrupt
#define                                 IRQ_NVM             20
// CRC Interrupt
#define                                 IRQ_CRC             21
// Scanner Interrupt
#define                                 IRQ_SCAN            22
// Active Clock Tuning Interrupt
#define                                 IRQ_ACT             23
// Clock Switch Interrupt
#define                                 IRQ_CSW             24
// Oscillator Failure Interrupt
#define                                 IRQ_OSF             25
// VDDIO2 Interrupt
#define                                 IRQ_VDDIO2          26
// VDDIO3 Interrupt
#define                                 IRQ_VDDIO3          27
// Interrupt on Change
#define                                 IRQ_IOC             28
// Timer0 Interrupt
#define                                 IRQ_TMR0            29
// Timer1 Interrupt
#define                                 IRQ_TMR1            30
// Timer1 Gate Interrupt
#define                                 IRQ_TMR1G           31
// Timer2 Interrupt
#define                                 IRQ_TMR2            32
// Timer4 Interrupt
#define                                 IRQ_TMR4            33
// 16-Bit Universal Timer A Interrupt
#define                                 IRQ_TU16A           34
// 16-Bit Universal Timer B Interrupt
#define                                 IRQ_TU16B           35
// CCP1 Interrupt
#define                                 IRQ_CCP1            36
// CCP2 Interrupt
#define                                 IRQ_CCP2            37
// PWM1 Period Interrupt
#define                                 IRQ_PWM1P           38
// PWM1 Interrupt
#define                                 IRQ_PWM1            39
// PWM2 Period Interrupt
#define                                 IRQ_PWM2P           40
// PWM2 Interrupt
#define                                 IRQ_PWM2            41
// CWG1 Interrupt
#define                                 IRQ_CWG1            42
// CLC1 Interrupt
#define                                 IRQ_CLC1            43
// CLC2 Interrupt
#define                                 IRQ_CLC2            44
// CLC3 Interrupt
#define                                 IRQ_CLC3            45
// CLC4 Interrupt
#define                                 IRQ_CLC4            46
// Signal Routing Port Interrupt on Change
#define                                 IRQ_IOCSR           47
// UART1 Receive Interrupt
#define                                 IRQ_U1RX            48
// UART1 Transmit Interrupt
#define                                 IRQ_U1TX            49
// UART1 Interrupt
#define                                 IRQ_U1              50
// UART1 Error Interrupt
#define                                 IRQ_U1E             51
// UART2 Receive Interrupt
#define                                 IRQ_U2RX            52
// UART2 Transmit Interrupt
#define                                 IRQ_U2TX            53
// UART2 Interrupt
#define                                 IRQ_U2              54
// UART2 Error Interrupt
#define                                 IRQ_U2E             55
// SPI1 Receive Interrupt
#define                                 IRQ_SPI1RX          56
// SPI1 Transmit Interrupt
#define                                 IRQ_SPI1TX          57
// SPI1 Interrupt
#define                                 IRQ_SPI1            58
// I2C1 Receive Interrupt
#define                                 IRQ_I2C1RX          59
// I2C1 Transmit Interrupt
#define                                 IRQ_I2C1TX          60
// I2C1 Interrupt
#define                                 IRQ_I2C1            61
// I2C1 Error Interrupt
#define                                 IRQ_I2C1E           62
// I3C1 Receive Interrupt
#define                                 IRQ_I3C1RX          64
// I3C1 Transmit Interrupt
#define                                 IRQ_I3C1TX          65
// I3C1 General Interrupt
#define                                 IRQ_I3C1            66
// I3C1 Error Interrupt
#define                                 IRQ_I3C1E           67
// I3C1 Reset Interrupt
#define                                 IRQ_I3C1R           68
// I3C2 Receive Interrupt
#define                                 IRQ_I3C2RX          72
// I3C2 Transmit Interrupt
#define                                 IRQ_I3C2TX          73
// I3C2 General Interrupt
#define                                 IRQ_I3C2            74
// I3C2 Error Interrupt
#define                                 IRQ_I3C2E           75
// I3C2 Reset Interrupt
#define                                 IRQ_I3C2R           76
// HLVD Interrupt
#define                                 IRQ_HLVD            77
// ADC Interrupt
#define                                 IRQ_AD              78
// ADC Threshold Interrupt
#define                                 IRQ_ADT             79
/*
 * Register Definitions
 */

// Register: PRLOCK
#define PRLOCK PRLOCK
extern volatile unsigned char           PRLOCK              __at(0x038);
#ifndef _LIB_BUILD
asm("PRLOCK equ 038h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRLOCKED               :1;
    };
} PRLOCKbits_t;
extern volatile PRLOCKbits_t PRLOCKbits __at(0x038);
// bitfield macros
#define _PRLOCK_PRLOCKED_POSN                               0x0
#define _PRLOCK_PRLOCKED_POSITION                           0x0
#define _PRLOCK_PRLOCKED_SIZE                               0x1
#define _PRLOCK_PRLOCKED_LENGTH                             0x1
#define _PRLOCK_PRLOCKED_MASK                               0x1

// Register: MAINPR
#define MAINPR MAINPR
extern volatile unsigned char           MAINPR              __at(0x039);
#ifndef _LIB_BUILD
asm("MAINPR equ 039h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned MAINPR                 :3;
    };
    struct {
        unsigned MAINPR0                :1;
        unsigned MAINPR1                :1;
        unsigned MAINPR2                :1;
    };
} MAINPRbits_t;
