garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: DMASELECT
#define DMASELECT DMASELECT
extern volatile unsigned char           DMASELECT           __at(0x040);
#ifndef _LIB_BUILD
asm("DMASELECT equ 040h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLCT                   :8;
    };
    struct {
        unsigned SLCT0                  :1;
        unsigned SLCT1                  :1;
        unsigned SLCT2                  :1;
    };
} DMASELECTbits_t;
extern volatile DMASELECTbits_t DMASELECTbits __at(0x040);
// bitfield macros
#define _DMASELECT_SLCT_POSN                                0x0
#define _DMASELECT_SLCT_POSITION                            0x0
#define _DMASELECT_SLCT_SIZE                                0x8
#define _DMASELECT_SLCT_LENGTH                              0x8
#define _DMASELECT_SLCT_MASK                                0xFF
#define _DMASELECT_SLCT0_POSN                               0x0
#define _DMASELECT_SLCT0_POSITION                           0x0
#define _DMASELECT_SLCT0_SIZE                               0x1
#define _DMASELECT_SLCT0_LENGTH                             0x1
#define _DMASELECT_SLCT0_MASK                               0x1
#define _DMASELECT_SLCT1_POSN                               0x1
#define _DMASELECT_SLCT1_POSITION                           0x1
#define _DMASELECT_SLCT1_SIZE                               0x1
#define _DMASELECT_SLCT1_LENGTH                             0x1
#define _DMASELECT_SLCT1_MASK                               0x2
#define _DMASELECT_SLCT2_POSN                               0x2
#define _DMASELECT_SLCT2_POSITION                           0x2
#define _DMASELECT_SLCT2_SIZE                               0x1
#define _DMASELECT_SLCT2_LENGTH                             0x1
#define _DMASELECT_SLCT2_MASK                               0x4

// Register: DMAnBUF
#define DMAnBUF DMAnBUF
extern volatile unsigned char           DMAnBUF             __at(0x041);
#ifndef _LIB_BUILD
asm("DMAnBUF equ 041h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BUF                    :8;
    };
    struct {
        unsigned BUF0                   :1;
        unsigned BUF1                   :1;
        unsigned BUF2                   :1;
        unsigned BUF3                   :1;
        unsigned BUF4                   :1;
        unsigned BUF5                   :1;
        unsigned BUF6                   :1;
        unsigned BUF7                   :1;
    };
} DMAnBUFbits_t;
extern volatile DMAnBUFbits_t DMAnBUFbits __at(0x041);
// bitfield macros
#define _DMAnBUF_BUF_POSN                                   0x0
#define _DMAnBUF_BUF_POSITION                               0x0
#define _DMAnBUF_BUF_SIZE                                   0x8
#define _DMAnBUF_BUF_LENGTH                                 0x8
#define _DMAnBUF_BUF_MASK                                   0xFF
#define _DMAnBUF_BUF0_POSN                                  0x0
#define _DMAnBUF_BUF0_POSITION                              0x0
#define _DMAnBUF_BUF0_SIZE                                  0x1
#define _DMAnBUF_BUF0_LENGTH                                0x1
#define _DMAnBUF_BUF0_MASK                                  0x1
#define _DMAnBUF_BUF1_POSN                                  0x1
#define _DMAnBUF_BUF1_POSITION                              0x1
#define _DMAnBUF_BUF1_SIZE                                  0x1
#define _DMAnBUF_BUF1_LENGTH                                0x1
#define _DMAnBUF_BUF1_MASK                                  0x2
#define _DMAnBUF_BUF2_POSN                                  0x2
#define _DMAnBUF_BUF2_POSITION                              0x2
#define _DMAnBUF_BUF2_SIZE                                  0x1
#define _DMAnBUF_BUF2_LENGTH                                0x1
#define _DMAnBUF_BUF2_MASK                                  0x4
#define _DMAnBUF_BUF3_POSN                                  0x3
#define _DMAnBUF_BUF3_POSITION                              0x3
#define _DMAnBUF_BUF3_SIZE                                  0x1
#define _DMAnBUF_BUF3_LENGTH                                0x1
#define _DMAnBUF_BUF3_MASK                                  0x8
#define _DMAnBUF_BUF4_POSN                                  0x4
#define _DMAnBUF_BUF4_POSITION                              0x4
#define _DMAnBUF_BUF4_SIZE                                  0x1
#define _DMAnBUF_BUF4_LENGTH                                0x1
#define _DMAnBUF_BUF4_MASK                                  0x10
#define _DMAnBUF_BUF5_POSN                                  0x5
#define _DMAnBUF_BUF5_POSITION                              0x5
#define _DMAnBUF_BUF5_SIZE                                  0x1
#define _DMAnBUF_BUF5_LENGTH                                0x1
#define _DMAnBUF_BUF5_MASK                                  0x20
#define _DMAnBUF_BUF6_POSN                                  0x6
#define _DMAnBUF_BUF6_POSITION                              0x6
#define _DMAnBUF_BUF6_SIZE                                  0x1
#define _DMAnBUF_BUF6_LENGTH                                0x1
#define _DMAnBUF_BUF6_MASK                                  0x40
#define _DMAnBUF_BUF7_POSN                                  0x7
#define _DMAnBUF_BUF7_POSITION                              0x7
#define _DMAnBUF_BUF7_SIZE                                  0x1
#define _DMAnBUF_BUF7_LENGTH                                0x1
#define _DMAnBUF_BUF7_MASK                                  0x80

// Register: DMAnDCNT
#define DMAnDCNT DMAnDCNT
extern volatile unsigned short          DMAnDCNT            __at(0x042);
#ifndef _LIB_BUILD
asm("DMAnDCNT equ 042h");
#endif

// Register: DMAnDCNTL
#define DMAnDCNTL DMAnDCNTL
extern volatile unsigned char           DMAnDCNTL           __at(0x042);
#ifndef _LIB_BUILD
asm("DMAnDCNTL equ 042h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :8;
    };
    struct {
        unsigned DCNT0                  :1;
        unsigned DCNT1                  :1;
        unsigned DCNT2                  :1;
        unsigned DCNT3                  :1;
        unsigned DCNT4                  :1;
        unsigned DCNT5                  :1;
        unsigned DCNT6                  :1;
        unsigned DCNT7                  :1;
    };
} DMAnDCNTLbits_t;
extern volatile DMAnDCNTLbits_t DMAnDCNTLbits __at(0x042);
// bitfield macros
#define _DMAnDCNTL_DCNT_POSN                                0x0
#define _DMAnDCNTL_DCNT_POSITION                            0x0
#define _DMAnDCNTL_DCNT_SIZE                                0x8
#define _DMAnDCNTL_DCNT_LENGTH                              0x8
#define _DMAnDCNTL_DCNT_MASK                                0xFF
#define _DMAnDCNTL_DCNT0_POSN                               0x0
#define _DMAnDCNTL_DCNT0_POSITION                           0x0
#define _DMAnDCNTL_DCNT0_SIZE                               0x1
#define _DMAnDCNTL_DCNT0_LENGTH                             0x1
#define _DMAnDCNTL_DCNT0_MASK                               0x1
#define _DMAnDCNTL_DCNT1_POSN                               0x1
#define _DMAnDCNTL_DCNT1_POSITION                           0x1
#define _DMAnDCNTL_DCNT1_SIZE                               0x1
#define _DMAnDCNTL_DCNT1_LENGTH                             0x1
#define _DMAnDCNTL_DCNT1_MASK                               0x2
#define _DMAnDCNTL_DCNT2_POSN                               0x2
#define _DMAnDCNTL_DCNT2_POSITION                           0x2
#define _DMAnDCNTL_DCNT2_SIZE                               0x1
#define _DMAnDCNTL_DCNT2_LENGTH                             0x1
#define _DMAnDCNTL_DCNT2_MASK                               0x4
#define _DMAnDCNTL_DCNT3_POSN                               0x3
#define _DMAnDCNTL_DCNT3_POSITION                           0x3
#define _DMAnDCNTL_DCNT3_SIZE                               0x1
#define _DMAnDCNTL_DCNT3_LENGTH                             0x1
#define _DMAnDCNTL_DCNT3_MASK                               0x8
#define _DMAnDCNTL_DCNT4_POSN                               0x4
#define _DMAnDCNTL_DCNT4_POSITION                           0x4
#define _DMAnDCNTL_DCNT4_SIZE                               0x1
#define _DMAnDCNTL_DCNT4_LENGTH                             0x1
#define _DMAnDCNTL_DCNT4_MASK                               0x10
#define _DMAnDCNTL_DCNT5_POSN                               0x5
#define _DMAnDCNTL_DCNT5_POSITION                           0x5
#define _DMAnDCNTL_DCNT5_SIZE                               0x1
#define _DMAnDCNTL_DCNT5_LENGTH                             0x1
#define _DMAnDCNTL_DCNT5_MASK                               0x20
#define _DMAnDCNTL_DCNT6_POSN                               0x6
#define _DMAnDCNTL_DCNT6_POSITION                           0x6
#define _DMAnDCNTL_DCNT6_SIZE                               0x1
#define _DMAnDCNTL_DCNT6_LENGTH                             0x1
#define _DMAnDCNTL_DCNT6_MASK                               0x40
#define _DMAnDCNTL_DCNT7_POSN                               0x7
#define _DMAnDCNTL_DCNT7_POSITION                           0x7
#define _DMAnDCNTL_DCNT7_SIZE                               0x1
#define _DMAnDCNTL_DCNT7_LENGTH                             0x1
#define _DMAnDCNTL_DCNT7_MASK                               0x80

// Register: DMAnDCNTH
#define DMAnDCNTH DMAnDCNTH
extern volatile unsigned char           DMAnDCNTH           __at(0x043);
#ifndef _LIB_BUILD
asm("DMAnDCNTH equ 043h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :8;
    };
    struct {
        unsigned DCNT8                  :1;
        unsigned DCNT9                  :1;
        unsigned DCNT10                 :1;
        unsigned DCNT11                 :1;
    };
} DMAnDCNTHbits_t;
extern volatile DMAnDCNTHbits_t DMAnDCNTHbits __at(0x043);
// bitfield macros
#define _DMAnDCNTH_DCNT_POSN                                0x0
#define _DMAnDCNTH_DCNT_POSITION                            0x0
#define _DMAnDCNTH_DCNT_SIZE                                0x8
#define _DMAnDCNTH_DCNT_LENGTH                              0x8
#define _DMAnDCNTH_DCNT_MASK                                0xFF
#define _DMAnDCNTH_DCNT8_POSN                               0x0
#define _DMAnDCNTH_DCNT8_POSITION                           0x0
#define _DMAnDCNTH_DCNT8_SIZE                               0x1
#define _DMAnDCNTH_DCNT8_LENGTH                             0x1
#define _DMAnDCNTH_DCNT8_MASK                               0x1
#define _DMAnDCNTH_DCNT9_POSN                               0x1
#define _DMAnDCNTH_DCNT9_POSITION                           0x1
#define _DMAnDCNTH_DCNT9_SIZE                               0x1
#define _DMAnDCNTH_DCNT9_LENGTH                             0x1
#define _DMAnDCNTH_DCNT9_MASK                               0x2
#define _DMAnDCNTH_DCNT10_POSN                              0x2
#define _DMAnDCNTH_DCNT10_POSITION                          0x2
#define _DMAnDCNTH_DCNT10_SIZE                              0x1
#define _DMAnDCNTH_DCNT10_LENGTH                            0x1
#define _DMAnDCNTH_DCNT10_MASK                              0x4
#define _DMAnDCNTH_DCNT11_POSN                              0x3
#define _DMAnDCNTH_DCNT11_POSITION                          0x3
#define _DMAnDCNTH_DCNT11_SIZE                              0x1
#define _DMAnDCNTH_DCNT11_LENGTH                            0x1
#define _DMAnDCNTH_DCNT11_MASK                              0x8

// Register: DMAnDPTR
#define DMAnDPTR DMAnDPTR
extern volatile unsigned short          DMAnDPTR            __at(0x044);
#ifndef _LIB_BUILD
asm("DMAnDPTR equ 044h");
#endif

// Register: DMAnDPTRL
#define DMAnDPTRL DMAnDPTRL
extern volatile unsigned char           DMAnDPTRL           __at(0x044);
#ifndef _LIB_BUILD
asm("DMAnDPTRL equ 044h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DPTR                   :8;
    };
    struct {
        unsigned DPTR0                  :1;
        unsigned DPTR1                  :1;
        unsigned DPTR2                  :1;
        unsigned DPTR3                  :1;
        unsigned DPTR4                  :1;
        unsigned DPTR5                  :1;
        unsigned DPTR6                  :1;
        unsigned DPTR7                  :1;
    };
} DMAnDPTRLbits_t;
