garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile DMAnSSZHbits_t DMAnSSZHbits __at(0x050);
// bitfield macros
#define _DMAnSSZH_SSZ_POSN                                  0x0
#define _DMAnSSZH_SSZ_POSITION                              0x0
#define _DMAnSSZH_SSZ_SIZE                                  0x8
#define _DMAnSSZH_SSZ_LENGTH                                0x8
#define _DMAnSSZH_SSZ_MASK                                  0xFF
#define _DMAnSSZH_SSZ8_POSN                                 0x0
#define _DMAnSSZH_SSZ8_POSITION                             0x0
#define _DMAnSSZH_SSZ8_SIZE                                 0x1
#define _DMAnSSZH_SSZ8_LENGTH                               0x1
#define _DMAnSSZH_SSZ8_MASK                                 0x1
#define _DMAnSSZH_SSZ9_POSN                                 0x1
#define _DMAnSSZH_SSZ9_POSITION                             0x1
#define _DMAnSSZH_SSZ9_SIZE                                 0x1
#define _DMAnSSZH_SSZ9_LENGTH                               0x1
#define _DMAnSSZH_SSZ9_MASK                                 0x2
#define _DMAnSSZH_SSZ10_POSN                                0x2
#define _DMAnSSZH_SSZ10_POSITION                            0x2
#define _DMAnSSZH_SSZ10_SIZE                                0x1
#define _DMAnSSZH_SSZ10_LENGTH                              0x1
#define _DMAnSSZH_SSZ10_MASK                                0x4
#define _DMAnSSZH_SSZ11_POSN                                0x3
#define _DMAnSSZH_SSZ11_POSITION                            0x3
#define _DMAnSSZH_SSZ11_SIZE                                0x1
#define _DMAnSSZH_SSZ11_LENGTH                              0x1
#define _DMAnSSZH_SSZ11_MASK                                0x8

// Register: DMAnSSA
#define DMAnSSA DMAnSSA
#ifndef __CCI__
extern volatile __uint24                DMAnSSA             __at(0x051);
#endif
#ifndef _LIB_BUILD
asm("DMAnSSA equ 051h");
#endif

// Register: DMAnSSAL
#define DMAnSSAL DMAnSSAL
extern volatile unsigned char           DMAnSSAL            __at(0x051);
#ifndef _LIB_BUILD
asm("DMAnSSAL equ 051h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA0                   :1;
        unsigned SSA1                   :1;
        unsigned SSA2                   :1;
        unsigned SSA3                   :1;
        unsigned SSA4                   :1;
        unsigned SSA5                   :1;
        unsigned SSA6                   :1;
        unsigned SSA7                   :1;
    };
} DMAnSSALbits_t;
extern volatile DMAnSSALbits_t DMAnSSALbits __at(0x051);
// bitfield macros
#define _DMAnSSAL_SSA_POSN                                  0x0
#define _DMAnSSAL_SSA_POSITION                              0x0
#define _DMAnSSAL_SSA_SIZE                                  0x8
#define _DMAnSSAL_SSA_LENGTH                                0x8
#define _DMAnSSAL_SSA_MASK                                  0xFF
#define _DMAnSSAL_SSA0_POSN                                 0x0
#define _DMAnSSAL_SSA0_POSITION                             0x0
#define _DMAnSSAL_SSA0_SIZE                                 0x1
#define _DMAnSSAL_SSA0_LENGTH                               0x1
#define _DMAnSSAL_SSA0_MASK                                 0x1
#define _DMAnSSAL_SSA1_POSN                                 0x1
#define _DMAnSSAL_SSA1_POSITION                             0x1
#define _DMAnSSAL_SSA1_SIZE                                 0x1
#define _DMAnSSAL_SSA1_LENGTH                               0x1
#define _DMAnSSAL_SSA1_MASK                                 0x2
#define _DMAnSSAL_SSA2_POSN                                 0x2
#define _DMAnSSAL_SSA2_POSITION                             0x2
#define _DMAnSSAL_SSA2_SIZE                                 0x1
#define _DMAnSSAL_SSA2_LENGTH                               0x1
#define _DMAnSSAL_SSA2_MASK                                 0x4
#define _DMAnSSAL_SSA3_POSN                                 0x3
#define _DMAnSSAL_SSA3_POSITION                             0x3
#define _DMAnSSAL_SSA3_SIZE                                 0x1
#define _DMAnSSAL_SSA3_LENGTH                               0x1
#define _DMAnSSAL_SSA3_MASK                                 0x8
#define _DMAnSSAL_SSA4_POSN                                 0x4
#define _DMAnSSAL_SSA4_POSITION                             0x4
#define _DMAnSSAL_SSA4_SIZE                                 0x1
#define _DMAnSSAL_SSA4_LENGTH                               0x1
#define _DMAnSSAL_SSA4_MASK                                 0x10
#define _DMAnSSAL_SSA5_POSN                                 0x5
#define _DMAnSSAL_SSA5_POSITION                             0x5
#define _DMAnSSAL_SSA5_SIZE                                 0x1
#define _DMAnSSAL_SSA5_LENGTH                               0x1
#define _DMAnSSAL_SSA5_MASK                                 0x20
#define _DMAnSSAL_SSA6_POSN                                 0x6
#define _DMAnSSAL_SSA6_POSITION                             0x6
#define _DMAnSSAL_SSA6_SIZE                                 0x1
#define _DMAnSSAL_SSA6_LENGTH                               0x1
#define _DMAnSSAL_SSA6_MASK                                 0x40
#define _DMAnSSAL_SSA7_POSN                                 0x7
#define _DMAnSSAL_SSA7_POSITION                             0x7
#define _DMAnSSAL_SSA7_SIZE                                 0x1
#define _DMAnSSAL_SSA7_LENGTH                               0x1
#define _DMAnSSAL_SSA7_MASK                                 0x80

// Register: DMAnSSAH
#define DMAnSSAH DMAnSSAH
extern volatile unsigned char           DMAnSSAH            __at(0x052);
#ifndef _LIB_BUILD
asm("DMAnSSAH equ 052h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA8                   :1;
        unsigned SSA9                   :1;
        unsigned SSA10                  :1;
        unsigned SSA11                  :1;
        unsigned SSA12                  :1;
        unsigned SSA13                  :1;
        unsigned SSA14                  :1;
        unsigned SSA15                  :1;
    };
} DMAnSSAHbits_t;
