garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile DMAnSIRQbits_t DMAnSIRQbits __at(0x057);
// bitfield macros
#define _DMAnSIRQ_SIRQ_POSN                                 0x0
#define _DMAnSIRQ_SIRQ_POSITION                             0x0
#define _DMAnSIRQ_SIRQ_SIZE                                 0x8
#define _DMAnSIRQ_SIRQ_LENGTH                               0x8
#define _DMAnSIRQ_SIRQ_MASK                                 0xFF
#define _DMAnSIRQ_SIRQ0_POSN                                0x0
#define _DMAnSIRQ_SIRQ0_POSITION                            0x0
#define _DMAnSIRQ_SIRQ0_SIZE                                0x1
#define _DMAnSIRQ_SIRQ0_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ0_MASK                                0x1
#define _DMAnSIRQ_SIRQ1_POSN                                0x1
#define _DMAnSIRQ_SIRQ1_POSITION                            0x1
#define _DMAnSIRQ_SIRQ1_SIZE                                0x1
#define _DMAnSIRQ_SIRQ1_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ1_MASK                                0x2
#define _DMAnSIRQ_SIRQ2_POSN                                0x2
#define _DMAnSIRQ_SIRQ2_POSITION                            0x2
#define _DMAnSIRQ_SIRQ2_SIZE                                0x1
#define _DMAnSIRQ_SIRQ2_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ2_MASK                                0x4
#define _DMAnSIRQ_SIRQ3_POSN                                0x3
#define _DMAnSIRQ_SIRQ3_POSITION                            0x3
#define _DMAnSIRQ_SIRQ3_SIZE                                0x1
#define _DMAnSIRQ_SIRQ3_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ3_MASK                                0x8
#define _DMAnSIRQ_SIRQ4_POSN                                0x4
#define _DMAnSIRQ_SIRQ4_POSITION                            0x4
#define _DMAnSIRQ_SIRQ4_SIZE                                0x1
#define _DMAnSIRQ_SIRQ4_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ4_MASK                                0x10
#define _DMAnSIRQ_SIRQ5_POSN                                0x5
#define _DMAnSIRQ_SIRQ5_POSITION                            0x5
#define _DMAnSIRQ_SIRQ5_SIZE                                0x1
#define _DMAnSIRQ_SIRQ5_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ5_MASK                                0x20
#define _DMAnSIRQ_SIRQ6_POSN                                0x6
#define _DMAnSIRQ_SIRQ6_POSITION                            0x6
#define _DMAnSIRQ_SIRQ6_SIZE                                0x1
#define _DMAnSIRQ_SIRQ6_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ6_MASK                                0x40
#define _DMAnSIRQ_SIRQ7_POSN                                0x7
#define _DMAnSIRQ_SIRQ7_POSITION                            0x7
#define _DMAnSIRQ_SIRQ7_SIZE                                0x1
#define _DMAnSIRQ_SIRQ7_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ7_MASK                                0x80

// Register: NVMCON0
#define NVMCON0 NVMCON0
extern volatile unsigned char           NVMCON0             __at(0x058);
#ifndef _LIB_BUILD
asm("NVMCON0 equ 058h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GO                     :1;
    };
    struct {
        unsigned NOT_DONE               :1;
    };
    struct {
        unsigned nDONE                  :1;
    };
    struct {
        unsigned NVMGO                  :1;
    };
} NVMCON0bits_t;
extern volatile NVMCON0bits_t NVMCON0bits __at(0x058);
// bitfield macros
#define _NVMCON0_GO_POSN                                    0x0
#define _NVMCON0_GO_POSITION                                0x0
#define _NVMCON0_GO_SIZE                                    0x1
#define _NVMCON0_GO_LENGTH                                  0x1
#define _NVMCON0_GO_MASK                                    0x1
#define _NVMCON0_NOT_DONE_POSN                              0x0
#define _NVMCON0_NOT_DONE_POSITION                          0x0
#define _NVMCON0_NOT_DONE_SIZE                              0x1
#define _NVMCON0_NOT_DONE_LENGTH                            0x1
#define _NVMCON0_NOT_DONE_MASK                              0x1
#define _NVMCON0_nDONE_POSN                                 0x0
#define _NVMCON0_nDONE_POSITION                             0x0
#define _NVMCON0_nDONE_SIZE                                 0x1
#define _NVMCON0_nDONE_LENGTH                               0x1
#define _NVMCON0_nDONE_MASK                                 0x1
#define _NVMCON0_NVMGO_POSN                                 0x0
#define _NVMCON0_NVMGO_POSITION                             0x0
#define _NVMCON0_NVMGO_SIZE                                 0x1
#define _NVMCON0_NVMGO_LENGTH                               0x1
#define _NVMCON0_NVMGO_MASK                                 0x1

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0x059);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 059h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMD                    :3;
        unsigned                        :4;
        unsigned WRERR                  :1;
    };
    struct {
        unsigned NVMCMD                 :3;
    };
} NVMCON1bits_t;
extern volatile NVMCON1bits_t NVMCON1bits __at(0x059);
// bitfield macros
#define _NVMCON1_CMD_POSN                                   0x0
#define _NVMCON1_CMD_POSITION                               0x0
#define _NVMCON1_CMD_SIZE                                   0x3
#define _NVMCON1_CMD_LENGTH                                 0x3
#define _NVMCON1_CMD_MASK                                   0x7
#define _NVMCON1_WRERR_POSN                                 0x7
#define _NVMCON1_WRERR_POSITION                             0x7
#define _NVMCON1_WRERR_SIZE                                 0x1
#define _NVMCON1_WRERR_LENGTH                               0x1
#define _NVMCON1_WRERR_MASK                                 0x80
#define _NVMCON1_NVMCMD_POSN                                0x0
#define _NVMCON1_NVMCMD_POSITION                            0x0
#define _NVMCON1_NVMCMD_SIZE                                0x3
#define _NVMCON1_NVMCMD_LENGTH                              0x3
#define _NVMCON1_NVMCMD_MASK                                0x7

// Register: NVMLOCK
#define NVMLOCK NVMLOCK
extern volatile unsigned char           NVMLOCK             __at(0x05A);
#ifndef _LIB_BUILD
asm("NVMLOCK equ 05Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LOCK                   :8;
    };
    struct {
        unsigned NVMLOCK                :8;
    };
} NVMLOCKbits_t;
extern volatile NVMLOCKbits_t NVMLOCKbits __at(0x05A);
// bitfield macros
#define _NVMLOCK_LOCK_POSN                                  0x0
#define _NVMLOCK_LOCK_POSITION                              0x0
#define _NVMLOCK_LOCK_SIZE                                  0x8
#define _NVMLOCK_LOCK_LENGTH                                0x8
#define _NVMLOCK_LOCK_MASK                                  0xFF
#define _NVMLOCK_NVMLOCK_POSN                               0x0
#define _NVMLOCK_NVMLOCK_POSITION                           0x0
#define _NVMLOCK_NVMLOCK_SIZE                               0x8
#define _NVMLOCK_NVMLOCK_LENGTH                             0x8
#define _NVMLOCK_NVMLOCK_MASK                               0xFF

// Register: NVMADR
#define NVMADR NVMADR
#ifndef __CCI__
extern volatile __uint24                NVMADR              __at(0x05B);
#endif
#ifndef _LIB_BUILD
asm("NVMADR equ 05Bh");
#endif

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x05B);
#ifndef _LIB_BUILD
asm("NVMADRL equ 05Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRL                :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x05B);
// bitfield macros
#define _NVMADRL_NVMADRL_POSN                               0x0
#define _NVMADRL_NVMADRL_POSITION                           0x0
#define _NVMADRL_NVMADRL_SIZE                               0x8
#define _NVMADRL_NVMADRL_LENGTH                             0x8
#define _NVMADRL_NVMADRL_MASK                               0xFF
#define _NVMADRL_NVMADR0_POSN                               0x0
#define _NVMADRL_NVMADR0_POSITION                           0x0
#define _NVMADRL_NVMADR0_SIZE                               0x1
#define _NVMADRL_NVMADR0_LENGTH                             0x1
#define _NVMADRL_NVMADR0_MASK                               0x1
#define _NVMADRL_NVMADR1_POSN                               0x1
#define _NVMADRL_NVMADR1_POSITION                           0x1
#define _NVMADRL_NVMADR1_SIZE                               0x1
#define _NVMADRL_NVMADR1_LENGTH                             0x1
#define _NVMADRL_NVMADR1_MASK                               0x2
#define _NVMADRL_NVMADR2_POSN                               0x2
#define _NVMADRL_NVMADR2_POSITION                           0x2
#define _NVMADRL_NVMADR2_SIZE                               0x1
#define _NVMADRL_NVMADR2_LENGTH                             0x1
#define _NVMADRL_NVMADR2_MASK                               0x4
#define _NVMADRL_NVMADR3_POSN                               0x3
#define _NVMADRL_NVMADR3_POSITION                           0x3
#define _NVMADRL_NVMADR3_SIZE                               0x1
#define _NVMADRL_NVMADR3_LENGTH                             0x1
#define _NVMADRL_NVMADR3_MASK                               0x8
#define _NVMADRL_NVMADR4_POSN                               0x4
#define _NVMADRL_NVMADR4_POSITION                           0x4
#define _NVMADRL_NVMADR4_SIZE                               0x1
#define _NVMADRL_NVMADR4_LENGTH                             0x1
#define _NVMADRL_NVMADR4_MASK                               0x10
#define _NVMADRL_NVMADR5_POSN                               0x5
#define _NVMADRL_NVMADR5_POSITION                           0x5
#define _NVMADRL_NVMADR5_SIZE                               0x1
#define _NVMADRL_NVMADR5_LENGTH                             0x1
#define _NVMADRL_NVMADR5_MASK                               0x20
#define _NVMADRL_NVMADR6_POSN                               0x6
#define _NVMADRL_NVMADR6_POSITION                           0x6
#define _NVMADRL_NVMADR6_SIZE                               0x1
#define _NVMADRL_NVMADR6_LENGTH                             0x1
#define _NVMADRL_NVMADR6_MASK                               0x40
#define _NVMADRL_NVMADR7_POSN                               0x7
#define _NVMADRL_NVMADR7_POSITION                           0x7
#define _NVMADRL_NVMADR7_SIZE                               0x1
#define _NVMADRL_NVMADR7_LENGTH                             0x1
#define _NVMADRL_NVMADR7_MASK                               0x80

