garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: CRCDATAU
#define CRCDATAU CRCDATAU
extern volatile unsigned char           CRCDATAU            __at(0x062);
#ifndef _LIB_BUILD
asm("CRCDATAU equ 062h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATA                   :8;
    };
    struct {
        unsigned DATA16                 :1;
        unsigned DATA17                 :1;
        unsigned DATA18                 :1;
        unsigned DATA19                 :1;
        unsigned DATA20                 :1;
        unsigned DATA21                 :1;
        unsigned DATA22                 :1;
        unsigned DATA23                 :1;
    };
} CRCDATAUbits_t;
extern volatile CRCDATAUbits_t CRCDATAUbits __at(0x062);
// bitfield macros
#define _CRCDATAU_DATA_POSN                                 0x0
#define _CRCDATAU_DATA_POSITION                             0x0
#define _CRCDATAU_DATA_SIZE                                 0x8
#define _CRCDATAU_DATA_LENGTH                               0x8
#define _CRCDATAU_DATA_MASK                                 0xFF
#define _CRCDATAU_DATA16_POSN                               0x0
#define _CRCDATAU_DATA16_POSITION                           0x0
#define _CRCDATAU_DATA16_SIZE                               0x1
#define _CRCDATAU_DATA16_LENGTH                             0x1
#define _CRCDATAU_DATA16_MASK                               0x1
#define _CRCDATAU_DATA17_POSN                               0x1
#define _CRCDATAU_DATA17_POSITION                           0x1
#define _CRCDATAU_DATA17_SIZE                               0x1
#define _CRCDATAU_DATA17_LENGTH                             0x1
#define _CRCDATAU_DATA17_MASK                               0x2
#define _CRCDATAU_DATA18_POSN                               0x2
#define _CRCDATAU_DATA18_POSITION                           0x2
#define _CRCDATAU_DATA18_SIZE                               0x1
#define _CRCDATAU_DATA18_LENGTH                             0x1
#define _CRCDATAU_DATA18_MASK                               0x4
#define _CRCDATAU_DATA19_POSN                               0x3
#define _CRCDATAU_DATA19_POSITION                           0x3
#define _CRCDATAU_DATA19_SIZE                               0x1
#define _CRCDATAU_DATA19_LENGTH                             0x1
#define _CRCDATAU_DATA19_MASK                               0x8
#define _CRCDATAU_DATA20_POSN                               0x4
#define _CRCDATAU_DATA20_POSITION                           0x4
#define _CRCDATAU_DATA20_SIZE                               0x1
#define _CRCDATAU_DATA20_LENGTH                             0x1
#define _CRCDATAU_DATA20_MASK                               0x10
#define _CRCDATAU_DATA21_POSN                               0x5
#define _CRCDATAU_DATA21_POSITION                           0x5
#define _CRCDATAU_DATA21_SIZE                               0x1
#define _CRCDATAU_DATA21_LENGTH                             0x1
#define _CRCDATAU_DATA21_MASK                               0x20
#define _CRCDATAU_DATA22_POSN                               0x6
#define _CRCDATAU_DATA22_POSITION                           0x6
#define _CRCDATAU_DATA22_SIZE                               0x1
#define _CRCDATAU_DATA22_LENGTH                             0x1
#define _CRCDATAU_DATA22_MASK                               0x40
#define _CRCDATAU_DATA23_POSN                               0x7
#define _CRCDATAU_DATA23_POSITION                           0x7
#define _CRCDATAU_DATA23_SIZE                               0x1
#define _CRCDATAU_DATA23_LENGTH                             0x1
#define _CRCDATAU_DATA23_MASK                               0x80

// Register: CRCDATAT
#define CRCDATAT CRCDATAT
extern volatile unsigned char           CRCDATAT            __at(0x063);
#ifndef _LIB_BUILD
asm("CRCDATAT equ 063h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATA                   :8;
    };
    struct {
        unsigned DATA24                 :1;
        unsigned DATA25                 :1;
        unsigned DATA26                 :1;
        unsigned DATA27                 :1;
        unsigned DATA28                 :1;
        unsigned DATA29                 :1;
        unsigned DATA30                 :1;
        unsigned DATA31                 :1;
    };
} CRCDATATbits_t;
extern volatile CRCDATATbits_t CRCDATATbits __at(0x063);
// bitfield macros
#define _CRCDATAT_DATA_POSN                                 0x0
#define _CRCDATAT_DATA_POSITION                             0x0
#define _CRCDATAT_DATA_SIZE                                 0x8
#define _CRCDATAT_DATA_LENGTH                               0x8
#define _CRCDATAT_DATA_MASK                                 0xFF
#define _CRCDATAT_DATA24_POSN                               0x0
#define _CRCDATAT_DATA24_POSITION                           0x0
#define _CRCDATAT_DATA24_SIZE                               0x1
#define _CRCDATAT_DATA24_LENGTH                             0x1
#define _CRCDATAT_DATA24_MASK                               0x1
#define _CRCDATAT_DATA25_POSN                               0x1
#define _CRCDATAT_DATA25_POSITION                           0x1
#define _CRCDATAT_DATA25_SIZE                               0x1
#define _CRCDATAT_DATA25_LENGTH                             0x1
#define _CRCDATAT_DATA25_MASK                               0x2
#define _CRCDATAT_DATA26_POSN                               0x2
#define _CRCDATAT_DATA26_POSITION                           0x2
#define _CRCDATAT_DATA26_SIZE                               0x1
#define _CRCDATAT_DATA26_LENGTH                             0x1
#define _CRCDATAT_DATA26_MASK                               0x4
#define _CRCDATAT_DATA27_POSN                               0x3
#define _CRCDATAT_DATA27_POSITION                           0x3
#define _CRCDATAT_DATA27_SIZE                               0x1
#define _CRCDATAT_DATA27_LENGTH                             0x1
#define _CRCDATAT_DATA27_MASK                               0x8
#define _CRCDATAT_DATA28_POSN                               0x4
#define _CRCDATAT_DATA28_POSITION                           0x4
#define _CRCDATAT_DATA28_SIZE                               0x1
#define _CRCDATAT_DATA28_LENGTH                             0x1
#define _CRCDATAT_DATA28_MASK                               0x10
#define _CRCDATAT_DATA29_POSN                               0x5
#define _CRCDATAT_DATA29_POSITION                           0x5
#define _CRCDATAT_DATA29_SIZE                               0x1
#define _CRCDATAT_DATA29_LENGTH                             0x1
#define _CRCDATAT_DATA29_MASK                               0x20
#define _CRCDATAT_DATA30_POSN                               0x6
#define _CRCDATAT_DATA30_POSITION                           0x6
#define _CRCDATAT_DATA30_SIZE                               0x1
#define _CRCDATAT_DATA30_LENGTH                             0x1
#define _CRCDATAT_DATA30_MASK                               0x40
#define _CRCDATAT_DATA31_POSN                               0x7
#define _CRCDATAT_DATA31_POSITION                           0x7
#define _CRCDATAT_DATA31_SIZE                               0x1
#define _CRCDATAT_DATA31_LENGTH                             0x1
#define _CRCDATAT_DATA31_MASK                               0x80

// Register: CRCOUT
#define CRCOUT CRCOUT
extern volatile unsigned long           CRCOUT              __at(0x064);
#ifndef _LIB_BUILD
asm("CRCOUT equ 064h");
#endif
// aliases
extern volatile unsigned long           CRCSHFT             __at(0x064);
#ifndef _LIB_BUILD
asm("CRCSHFT equ 064h");
#endif
extern volatile unsigned long           CRCXOR              __at(0x064);
#ifndef _LIB_BUILD
asm("CRCXOR equ 064h");
#endif

