garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: I3C1STAT0
#define I3C1STAT0 I3C1STAT0
extern volatile unsigned char           I3C1STAT0           __at(0x087);
#ifndef _LIB_BUILD
asm("I3C1STAT0 equ 087h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RNW                    :2;
        unsigned RXBF                   :1;
        unsigned TXBE                   :1;
        unsigned RSTDET                 :1;
        unsigned OPMD                   :2;
        unsigned BFREE                  :1;
    };
} I3C1STAT0bits_t;
extern volatile I3C1STAT0bits_t I3C1STAT0bits __at(0x087);
// bitfield macros
#define _I3C1STAT0_RNW_POSN                                 0x0
#define _I3C1STAT0_RNW_POSITION                             0x0
#define _I3C1STAT0_RNW_SIZE                                 0x2
#define _I3C1STAT0_RNW_LENGTH                               0x2
#define _I3C1STAT0_RNW_MASK                                 0x3
#define _I3C1STAT0_RXBF_POSN                                0x2
#define _I3C1STAT0_RXBF_POSITION                            0x2
#define _I3C1STAT0_RXBF_SIZE                                0x1
#define _I3C1STAT0_RXBF_LENGTH                              0x1
#define _I3C1STAT0_RXBF_MASK                                0x4
#define _I3C1STAT0_TXBE_POSN                                0x3
#define _I3C1STAT0_TXBE_POSITION                            0x3
#define _I3C1STAT0_TXBE_SIZE                                0x1
#define _I3C1STAT0_TXBE_LENGTH                              0x1
#define _I3C1STAT0_TXBE_MASK                                0x8
#define _I3C1STAT0_RSTDET_POSN                              0x4
#define _I3C1STAT0_RSTDET_POSITION                          0x4
#define _I3C1STAT0_RSTDET_SIZE                              0x1
#define _I3C1STAT0_RSTDET_LENGTH                            0x1
#define _I3C1STAT0_RSTDET_MASK                              0x10
#define _I3C1STAT0_OPMD_POSN                                0x5
#define _I3C1STAT0_OPMD_POSITION                            0x5
#define _I3C1STAT0_OPMD_SIZE                                0x2
#define _I3C1STAT0_OPMD_LENGTH                              0x2
#define _I3C1STAT0_OPMD_MASK                                0x60
#define _I3C1STAT0_BFREE_POSN                               0x7
#define _I3C1STAT0_BFREE_POSITION                           0x7
#define _I3C1STAT0_BFREE_SIZE                               0x1
#define _I3C1STAT0_BFREE_LENGTH                             0x1
#define _I3C1STAT0_BFREE_MASK                               0x80

// Register: I3C1STAT1
#define I3C1STAT1 I3C1STAT1
extern volatile unsigned char           I3C1STAT1           __at(0x088);
#ifndef _LIB_BUILD
asm("I3C1STAT1 equ 088h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXFNE                  :1;
    };
} I3C1STAT1bits_t;
extern volatile I3C1STAT1bits_t I3C1STAT1bits __at(0x088);
// bitfield macros
#define _I3C1STAT1_TXFNE_POSN                               0x0
#define _I3C1STAT1_TXFNE_POSITION                           0x0
#define _I3C1STAT1_TXFNE_SIZE                               0x1
#define _I3C1STAT1_TXFNE_LENGTH                             0x1
#define _I3C1STAT1_TXFNE_MASK                               0x1

// Register: I3C1BSTAT
#define I3C1BSTAT I3C1BSTAT
extern volatile unsigned char           I3C1BSTAT           __at(0x089);
#ifndef _LIB_BUILD
asm("I3C1BSTAT equ 089h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TE0ERR                 :1;
        unsigned TE1ERR                 :1;
        unsigned TE2ERR                 :1;
        unsigned TE3ERR                 :1;
        unsigned TE4ERR                 :1;
        unsigned TE5ERR                 :1;
        unsigned TE6ERR                 :1;
    };
} I3C1BSTATbits_t;
extern volatile I3C1BSTATbits_t I3C1BSTATbits __at(0x089);
// bitfield macros
#define _I3C1BSTAT_TE0ERR_POSN                              0x0
#define _I3C1BSTAT_TE0ERR_POSITION                          0x0
#define _I3C1BSTAT_TE0ERR_SIZE                              0x1
#define _I3C1BSTAT_TE0ERR_LENGTH                            0x1
#define _I3C1BSTAT_TE0ERR_MASK                              0x1
#define _I3C1BSTAT_TE1ERR_POSN                              0x1
#define _I3C1BSTAT_TE1ERR_POSITION                          0x1
#define _I3C1BSTAT_TE1ERR_SIZE                              0x1
#define _I3C1BSTAT_TE1ERR_LENGTH                            0x1
#define _I3C1BSTAT_TE1ERR_MASK                              0x2
#define _I3C1BSTAT_TE2ERR_POSN                              0x2
#define _I3C1BSTAT_TE2ERR_POSITION                          0x2
#define _I3C1BSTAT_TE2ERR_SIZE                              0x1
#define _I3C1BSTAT_TE2ERR_LENGTH                            0x1
#define _I3C1BSTAT_TE2ERR_MASK                              0x4
#define _I3C1BSTAT_TE3ERR_POSN                              0x3
#define _I3C1BSTAT_TE3ERR_POSITION                          0x3
#define _I3C1BSTAT_TE3ERR_SIZE                              0x1
#define _I3C1BSTAT_TE3ERR_LENGTH                            0x1
#define _I3C1BSTAT_TE3ERR_MASK                              0x8
#define _I3C1BSTAT_TE4ERR_POSN                              0x4
#define _I3C1BSTAT_TE4ERR_POSITION                          0x4
#define _I3C1BSTAT_TE4ERR_SIZE                              0x1
#define _I3C1BSTAT_TE4ERR_LENGTH                            0x1
#define _I3C1BSTAT_TE4ERR_MASK                              0x10
#define _I3C1BSTAT_TE5ERR_POSN                              0x5
#define _I3C1BSTAT_TE5ERR_POSITION                          0x5
#define _I3C1BSTAT_TE5ERR_SIZE                              0x1
#define _I3C1BSTAT_TE5ERR_LENGTH                            0x1
#define _I3C1BSTAT_TE5ERR_MASK                              0x20
#define _I3C1BSTAT_TE6ERR_POSN                              0x6
#define _I3C1BSTAT_TE6ERR_POSITION                          0x6
#define _I3C1BSTAT_TE6ERR_SIZE                              0x1
#define _I3C1BSTAT_TE6ERR_LENGTH                            0x1
#define _I3C1BSTAT_TE6ERR_MASK                              0x40

// Register: I3C1PIR0
#define I3C1PIR0 I3C1PIR0
extern volatile unsigned char           I3C1PIR0            __at(0x08A);
#ifndef _LIB_BUILD
asm("I3C1PIR0 equ 08Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCCCIF                 :1;
        unsigned BTFIF                  :1;
        unsigned DADRIF                 :1;
        unsigned SADRIF                 :1;
        unsigned I2CACKIF               :1;
        unsigned RSCIF                  :1;
        unsigned PCIF                   :1;
        unsigned SCIF                   :1;
    };
} I3C1PIR0bits_t;
extern volatile I3C1PIR0bits_t I3C1PIR0bits __at(0x08A);
// bitfield macros
#define _I3C1PIR0_SCCCIF_POSN                               0x0
#define _I3C1PIR0_SCCCIF_POSITION                           0x0
#define _I3C1PIR0_SCCCIF_SIZE                               0x1
#define _I3C1PIR0_SCCCIF_LENGTH                             0x1
#define _I3C1PIR0_SCCCIF_MASK                               0x1
#define _I3C1PIR0_BTFIF_POSN                                0x1
#define _I3C1PIR0_BTFIF_POSITION                            0x1
#define _I3C1PIR0_BTFIF_SIZE                                0x1
#define _I3C1PIR0_BTFIF_LENGTH                              0x1
#define _I3C1PIR0_BTFIF_MASK                                0x2
#define _I3C1PIR0_DADRIF_POSN                               0x2
#define _I3C1PIR0_DADRIF_POSITION                           0x2
#define _I3C1PIR0_DADRIF_SIZE                               0x1
#define _I3C1PIR0_DADRIF_LENGTH                             0x1
#define _I3C1PIR0_DADRIF_MASK                               0x4
#define _I3C1PIR0_SADRIF_POSN                               0x3
#define _I3C1PIR0_SADRIF_POSITION                           0x3
#define _I3C1PIR0_SADRIF_SIZE                               0x1
#define _I3C1PIR0_SADRIF_LENGTH                             0x1
#define _I3C1PIR0_SADRIF_MASK                               0x8
#define _I3C1PIR0_I2CACKIF_POSN                             0x4
#define _I3C1PIR0_I2CACKIF_POSITION                         0x4
#define _I3C1PIR0_I2CACKIF_SIZE                             0x1
#define _I3C1PIR0_I2CACKIF_LENGTH                           0x1
#define _I3C1PIR0_I2CACKIF_MASK                             0x10
#define _I3C1PIR0_RSCIF_POSN                                0x5
#define _I3C1PIR0_RSCIF_POSITION                            0x5
#define _I3C1PIR0_RSCIF_SIZE                                0x1
#define _I3C1PIR0_RSCIF_LENGTH                              0x1
#define _I3C1PIR0_RSCIF_MASK                                0x20
#define _I3C1PIR0_PCIF_POSN                                 0x6
#define _I3C1PIR0_PCIF_POSITION                             0x6
#define _I3C1PIR0_PCIF_SIZE                                 0x1
#define _I3C1PIR0_PCIF_LENGTH                               0x1
#define _I3C1PIR0_PCIF_MASK                                 0x40
#define _I3C1PIR0_SCIF_POSN                                 0x7
#define _I3C1PIR0_SCIF_POSITION                             0x7
#define _I3C1PIR0_SCIF_SIZE                                 0x1
#define _I3C1PIR0_SCIF_LENGTH                               0x1
#define _I3C1PIR0_SCIF_MASK                                 0x80

