garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: I3C1PIE0
#define I3C1PIE0 I3C1PIE0
extern volatile unsigned char           I3C1PIE0            __at(0x08E);
#ifndef _LIB_BUILD
asm("I3C1PIE0 equ 08Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCCCIE                 :1;
        unsigned BTFIE                  :1;
        unsigned DADRIE                 :1;
        unsigned SADRIE                 :1;
        unsigned I2CACKIE               :1;
        unsigned RSCIE                  :1;
        unsigned PCIE                   :1;
        unsigned SCIE                   :1;
    };
} I3C1PIE0bits_t;
extern volatile I3C1PIE0bits_t I3C1PIE0bits __at(0x08E);
// bitfield macros
#define _I3C1PIE0_SCCCIE_POSN                               0x0
#define _I3C1PIE0_SCCCIE_POSITION                           0x0
#define _I3C1PIE0_SCCCIE_SIZE                               0x1
#define _I3C1PIE0_SCCCIE_LENGTH                             0x1
#define _I3C1PIE0_SCCCIE_MASK                               0x1
#define _I3C1PIE0_BTFIE_POSN                                0x1
#define _I3C1PIE0_BTFIE_POSITION                            0x1
#define _I3C1PIE0_BTFIE_SIZE                                0x1
#define _I3C1PIE0_BTFIE_LENGTH                              0x1
#define _I3C1PIE0_BTFIE_MASK                                0x2
#define _I3C1PIE0_DADRIE_POSN                               0x2
#define _I3C1PIE0_DADRIE_POSITION                           0x2
#define _I3C1PIE0_DADRIE_SIZE                               0x1
#define _I3C1PIE0_DADRIE_LENGTH                             0x1
#define _I3C1PIE0_DADRIE_MASK                               0x4
#define _I3C1PIE0_SADRIE_POSN                               0x3
#define _I3C1PIE0_SADRIE_POSITION                           0x3
#define _I3C1PIE0_SADRIE_SIZE                               0x1
#define _I3C1PIE0_SADRIE_LENGTH                             0x1
#define _I3C1PIE0_SADRIE_MASK                               0x8
#define _I3C1PIE0_I2CACKIE_POSN                             0x4
#define _I3C1PIE0_I2CACKIE_POSITION                         0x4
#define _I3C1PIE0_I2CACKIE_SIZE                             0x1
#define _I3C1PIE0_I2CACKIE_LENGTH                           0x1
#define _I3C1PIE0_I2CACKIE_MASK                             0x10
#define _I3C1PIE0_RSCIE_POSN                                0x5
#define _I3C1PIE0_RSCIE_POSITION                            0x5
#define _I3C1PIE0_RSCIE_SIZE                                0x1
#define _I3C1PIE0_RSCIE_LENGTH                              0x1
#define _I3C1PIE0_RSCIE_MASK                                0x20
#define _I3C1PIE0_PCIE_POSN                                 0x6
#define _I3C1PIE0_PCIE_POSITION                             0x6
#define _I3C1PIE0_PCIE_SIZE                                 0x1
#define _I3C1PIE0_PCIE_LENGTH                               0x1
#define _I3C1PIE0_PCIE_MASK                                 0x40
#define _I3C1PIE0_SCIE_POSN                                 0x7
#define _I3C1PIE0_SCIE_POSITION                             0x7
#define _I3C1PIE0_SCIE_SIZE                                 0x1
#define _I3C1PIE0_SCIE_LENGTH                               0x1
#define _I3C1PIE0_SCIE_MASK                                 0x80

// Register: I3C1PIE1
#define I3C1PIE1 I3C1PIE1
extern volatile unsigned char           I3C1PIE1            __at(0x08F);
#ifndef _LIB_BUILD
asm("I3C1PIE1 equ 08Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IBIDONEIE              :1;
        unsigned DACHIE                 :1;
        unsigned TCOMPIE                :1;
    };
} I3C1PIE1bits_t;
extern volatile I3C1PIE1bits_t I3C1PIE1bits __at(0x08F);
// bitfield macros
#define _I3C1PIE1_IBIDONEIE_POSN                            0x5
#define _I3C1PIE1_IBIDONEIE_POSITION                        0x5
#define _I3C1PIE1_IBIDONEIE_SIZE                            0x1
#define _I3C1PIE1_IBIDONEIE_LENGTH                          0x1
#define _I3C1PIE1_IBIDONEIE_MASK                            0x20
#define _I3C1PIE1_DACHIE_POSN                               0x6
#define _I3C1PIE1_DACHIE_POSITION                           0x6
#define _I3C1PIE1_DACHIE_SIZE                               0x1
#define _I3C1PIE1_DACHIE_LENGTH                             0x1
#define _I3C1PIE1_DACHIE_MASK                               0x40
#define _I3C1PIE1_TCOMPIE_POSN                              0x7
#define _I3C1PIE1_TCOMPIE_POSITION                          0x7
#define _I3C1PIE1_TCOMPIE_SIZE                              0x1
#define _I3C1PIE1_TCOMPIE_LENGTH                            0x1
#define _I3C1PIE1_TCOMPIE_MASK                              0x80

// Register: I3C1ERRIE0
#define I3C1ERRIE0 I3C1ERRIE0
extern volatile unsigned char           I3C1ERRIE0          __at(0x090);
#ifndef _LIB_BUILD
asm("I3C1ERRIE0 equ 090h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UCCCIE                 :1;
        unsigned BTOIE                  :1;
        unsigned BUSEIE                 :1;
        unsigned IBIEIE                 :1;
        unsigned HJEIE                  :1;
        unsigned RXOIE                  :1;
        unsigned TXUIE                  :1;
        unsigned I2CNACKIE              :1;
    };
} I3C1ERRIE0bits_t;
extern volatile I3C1ERRIE0bits_t I3C1ERRIE0bits __at(0x090);
// bitfield macros
#define _I3C1ERRIE0_UCCCIE_POSN                             0x0
#define _I3C1ERRIE0_UCCCIE_POSITION                         0x0
#define _I3C1ERRIE0_UCCCIE_SIZE                             0x1
#define _I3C1ERRIE0_UCCCIE_LENGTH                           0x1
#define _I3C1ERRIE0_UCCCIE_MASK                             0x1
#define _I3C1ERRIE0_BTOIE_POSN                              0x1
#define _I3C1ERRIE0_BTOIE_POSITION                          0x1
#define _I3C1ERRIE0_BTOIE_SIZE                              0x1
#define _I3C1ERRIE0_BTOIE_LENGTH                            0x1
#define _I3C1ERRIE0_BTOIE_MASK                              0x2
#define _I3C1ERRIE0_BUSEIE_POSN                             0x2
#define _I3C1ERRIE0_BUSEIE_POSITION                         0x2
#define _I3C1ERRIE0_BUSEIE_SIZE                             0x1
#define _I3C1ERRIE0_BUSEIE_LENGTH                           0x1
#define _I3C1ERRIE0_BUSEIE_MASK                             0x4
#define _I3C1ERRIE0_IBIEIE_POSN                             0x3
#define _I3C1ERRIE0_IBIEIE_POSITION                         0x3
#define _I3C1ERRIE0_IBIEIE_SIZE                             0x1
#define _I3C1ERRIE0_IBIEIE_LENGTH                           0x1
#define _I3C1ERRIE0_IBIEIE_MASK                             0x8
#define _I3C1ERRIE0_HJEIE_POSN                              0x4
#define _I3C1ERRIE0_HJEIE_POSITION                          0x4
#define _I3C1ERRIE0_HJEIE_SIZE                              0x1
#define _I3C1ERRIE0_HJEIE_LENGTH                            0x1
#define _I3C1ERRIE0_HJEIE_MASK                              0x10
#define _I3C1ERRIE0_RXOIE_POSN                              0x5
#define _I3C1ERRIE0_RXOIE_POSITION                          0x5
#define _I3C1ERRIE0_RXOIE_SIZE                              0x1
#define _I3C1ERRIE0_RXOIE_LENGTH                            0x1
#define _I3C1ERRIE0_RXOIE_MASK                              0x20
#define _I3C1ERRIE0_TXUIE_POSN                              0x6
#define _I3C1ERRIE0_TXUIE_POSITION                          0x6
#define _I3C1ERRIE0_TXUIE_SIZE                              0x1
#define _I3C1ERRIE0_TXUIE_LENGTH                            0x1
#define _I3C1ERRIE0_TXUIE_MASK                              0x40
#define _I3C1ERRIE0_I2CNACKIE_POSN                          0x7
#define _I3C1ERRIE0_I2CNACKIE_POSITION                      0x7
#define _I3C1ERRIE0_I2CNACKIE_SIZE                          0x1
#define _I3C1ERRIE0_I2CNACKIE_LENGTH                        0x1
#define _I3C1ERRIE0_I2CNACKIE_MASK                          0x80

// Register: I3C1ERRIE1
#define I3C1ERRIE1 I3C1ERRIE1
extern volatile unsigned char           I3C1ERRIE1          __at(0x091);
#ifndef _LIB_BUILD
asm("I3C1ERRIE1 equ 091h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXREIE                 :1;
        unsigned TXWEIE                 :1;
        unsigned MWLOEIE                :1;
        unsigned ABEIE                  :1;
    };
} I3C1ERRIE1bits_t;
extern volatile I3C1ERRIE1bits_t I3C1ERRIE1bits __at(0x091);
// bitfield macros
#define _I3C1ERRIE1_RXREIE_POSN                             0x0
#define _I3C1ERRIE1_RXREIE_POSITION                         0x0
#define _I3C1ERRIE1_RXREIE_SIZE                             0x1
#define _I3C1ERRIE1_RXREIE_LENGTH                           0x1
#define _I3C1ERRIE1_RXREIE_MASK                             0x1
#define _I3C1ERRIE1_TXWEIE_POSN                             0x1
#define _I3C1ERRIE1_TXWEIE_POSITION                         0x1
#define _I3C1ERRIE1_TXWEIE_SIZE                             0x1
#define _I3C1ERRIE1_TXWEIE_LENGTH                           0x1
#define _I3C1ERRIE1_TXWEIE_MASK                             0x2
#define _I3C1ERRIE1_MWLOEIE_POSN                            0x2
#define _I3C1ERRIE1_MWLOEIE_POSITION                        0x2
#define _I3C1ERRIE1_MWLOEIE_SIZE                            0x1
#define _I3C1ERRIE1_MWLOEIE_LENGTH                          0x1
#define _I3C1ERRIE1_MWLOEIE_MASK                            0x4
#define _I3C1ERRIE1_ABEIE_POSN                              0x3
#define _I3C1ERRIE1_ABEIE_POSITION                          0x3
#define _I3C1ERRIE1_ABEIE_SIZE                              0x1
#define _I3C1ERRIE1_ABEIE_LENGTH                            0x1
#define _I3C1ERRIE1_ABEIE_MASK                              0x8

// Register: I3C1BIDL
#define I3C1BIDL I3C1BIDL
extern volatile unsigned short          I3C1BIDL            __at(0x092);
#ifndef _LIB_BUILD
asm("I3C1BIDL equ 092h");
#endif

// Register: I3C1BIDLL
#define I3C1BIDLL I3C1BIDLL
extern volatile unsigned char           I3C1BIDLL           __at(0x092);
#ifndef _LIB_BUILD
asm("I3C1BIDLL equ 092h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIDLL                  :8;
    };
} I3C1BIDLLbits_t;
extern volatile I3C1BIDLLbits_t I3C1BIDLLbits __at(0x092);
// bitfield macros
#define _I3C1BIDLL_BIDLL_POSN                               0x0
#define _I3C1BIDLL_BIDLL_POSITION                           0x0
#define _I3C1BIDLL_BIDLL_SIZE                               0x8
#define _I3C1BIDLL_BIDLL_LENGTH                             0x8
#define _I3C1BIDLL_BIDLL_MASK                               0xFF

