garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: I3C2CON0
#define I3C2CON0 I3C2CON0
extern volatile unsigned char           I3C2CON0            __at(0x0B6);
#ifndef _LIB_BUILD
asm("I3C2CON0 equ 0B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBIREQ                 :1;
        unsigned HJREQ                  :1;
        unsigned ACKP                   :1;
        unsigned CLRRXB                 :1;
        unsigned CLRTXB                 :1;
        unsigned RST                    :1;
        unsigned BTOEN                  :1;
        unsigned EN                     :1;
    };
} I3C2CON0bits_t;
extern volatile I3C2CON0bits_t I3C2CON0bits __at(0x0B6);
// bitfield macros
#define _I3C2CON0_IBIREQ_POSN                               0x0
#define _I3C2CON0_IBIREQ_POSITION                           0x0
#define _I3C2CON0_IBIREQ_SIZE                               0x1
#define _I3C2CON0_IBIREQ_LENGTH                             0x1
#define _I3C2CON0_IBIREQ_MASK                               0x1
#define _I3C2CON0_HJREQ_POSN                                0x1
#define _I3C2CON0_HJREQ_POSITION                            0x1
#define _I3C2CON0_HJREQ_SIZE                                0x1
#define _I3C2CON0_HJREQ_LENGTH                              0x1
#define _I3C2CON0_HJREQ_MASK                                0x2
#define _I3C2CON0_ACKP_POSN                                 0x2
#define _I3C2CON0_ACKP_POSITION                             0x2
#define _I3C2CON0_ACKP_SIZE                                 0x1
#define _I3C2CON0_ACKP_LENGTH                               0x1
#define _I3C2CON0_ACKP_MASK                                 0x4
#define _I3C2CON0_CLRRXB_POSN                               0x3
#define _I3C2CON0_CLRRXB_POSITION                           0x3
#define _I3C2CON0_CLRRXB_SIZE                               0x1
#define _I3C2CON0_CLRRXB_LENGTH                             0x1
#define _I3C2CON0_CLRRXB_MASK                               0x8
#define _I3C2CON0_CLRTXB_POSN                               0x4
#define _I3C2CON0_CLRTXB_POSITION                           0x4
#define _I3C2CON0_CLRTXB_SIZE                               0x1
#define _I3C2CON0_CLRTXB_LENGTH                             0x1
#define _I3C2CON0_CLRTXB_MASK                               0x10
#define _I3C2CON0_RST_POSN                                  0x5
#define _I3C2CON0_RST_POSITION                              0x5
#define _I3C2CON0_RST_SIZE                                  0x1
#define _I3C2CON0_RST_LENGTH                                0x1
#define _I3C2CON0_RST_MASK                                  0x20
#define _I3C2CON0_BTOEN_POSN                                0x6
#define _I3C2CON0_BTOEN_POSITION                            0x6
#define _I3C2CON0_BTOEN_SIZE                                0x1
#define _I3C2CON0_BTOEN_LENGTH                              0x1
#define _I3C2CON0_BTOEN_MASK                                0x40
#define _I3C2CON0_EN_POSN                                   0x7
#define _I3C2CON0_EN_POSITION                               0x7
#define _I3C2CON0_EN_SIZE                                   0x1
#define _I3C2CON0_EN_LENGTH                                 0x1
#define _I3C2CON0_EN_MASK                                   0x80

// Register: I3C2CON1
#define I3C2CON1 I3C2CON1
extern volatile unsigned char           I3C2CON1            __at(0x0B7);
#ifndef _LIB_BUILD
asm("I3C2CON1 equ 0B7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACKPOS                 :1;
        unsigned SASDRMD                :1;
        unsigned FHDRE                  :1;
        unsigned BERRDET                :1;
    };
} I3C2CON1bits_t;
extern volatile I3C2CON1bits_t I3C2CON1bits __at(0x0B7);
// bitfield macros
#define _I3C2CON1_ACKPOS_POSN                               0x0
#define _I3C2CON1_ACKPOS_POSITION                           0x0
#define _I3C2CON1_ACKPOS_SIZE                               0x1
#define _I3C2CON1_ACKPOS_LENGTH                             0x1
#define _I3C2CON1_ACKPOS_MASK                               0x1
#define _I3C2CON1_SASDRMD_POSN                              0x1
#define _I3C2CON1_SASDRMD_POSITION                          0x1
#define _I3C2CON1_SASDRMD_SIZE                              0x1
#define _I3C2CON1_SASDRMD_LENGTH                            0x1
#define _I3C2CON1_SASDRMD_MASK                              0x2
#define _I3C2CON1_FHDRE_POSN                                0x2
#define _I3C2CON1_FHDRE_POSITION                            0x2
#define _I3C2CON1_FHDRE_SIZE                                0x1
#define _I3C2CON1_FHDRE_LENGTH                              0x1
#define _I3C2CON1_FHDRE_MASK                                0x4
#define _I3C2CON1_BERRDET_POSN                              0x3
#define _I3C2CON1_BERRDET_POSITION                          0x3
#define _I3C2CON1_BERRDET_SIZE                              0x1
#define _I3C2CON1_BERRDET_LENGTH                            0x1
#define _I3C2CON1_BERRDET_MASK                              0x8

// Register: I3C2RXB
#define I3C2RXB I3C2RXB
extern volatile unsigned char           I3C2RXB             __at(0x0B8);
#ifndef _LIB_BUILD
asm("I3C2RXB equ 0B8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} I3C2RXBbits_t;
extern volatile I3C2RXBbits_t I3C2RXBbits __at(0x0B8);
// bitfield macros
#define _I3C2RXB_RXB_POSN                                   0x0
#define _I3C2RXB_RXB_POSITION                               0x0
#define _I3C2RXB_RXB_SIZE                                   0x8
#define _I3C2RXB_RXB_LENGTH                                 0x8
#define _I3C2RXB_RXB_MASK                                   0xFF

// Register: I3C2TXB
#define I3C2TXB I3C2TXB
extern volatile unsigned char           I3C2TXB             __at(0x0B9);
#ifndef _LIB_BUILD
asm("I3C2TXB equ 0B9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I3C2TXBbits_t;
extern volatile I3C2TXBbits_t I3C2TXBbits __at(0x0B9);
// bitfield macros
#define _I3C2TXB_TXB_POSN                                   0x0
#define _I3C2TXB_TXB_POSITION                               0x0
#define _I3C2TXB_TXB_SIZE                                   0x8
#define _I3C2TXB_TXB_LENGTH                                 0x8
#define _I3C2TXB_TXB_MASK                                   0xFF

// Register: I3C2STAT0
#define I3C2STAT0 I3C2STAT0
extern volatile unsigned char           I3C2STAT0           __at(0x0BA);
#ifndef _LIB_BUILD
asm("I3C2STAT0 equ 0BAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RNW                    :2;
        unsigned RXBF                   :1;
        unsigned TXBE                   :1;
        unsigned RSTDET                 :1;
        unsigned OPMD                   :2;
        unsigned BFREE                  :1;
    };
} I3C2STAT0bits_t;
extern volatile I3C2STAT0bits_t I3C2STAT0bits __at(0x0BA);
// bitfield macros
#define _I3C2STAT0_RNW_POSN                                 0x0
#define _I3C2STAT0_RNW_POSITION                             0x0
#define _I3C2STAT0_RNW_SIZE                                 0x2
#define _I3C2STAT0_RNW_LENGTH                               0x2
#define _I3C2STAT0_RNW_MASK                                 0x3
#define _I3C2STAT0_RXBF_POSN                                0x2
#define _I3C2STAT0_RXBF_POSITION                            0x2
#define _I3C2STAT0_RXBF_SIZE                                0x1
#define _I3C2STAT0_RXBF_LENGTH                              0x1
#define _I3C2STAT0_RXBF_MASK                                0x4
#define _I3C2STAT0_TXBE_POSN                                0x3
#define _I3C2STAT0_TXBE_POSITION                            0x3
#define _I3C2STAT0_TXBE_SIZE                                0x1
#define _I3C2STAT0_TXBE_LENGTH                              0x1
#define _I3C2STAT0_TXBE_MASK                                0x8
#define _I3C2STAT0_RSTDET_POSN                              0x4
#define _I3C2STAT0_RSTDET_POSITION                          0x4
#define _I3C2STAT0_RSTDET_SIZE                              0x1
#define _I3C2STAT0_RSTDET_LENGTH                            0x1
#define _I3C2STAT0_RSTDET_MASK                              0x10
#define _I3C2STAT0_OPMD_POSN                                0x5
#define _I3C2STAT0_OPMD_POSITION                            0x5
#define _I3C2STAT0_OPMD_SIZE                                0x2
#define _I3C2STAT0_OPMD_LENGTH                              0x2
#define _I3C2STAT0_OPMD_MASK                                0x60
#define _I3C2STAT0_BFREE_POSN                               0x7
#define _I3C2STAT0_BFREE_POSITION                           0x7
#define _I3C2STAT0_BFREE_SIZE                               0x1
#define _I3C2STAT0_BFREE_LENGTH                             0x1
#define _I3C2STAT0_BFREE_MASK                               0x80

