garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: I3C2PIR1
#define I3C2PIR1 I3C2PIR1
extern volatile unsigned char           I3C2PIR1            __at(0x0BE);
#ifndef _LIB_BUILD
asm("I3C2PIR1 equ 0BEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IBIDONEIF              :1;
        unsigned DACHIF                 :1;
        unsigned TCOMPIF                :1;
    };
} I3C2PIR1bits_t;
extern volatile I3C2PIR1bits_t I3C2PIR1bits __at(0x0BE);
// bitfield macros
#define _I3C2PIR1_IBIDONEIF_POSN                            0x5
#define _I3C2PIR1_IBIDONEIF_POSITION                        0x5
#define _I3C2PIR1_IBIDONEIF_SIZE                            0x1
#define _I3C2PIR1_IBIDONEIF_LENGTH                          0x1
#define _I3C2PIR1_IBIDONEIF_MASK                            0x20
#define _I3C2PIR1_DACHIF_POSN                               0x6
#define _I3C2PIR1_DACHIF_POSITION                           0x6
#define _I3C2PIR1_DACHIF_SIZE                               0x1
#define _I3C2PIR1_DACHIF_LENGTH                             0x1
#define _I3C2PIR1_DACHIF_MASK                               0x40
#define _I3C2PIR1_TCOMPIF_POSN                              0x7
#define _I3C2PIR1_TCOMPIF_POSITION                          0x7
#define _I3C2PIR1_TCOMPIF_SIZE                              0x1
#define _I3C2PIR1_TCOMPIF_LENGTH                            0x1
#define _I3C2PIR1_TCOMPIF_MASK                              0x80

// Register: I3C2ERRIR0
#define I3C2ERRIR0 I3C2ERRIR0
extern volatile unsigned char           I3C2ERRIR0          __at(0x0BF);
#ifndef _LIB_BUILD
asm("I3C2ERRIR0 equ 0BFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UCCCIF                 :1;
        unsigned BTOIF                  :1;
        unsigned BUSEIF                 :1;
        unsigned IBIEIF                 :1;
        unsigned HJEIF                  :1;
        unsigned RXOIF                  :1;
        unsigned TXUIF                  :1;
        unsigned I2CNACKIF              :1;
    };
} I3C2ERRIR0bits_t;
extern volatile I3C2ERRIR0bits_t I3C2ERRIR0bits __at(0x0BF);
// bitfield macros
#define _I3C2ERRIR0_UCCCIF_POSN                             0x0
#define _I3C2ERRIR0_UCCCIF_POSITION                         0x0
#define _I3C2ERRIR0_UCCCIF_SIZE                             0x1
#define _I3C2ERRIR0_UCCCIF_LENGTH                           0x1
#define _I3C2ERRIR0_UCCCIF_MASK                             0x1
#define _I3C2ERRIR0_BTOIF_POSN                              0x1
#define _I3C2ERRIR0_BTOIF_POSITION                          0x1
#define _I3C2ERRIR0_BTOIF_SIZE                              0x1
#define _I3C2ERRIR0_BTOIF_LENGTH                            0x1
#define _I3C2ERRIR0_BTOIF_MASK                              0x2
#define _I3C2ERRIR0_BUSEIF_POSN                             0x2
#define _I3C2ERRIR0_BUSEIF_POSITION                         0x2
#define _I3C2ERRIR0_BUSEIF_SIZE                             0x1
#define _I3C2ERRIR0_BUSEIF_LENGTH                           0x1
#define _I3C2ERRIR0_BUSEIF_MASK                             0x4
#define _I3C2ERRIR0_IBIEIF_POSN                             0x3
#define _I3C2ERRIR0_IBIEIF_POSITION                         0x3
#define _I3C2ERRIR0_IBIEIF_SIZE                             0x1
#define _I3C2ERRIR0_IBIEIF_LENGTH                           0x1
#define _I3C2ERRIR0_IBIEIF_MASK                             0x8
#define _I3C2ERRIR0_HJEIF_POSN                              0x4
#define _I3C2ERRIR0_HJEIF_POSITION                          0x4
#define _I3C2ERRIR0_HJEIF_SIZE                              0x1
#define _I3C2ERRIR0_HJEIF_LENGTH                            0x1
#define _I3C2ERRIR0_HJEIF_MASK                              0x10
#define _I3C2ERRIR0_RXOIF_POSN                              0x5
#define _I3C2ERRIR0_RXOIF_POSITION                          0x5
#define _I3C2ERRIR0_RXOIF_SIZE                              0x1
#define _I3C2ERRIR0_RXOIF_LENGTH                            0x1
#define _I3C2ERRIR0_RXOIF_MASK                              0x20
#define _I3C2ERRIR0_TXUIF_POSN                              0x6
#define _I3C2ERRIR0_TXUIF_POSITION                          0x6
#define _I3C2ERRIR0_TXUIF_SIZE                              0x1
#define _I3C2ERRIR0_TXUIF_LENGTH                            0x1
#define _I3C2ERRIR0_TXUIF_MASK                              0x40
#define _I3C2ERRIR0_I2CNACKIF_POSN                          0x7
#define _I3C2ERRIR0_I2CNACKIF_POSITION                      0x7
#define _I3C2ERRIR0_I2CNACKIF_SIZE                          0x1
#define _I3C2ERRIR0_I2CNACKIF_LENGTH                        0x1
#define _I3C2ERRIR0_I2CNACKIF_MASK                          0x80

// Register: I3C2ERRIR1
#define I3C2ERRIR1 I3C2ERRIR1
extern volatile unsigned char           I3C2ERRIR1          __at(0x0C0);
#ifndef _LIB_BUILD
asm("I3C2ERRIR1 equ 0C0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXREIF                 :1;
        unsigned TXWEIF                 :1;
        unsigned MWLOEIF                :1;
        unsigned ABEIF                  :1;
    };
} I3C2ERRIR1bits_t;
extern volatile I3C2ERRIR1bits_t I3C2ERRIR1bits __at(0x0C0);
// bitfield macros
#define _I3C2ERRIR1_RXREIF_POSN                             0x0
#define _I3C2ERRIR1_RXREIF_POSITION                         0x0
#define _I3C2ERRIR1_RXREIF_SIZE                             0x1
#define _I3C2ERRIR1_RXREIF_LENGTH                           0x1
#define _I3C2ERRIR1_RXREIF_MASK                             0x1
#define _I3C2ERRIR1_TXWEIF_POSN                             0x1
#define _I3C2ERRIR1_TXWEIF_POSITION                         0x1
#define _I3C2ERRIR1_TXWEIF_SIZE                             0x1
#define _I3C2ERRIR1_TXWEIF_LENGTH                           0x1
#define _I3C2ERRIR1_TXWEIF_MASK                             0x2
#define _I3C2ERRIR1_MWLOEIF_POSN                            0x2
#define _I3C2ERRIR1_MWLOEIF_POSITION                        0x2
#define _I3C2ERRIR1_MWLOEIF_SIZE                            0x1
#define _I3C2ERRIR1_MWLOEIF_LENGTH                          0x1
#define _I3C2ERRIR1_MWLOEIF_MASK                            0x4
#define _I3C2ERRIR1_ABEIF_POSN                              0x3
#define _I3C2ERRIR1_ABEIF_POSITION                          0x3
#define _I3C2ERRIR1_ABEIF_SIZE                              0x1
#define _I3C2ERRIR1_ABEIF_LENGTH                            0x1
#define _I3C2ERRIR1_ABEIF_MASK                              0x8

