garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile I3C2MRSbits_t I3C2MRSbits __at(0x0E0);
// bitfield macros
#define _I3C2MRS_MRS0_POSN                                  0x0
#define _I3C2MRS_MRS0_POSITION                              0x0
#define _I3C2MRS_MRS0_SIZE                                  0x1
#define _I3C2MRS_MRS0_LENGTH                                0x1
#define _I3C2MRS_MRS0_MASK                                  0x1
#define _I3C2MRS_MRS1_POSN                                  0x1
#define _I3C2MRS_MRS1_POSITION                              0x1
#define _I3C2MRS_MRS1_SIZE                                  0x1
#define _I3C2MRS_MRS1_LENGTH                                0x1
#define _I3C2MRS_MRS1_MASK                                  0x2
#define _I3C2MRS_MRS2_POSN                                  0x2
#define _I3C2MRS_MRS2_POSITION                              0x2
#define _I3C2MRS_MRS2_SIZE                                  0x1
#define _I3C2MRS_MRS2_LENGTH                                0x1
#define _I3C2MRS_MRS2_MASK                                  0x4
#define _I3C2MRS_MRS3_POSN                                  0x3
#define _I3C2MRS_MRS3_POSITION                              0x3
#define _I3C2MRS_MRS3_SIZE                                  0x1
#define _I3C2MRS_MRS3_LENGTH                                0x1
#define _I3C2MRS_MRS3_MASK                                  0x8
#define _I3C2MRS_MRS4_POSN                                  0x4
#define _I3C2MRS_MRS4_POSITION                              0x4
#define _I3C2MRS_MRS4_SIZE                                  0x1
#define _I3C2MRS_MRS4_LENGTH                                0x1
#define _I3C2MRS_MRS4_MASK                                  0x10
#define _I3C2MRS_MRS5_POSN                                  0x5
#define _I3C2MRS_MRS5_POSITION                              0x5
#define _I3C2MRS_MRS5_SIZE                                  0x1
#define _I3C2MRS_MRS5_LENGTH                                0x1
#define _I3C2MRS_MRS5_MASK                                  0x20
#define _I3C2MRS_MRS6_POSN                                  0x6
#define _I3C2MRS_MRS6_POSITION                              0x6
#define _I3C2MRS_MRS6_SIZE                                  0x1
#define _I3C2MRS_MRS6_LENGTH                                0x1
#define _I3C2MRS_MRS6_MASK                                  0x40
#define _I3C2MRS_MRS7_POSN                                  0x7
#define _I3C2MRS_MRS7_POSITION                              0x7
#define _I3C2MRS_MRS7_SIZE                                  0x1
#define _I3C2MRS_MRS7_LENGTH                                0x1
#define _I3C2MRS_MRS7_MASK                                  0x80
#define _I3C2MRS_MRS_2_0_POSN                               0x0
#define _I3C2MRS_MRS_2_0_POSITION                           0x0
#define _I3C2MRS_MRS_2_0_SIZE                               0x3
#define _I3C2MRS_MRS_2_0_LENGTH                             0x3
#define _I3C2MRS_MRS_2_0_MASK                               0x7
#define _I3C2MRS_MRS_5_3_POSN                               0x3
#define _I3C2MRS_MRS_5_3_POSITION                           0x3
#define _I3C2MRS_MRS_5_3_SIZE                               0x3
#define _I3C2MRS_MRS_5_3_LENGTH                             0x3
#define _I3C2MRS_MRS_5_3_MASK                               0x38

// Register: I3C2MRT
#define I3C2MRT I3C2MRT
#ifndef __CCI__
extern volatile __uint24                I3C2MRT             __at(0x0E1);
#endif
#ifndef _LIB_BUILD
asm("I3C2MRT equ 0E1h");
#endif

// Register: I3C2MRTL
#define I3C2MRTL I3C2MRTL
extern volatile unsigned char           I3C2MRTL            __at(0x0E1);
#ifndef _LIB_BUILD
asm("I3C2MRTL equ 0E1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRTL                   :8;
    };
} I3C2MRTLbits_t;
extern volatile I3C2MRTLbits_t I3C2MRTLbits __at(0x0E1);
// bitfield macros
#define _I3C2MRTL_MRTL_POSN                                 0x0
#define _I3C2MRTL_MRTL_POSITION                             0x0
#define _I3C2MRTL_MRTL_SIZE                                 0x8
#define _I3C2MRTL_MRTL_LENGTH                               0x8
#define _I3C2MRTL_MRTL_MASK                                 0xFF

// Register: I3C2MRTH
#define I3C2MRTH I3C2MRTH
extern volatile unsigned char           I3C2MRTH            __at(0x0E2);
#ifndef _LIB_BUILD
asm("I3C2MRTH equ 0E2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRTH                   :8;
    };
} I3C2MRTHbits_t;
extern volatile I3C2MRTHbits_t I3C2MRTHbits __at(0x0E2);
// bitfield macros
#define _I3C2MRTH_MRTH_POSN                                 0x0
#define _I3C2MRTH_MRTH_POSITION                             0x0
#define _I3C2MRTH_MRTH_SIZE                                 0x8
#define _I3C2MRTH_MRTH_LENGTH                               0x8
#define _I3C2MRTH_MRTH_MASK                                 0xFF

// Register: I3C2MRTU
#define I3C2MRTU I3C2MRTU
extern volatile unsigned char           I3C2MRTU            __at(0x0E3);
#ifndef _LIB_BUILD
asm("I3C2MRTU equ 0E3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MRTU                   :8;
    };
} I3C2MRTUbits_t;
extern volatile I3C2MRTUbits_t I3C2MRTUbits __at(0x0E3);
// bitfield macros
#define _I3C2MRTU_MRTU_POSN                                 0x0
#define _I3C2MRTU_MRTU_POSITION                             0x0
#define _I3C2MRTU_MRTU_SIZE                                 0x8
#define _I3C2MRTU_MRTU_LENGTH                               0x8
#define _I3C2MRTU_MRTU_MASK                                 0xFF

// Register: I3C2RSTACT
#define I3C2RSTACT I3C2RSTACT
extern volatile unsigned char           I3C2RSTACT          __at(0x0E4);
#ifndef _LIB_BUILD
asm("I3C2RSTACT equ 0E4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSTACT                 :8;
    };
} I3C2RSTACTbits_t;
extern volatile I3C2RSTACTbits_t I3C2RSTACTbits __at(0x0E4);
// bitfield macros
#define _I3C2RSTACT_RSTACT_POSN                             0x0
#define _I3C2RSTACT_RSTACT_POSITION                         0x0
#define _I3C2RSTACT_RSTACT_SIZE                             0x8
#define _I3C2RSTACT_RSTACT_LENGTH                           0x8
#define _I3C2RSTACT_RSTACT_MASK                             0xFF

