garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile T4CLKCONbits_t T4CLKCONbits __at(0x123);
// bitfield macros
#define _T4CLKCON_CS_POSN                                   0x0
#define _T4CLKCON_CS_POSITION                               0x0
#define _T4CLKCON_CS_SIZE                                   0x8
#define _T4CLKCON_CS_LENGTH                                 0x8
#define _T4CLKCON_CS_MASK                                   0xFF
#define _T4CLKCON_CS0_POSN                                  0x0
#define _T4CLKCON_CS0_POSITION                              0x0
#define _T4CLKCON_CS0_SIZE                                  0x1
#define _T4CLKCON_CS0_LENGTH                                0x1
#define _T4CLKCON_CS0_MASK                                  0x1
#define _T4CLKCON_CS1_POSN                                  0x1
#define _T4CLKCON_CS1_POSITION                              0x1
#define _T4CLKCON_CS1_SIZE                                  0x1
#define _T4CLKCON_CS1_LENGTH                                0x1
#define _T4CLKCON_CS1_MASK                                  0x2
#define _T4CLKCON_CS2_POSN                                  0x2
#define _T4CLKCON_CS2_POSITION                              0x2
#define _T4CLKCON_CS2_SIZE                                  0x1
#define _T4CLKCON_CS2_LENGTH                                0x1
#define _T4CLKCON_CS2_MASK                                  0x4
#define _T4CLKCON_CS3_POSN                                  0x3
#define _T4CLKCON_CS3_POSITION                              0x3
#define _T4CLKCON_CS3_SIZE                                  0x1
#define _T4CLKCON_CS3_LENGTH                                0x1
#define _T4CLKCON_CS3_MASK                                  0x8
#define _T4CLKCON_T4CS_POSN                                 0x0
#define _T4CLKCON_T4CS_POSITION                             0x0
#define _T4CLKCON_T4CS_SIZE                                 0x8
#define _T4CLKCON_T4CS_LENGTH                               0x8
#define _T4CLKCON_T4CS_MASK                                 0xFF
#define _T4CLKCON_T4CS0_POSN                                0x0
#define _T4CLKCON_T4CS0_POSITION                            0x0
#define _T4CLKCON_T4CS0_SIZE                                0x1
#define _T4CLKCON_T4CS0_LENGTH                              0x1
#define _T4CLKCON_T4CS0_MASK                                0x1
#define _T4CLKCON_T4CS1_POSN                                0x1
#define _T4CLKCON_T4CS1_POSITION                            0x1
#define _T4CLKCON_T4CS1_SIZE                                0x1
#define _T4CLKCON_T4CS1_LENGTH                              0x1
#define _T4CLKCON_T4CS1_MASK                                0x2
#define _T4CLKCON_T4CS2_POSN                                0x2
#define _T4CLKCON_T4CS2_POSITION                            0x2
#define _T4CLKCON_T4CS2_SIZE                                0x1
#define _T4CLKCON_T4CS2_LENGTH                              0x1
#define _T4CLKCON_T4CS2_MASK                                0x4
#define _T4CLKCON_T4CS3_POSN                                0x3
#define _T4CLKCON_T4CS3_POSITION                            0x3
#define _T4CLKCON_T4CS3_SIZE                                0x1
#define _T4CLKCON_T4CS3_LENGTH                              0x1
#define _T4CLKCON_T4CS3_MASK                                0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
    struct {
        unsigned T4CS                   :8;
    };
    struct {
        unsigned T4CS0                  :1;
        unsigned T4CS1                  :1;
        unsigned T4CS2                  :1;
        unsigned T4CS3                  :1;
    };
} T4CLKbits_t;
extern volatile T4CLKbits_t T4CLKbits __at(0x123);
// bitfield macros
#define _T4CLK_CS_POSN                                      0x0
#define _T4CLK_CS_POSITION                                  0x0
#define _T4CLK_CS_SIZE                                      0x8
#define _T4CLK_CS_LENGTH                                    0x8
#define _T4CLK_CS_MASK                                      0xFF
#define _T4CLK_CS0_POSN                                     0x0
#define _T4CLK_CS0_POSITION                                 0x0
#define _T4CLK_CS0_SIZE                                     0x1
#define _T4CLK_CS0_LENGTH                                   0x1
#define _T4CLK_CS0_MASK                                     0x1
#define _T4CLK_CS1_POSN                                     0x1
#define _T4CLK_CS1_POSITION                                 0x1
#define _T4CLK_CS1_SIZE                                     0x1
#define _T4CLK_CS1_LENGTH                                   0x1
#define _T4CLK_CS1_MASK                                     0x2
#define _T4CLK_CS2_POSN                                     0x2
#define _T4CLK_CS2_POSITION                                 0x2
#define _T4CLK_CS2_SIZE                                     0x1
#define _T4CLK_CS2_LENGTH                                   0x1
#define _T4CLK_CS2_MASK                                     0x4
#define _T4CLK_CS3_POSN                                     0x3
#define _T4CLK_CS3_POSITION                                 0x3
#define _T4CLK_CS3_SIZE                                     0x1
#define _T4CLK_CS3_LENGTH                                   0x1
#define _T4CLK_CS3_MASK                                     0x8
#define _T4CLK_T4CS_POSN                                    0x0
#define _T4CLK_T4CS_POSITION                                0x0
#define _T4CLK_T4CS_SIZE                                    0x8
#define _T4CLK_T4CS_LENGTH                                  0x8
#define _T4CLK_T4CS_MASK                                    0xFF
#define _T4CLK_T4CS0_POSN                                   0x0
#define _T4CLK_T4CS0_POSITION                               0x0
#define _T4CLK_T4CS0_SIZE                                   0x1
#define _T4CLK_T4CS0_LENGTH                                 0x1
#define _T4CLK_T4CS0_MASK                                   0x1
#define _T4CLK_T4CS1_POSN                                   0x1
#define _T4CLK_T4CS1_POSITION                               0x1
#define _T4CLK_T4CS1_SIZE                                   0x1
#define _T4CLK_T4CS1_LENGTH                                 0x1
#define _T4CLK_T4CS1_MASK                                   0x2
#define _T4CLK_T4CS2_POSN                                   0x2
#define _T4CLK_T4CS2_POSITION                               0x2
#define _T4CLK_T4CS2_SIZE                                   0x1
#define _T4CLK_T4CS2_LENGTH                                 0x1
#define _T4CLK_T4CS2_MASK                                   0x4
#define _T4CLK_T4CS3_POSN                                   0x3
#define _T4CLK_T4CS3_POSITION                               0x3
#define _T4CLK_T4CS3_SIZE                                   0x1
#define _T4CLK_T4CS3_LENGTH                                 0x1
#define _T4CLK_T4CS3_MASK                                   0x8

// Register: T4RST
#define T4RST T4RST
extern volatile unsigned char           T4RST               __at(0x124);
#ifndef _LIB_BUILD
asm("T4RST equ 0124h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSEL                   :8;
    };
    struct {
        unsigned RSEL0                  :1;
        unsigned RSEL1                  :1;
        unsigned RSEL2                  :1;
        unsigned RSEL3                  :1;
        unsigned RSEL4                  :1;
    };
    struct {
        unsigned T4RSEL                 :8;
    };
    struct {
        unsigned T4RSEL0                :1;
        unsigned T4RSEL1                :1;
        unsigned T4RSEL2                :1;
        unsigned T4RSEL3                :1;
        unsigned T4RSEL4                :1;
    };
} T4RSTbits_t;
extern volatile T4RSTbits_t T4RSTbits __at(0x124);
// bitfield macros
#define _T4RST_RSEL_POSN                                    0x0
#define _T4RST_RSEL_POSITION                                0x0
#define _T4RST_RSEL_SIZE                                    0x8
#define _T4RST_RSEL_LENGTH                                  0x8
#define _T4RST_RSEL_MASK                                    0xFF
#define _T4RST_RSEL0_POSN                                   0x0
#define _T4RST_RSEL0_POSITION                               0x0
#define _T4RST_RSEL0_SIZE                                   0x1
#define _T4RST_RSEL0_LENGTH                                 0x1
#define _T4RST_RSEL0_MASK                                   0x1
#define _T4RST_RSEL1_POSN                                   0x1
#define _T4RST_RSEL1_POSITION                               0x1
#define _T4RST_RSEL1_SIZE                                   0x1
#define _T4RST_RSEL1_LENGTH                                 0x1
#define _T4RST_RSEL1_MASK                                   0x2
#define _T4RST_RSEL2_POSN                                   0x2
#define _T4RST_RSEL2_POSITION                               0x2
#define _T4RST_RSEL2_SIZE                                   0x1
#define _T4RST_RSEL2_LENGTH                                 0x1
#define _T4RST_RSEL2_MASK                                   0x4
#define _T4RST_RSEL3_POSN                                   0x3
#define _T4RST_RSEL3_POSITION                               0x3
#define _T4RST_RSEL3_SIZE                                   0x1
#define _T4RST_RSEL3_LENGTH                                 0x1
#define _T4RST_RSEL3_MASK                                   0x8
#define _T4RST_RSEL4_POSN                                   0x4
#define _T4RST_RSEL4_POSITION                               0x4
#define _T4RST_RSEL4_SIZE                                   0x1
#define _T4RST_RSEL4_LENGTH                                 0x1
#define _T4RST_RSEL4_MASK                                   0x10
#define _T4RST_T4RSEL_POSN                                  0x0
#define _T4RST_T4RSEL_POSITION                              0x0
#define _T4RST_T4RSEL_SIZE                                  0x8
#define _T4RST_T4RSEL_LENGTH                                0x8
#define _T4RST_T4RSEL_MASK                                  0xFF
#define _T4RST_T4RSEL0_POSN                                 0x0
#define _T4RST_T4RSEL0_POSITION                             0x0
#define _T4RST_T4RSEL0_SIZE                                 0x1
#define _T4RST_T4RSEL0_LENGTH                               0x1
#define _T4RST_T4RSEL0_MASK                                 0x1
#define _T4RST_T4RSEL1_POSN                                 0x1
#define _T4RST_T4RSEL1_POSITION                             0x1
#define _T4RST_T4RSEL1_SIZE                                 0x1
#define _T4RST_T4RSEL1_LENGTH                               0x1
#define _T4RST_T4RSEL1_MASK                                 0x2
#define _T4RST_T4RSEL2_POSN                                 0x2
#define _T4RST_T4RSEL2_POSITION                             0x2
#define _T4RST_T4RSEL2_SIZE                                 0x1
#define _T4RST_T4RSEL2_LENGTH                               0x1
#define _T4RST_T4RSEL2_MASK                                 0x4
#define _T4RST_T4RSEL3_POSN                                 0x3
#define _T4RST_T4RSEL3_POSITION                             0x3
#define _T4RST_T4RSEL3_SIZE                                 0x1
#define _T4RST_T4RSEL3_LENGTH                               0x1
#define _T4RST_T4RSEL3_MASK                                 0x8
#define _T4RST_T4RSEL4_POSN                                 0x4
#define _T4RST_T4RSEL4_POSITION                             0x4
#define _T4RST_T4RSEL4_SIZE                                 0x1
#define _T4RST_T4RSEL4_LENGTH                               0x1
#define _T4RST_T4RSEL4_MASK                                 0x10

// Register: TUCHAIN
#define TUCHAIN TUCHAIN
extern volatile unsigned char           TUCHAIN             __at(0x12B);
#ifndef _LIB_BUILD
asm("TUCHAIN equ 012Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH16AB                 :1;
    };
} TUCHAINbits_t;
extern volatile TUCHAINbits_t TUCHAINbits __at(0x12B);
// bitfield macros
#define _TUCHAIN_CH16AB_POSN                                0x0
#define _TUCHAIN_CH16AB_POSITION                            0x0
#define _TUCHAIN_CH16AB_SIZE                                0x1
#define _TUCHAIN_CH16AB_LENGTH                              0x1
#define _TUCHAIN_CH16AB_MASK                                0x1

// Register: TU16ACON0
#define TU16ACON0 TU16ACON0
extern volatile unsigned char           TU16ACON0           __at(0x12C);
#ifndef _LIB_BUILD
asm("TU16ACON0 equ 012Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CIE                    :1;
        unsigned ZIE                    :1;
        unsigned PRIE                   :1;
        unsigned RDSEL                  :1;
        unsigned OPOL                   :1;
        unsigned OM                     :1;
        unsigned CPOL                   :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned TU16ACIE               :1;
        unsigned TU16AZIE               :1;
        unsigned TU16APRIE              :1;
        unsigned TU16ARDSEL             :1;
        unsigned TU16AOPOL              :1;
        unsigned TU16AOM                :1;
        unsigned TU16ACPOL              :1;
        unsigned TU16AON                :1;
    };
} TU16ACON0bits_t;
extern volatile TU16ACON0bits_t TU16ACON0bits __at(0x12C);
// bitfield macros
#define _TU16ACON0_CIE_POSN                                 0x0
#define _TU16ACON0_CIE_POSITION                             0x0
#define _TU16ACON0_CIE_SIZE                                 0x1
#define _TU16ACON0_CIE_LENGTH                               0x1
#define _TU16ACON0_CIE_MASK                                 0x1
#define _TU16ACON0_ZIE_POSN                                 0x1
#define _TU16ACON0_ZIE_POSITION                             0x1
#define _TU16ACON0_ZIE_SIZE                                 0x1
#define _TU16ACON0_ZIE_LENGTH                               0x1
#define _TU16ACON0_ZIE_MASK                                 0x2
#define _TU16ACON0_PRIE_POSN                                0x2
#define _TU16ACON0_PRIE_POSITION                            0x2
#define _TU16ACON0_PRIE_SIZE                                0x1
#define _TU16ACON0_PRIE_LENGTH                              0x1
#define _TU16ACON0_PRIE_MASK                                0x4
#define _TU16ACON0_RDSEL_POSN                               0x3
#define _TU16ACON0_RDSEL_POSITION                           0x3
#define _TU16ACON0_RDSEL_SIZE                               0x1
#define _TU16ACON0_RDSEL_LENGTH                             0x1
#define _TU16ACON0_RDSEL_MASK                               0x8
#define _TU16ACON0_OPOL_POSN                                0x4
#define _TU16ACON0_OPOL_POSITION                            0x4
#define _TU16ACON0_OPOL_SIZE                                0x1
#define _TU16ACON0_OPOL_LENGTH                              0x1
#define _TU16ACON0_OPOL_MASK                                0x10
#define _TU16ACON0_OM_POSN                                  0x5
#define _TU16ACON0_OM_POSITION                              0x5
#define _TU16ACON0_OM_SIZE                                  0x1
#define _TU16ACON0_OM_LENGTH                                0x1
#define _TU16ACON0_OM_MASK                                  0x20
#define _TU16ACON0_CPOL_POSN                                0x6
#define _TU16ACON0_CPOL_POSITION                            0x6
#define _TU16ACON0_CPOL_SIZE                                0x1
#define _TU16ACON0_CPOL_LENGTH                              0x1
#define _TU16ACON0_CPOL_MASK                                0x40
#define _TU16ACON0_ON_POSN                                  0x7
#define _TU16ACON0_ON_POSITION                              0x7
#define _TU16ACON0_ON_SIZE                                  0x1
#define _TU16ACON0_ON_LENGTH                                0x1
#define _TU16ACON0_ON_MASK                                  0x80
#define _TU16ACON0_TU16ACIE_POSN                            0x0
#define _TU16ACON0_TU16ACIE_POSITION                        0x0
#define _TU16ACON0_TU16ACIE_SIZE                            0x1
#define _TU16ACON0_TU16ACIE_LENGTH                          0x1
#define _TU16ACON0_TU16ACIE_MASK                            0x1
#define _TU16ACON0_TU16AZIE_POSN                            0x1
#define _TU16ACON0_TU16AZIE_POSITION                        0x1
#define _TU16ACON0_TU16AZIE_SIZE                            0x1
#define _TU16ACON0_TU16AZIE_LENGTH                          0x1
#define _TU16ACON0_TU16AZIE_MASK                            0x2
#define _TU16ACON0_TU16APRIE_POSN                           0x2
#define _TU16ACON0_TU16APRIE_POSITION                       0x2
#define _TU16ACON0_TU16APRIE_SIZE                           0x1
#define _TU16ACON0_TU16APRIE_LENGTH                         0x1
#define _TU16ACON0_TU16APRIE_MASK                           0x4
#define _TU16ACON0_TU16ARDSEL_POSN                          0x3
#define _TU16ACON0_TU16ARDSEL_POSITION                      0x3
#define _TU16ACON0_TU16ARDSEL_SIZE                          0x1
#define _TU16ACON0_TU16ARDSEL_LENGTH                        0x1
#define _TU16ACON0_TU16ARDSEL_MASK                          0x8
#define _TU16ACON0_TU16AOPOL_POSN                           0x4
#define _TU16ACON0_TU16AOPOL_POSITION                       0x4
#define _TU16ACON0_TU16AOPOL_SIZE                           0x1
#define _TU16ACON0_TU16AOPOL_LENGTH                         0x1
#define _TU16ACON0_TU16AOPOL_MASK                           0x10
#define _TU16ACON0_TU16AOM_POSN                             0x5
#define _TU16ACON0_TU16AOM_POSITION                         0x5
#define _TU16ACON0_TU16AOM_SIZE                             0x1
#define _TU16ACON0_TU16AOM_LENGTH                           0x1
#define _TU16ACON0_TU16AOM_MASK                             0x20
#define _TU16ACON0_TU16ACPOL_POSN                           0x6
#define _TU16ACON0_TU16ACPOL_POSITION                       0x6
#define _TU16ACON0_TU16ACPOL_SIZE                           0x1
#define _TU16ACON0_TU16ACPOL_LENGTH                         0x1
#define _TU16ACON0_TU16ACPOL_MASK                           0x40
#define _TU16ACON0_TU16AON_POSN                             0x7
#define _TU16ACON0_TU16AON_POSITION                         0x7
#define _TU16ACON0_TU16AON_SIZE                             0x1
#define _TU16ACON0_TU16AON_LENGTH                           0x1
#define _TU16ACON0_TU16AON_MASK                             0x80

// Register: TU16ACON1
#define TU16ACON1 TU16ACON1
extern volatile unsigned char           TU16ACON1           __at(0x12D);
#ifndef _LIB_BUILD
asm("TU16ACON1 equ 012Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CIF                    :1;
        unsigned ZIF                    :1;
        unsigned PRIF                   :1;
        unsigned CAPT                   :1;
        unsigned LIMIT                  :1;
        unsigned CLR                    :1;
        unsigned OSEN                   :1;
        unsigned RUN                    :1;
    };
    struct {
        unsigned TU16ACIF               :1;
        unsigned TU16AZIF               :1;
        unsigned TU16APRIF              :1;
        unsigned TU16ACAPT              :1;
        unsigned TU16ALIMIT             :1;
        unsigned TU16ACLR               :1;
        unsigned TMRAOSEN               :1;
        unsigned TU16ARUN               :1;
    };
} TU16ACON1bits_t;
