garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile TU16ACON1bits_t TU16ACON1bits __at(0x12D);
// bitfield macros
#define _TU16ACON1_CIF_POSN                                 0x0
#define _TU16ACON1_CIF_POSITION                             0x0
#define _TU16ACON1_CIF_SIZE                                 0x1
#define _TU16ACON1_CIF_LENGTH                               0x1
#define _TU16ACON1_CIF_MASK                                 0x1
#define _TU16ACON1_ZIF_POSN                                 0x1
#define _TU16ACON1_ZIF_POSITION                             0x1
#define _TU16ACON1_ZIF_SIZE                                 0x1
#define _TU16ACON1_ZIF_LENGTH                               0x1
#define _TU16ACON1_ZIF_MASK                                 0x2
#define _TU16ACON1_PRIF_POSN                                0x2
#define _TU16ACON1_PRIF_POSITION                            0x2
#define _TU16ACON1_PRIF_SIZE                                0x1
#define _TU16ACON1_PRIF_LENGTH                              0x1
#define _TU16ACON1_PRIF_MASK                                0x4
#define _TU16ACON1_CAPT_POSN                                0x3
#define _TU16ACON1_CAPT_POSITION                            0x3
#define _TU16ACON1_CAPT_SIZE                                0x1
#define _TU16ACON1_CAPT_LENGTH                              0x1
#define _TU16ACON1_CAPT_MASK                                0x8
#define _TU16ACON1_LIMIT_POSN                               0x4
#define _TU16ACON1_LIMIT_POSITION                           0x4
#define _TU16ACON1_LIMIT_SIZE                               0x1
#define _TU16ACON1_LIMIT_LENGTH                             0x1
#define _TU16ACON1_LIMIT_MASK                               0x10
#define _TU16ACON1_CLR_POSN                                 0x5
#define _TU16ACON1_CLR_POSITION                             0x5
#define _TU16ACON1_CLR_SIZE                                 0x1
#define _TU16ACON1_CLR_LENGTH                               0x1
#define _TU16ACON1_CLR_MASK                                 0x20
#define _TU16ACON1_OSEN_POSN                                0x6
#define _TU16ACON1_OSEN_POSITION                            0x6
#define _TU16ACON1_OSEN_SIZE                                0x1
#define _TU16ACON1_OSEN_LENGTH                              0x1
#define _TU16ACON1_OSEN_MASK                                0x40
#define _TU16ACON1_RUN_POSN                                 0x7
#define _TU16ACON1_RUN_POSITION                             0x7
#define _TU16ACON1_RUN_SIZE                                 0x1
#define _TU16ACON1_RUN_LENGTH                               0x1
#define _TU16ACON1_RUN_MASK                                 0x80
#define _TU16ACON1_TU16ACIF_POSN                            0x0
#define _TU16ACON1_TU16ACIF_POSITION                        0x0
#define _TU16ACON1_TU16ACIF_SIZE                            0x1
#define _TU16ACON1_TU16ACIF_LENGTH                          0x1
#define _TU16ACON1_TU16ACIF_MASK                            0x1
#define _TU16ACON1_TU16AZIF_POSN                            0x1
#define _TU16ACON1_TU16AZIF_POSITION                        0x1
#define _TU16ACON1_TU16AZIF_SIZE                            0x1
#define _TU16ACON1_TU16AZIF_LENGTH                          0x1
#define _TU16ACON1_TU16AZIF_MASK                            0x2
#define _TU16ACON1_TU16APRIF_POSN                           0x2
#define _TU16ACON1_TU16APRIF_POSITION                       0x2
#define _TU16ACON1_TU16APRIF_SIZE                           0x1
#define _TU16ACON1_TU16APRIF_LENGTH                         0x1
#define _TU16ACON1_TU16APRIF_MASK                           0x4
#define _TU16ACON1_TU16ACAPT_POSN                           0x3
#define _TU16ACON1_TU16ACAPT_POSITION                       0x3
#define _TU16ACON1_TU16ACAPT_SIZE                           0x1
#define _TU16ACON1_TU16ACAPT_LENGTH                         0x1
#define _TU16ACON1_TU16ACAPT_MASK                           0x8
#define _TU16ACON1_TU16ALIMIT_POSN                          0x4
#define _TU16ACON1_TU16ALIMIT_POSITION                      0x4
#define _TU16ACON1_TU16ALIMIT_SIZE                          0x1
#define _TU16ACON1_TU16ALIMIT_LENGTH                        0x1
#define _TU16ACON1_TU16ALIMIT_MASK                          0x10
#define _TU16ACON1_TU16ACLR_POSN                            0x5
#define _TU16ACON1_TU16ACLR_POSITION                        0x5
#define _TU16ACON1_TU16ACLR_SIZE                            0x1
#define _TU16ACON1_TU16ACLR_LENGTH                          0x1
#define _TU16ACON1_TU16ACLR_MASK                            0x20
#define _TU16ACON1_TMRAOSEN_POSN                            0x6
#define _TU16ACON1_TMRAOSEN_POSITION                        0x6
#define _TU16ACON1_TMRAOSEN_SIZE                            0x1
#define _TU16ACON1_TMRAOSEN_LENGTH                          0x1
#define _TU16ACON1_TMRAOSEN_MASK                            0x40
#define _TU16ACON1_TU16ARUN_POSN                            0x7
#define _TU16ACON1_TU16ARUN_POSITION                        0x7
#define _TU16ACON1_TU16ARUN_SIZE                            0x1
#define _TU16ACON1_TU16ARUN_LENGTH                          0x1
#define _TU16ACON1_TU16ARUN_MASK                            0x80

// Register: TU16AHLT
#define TU16AHLT TU16AHLT
extern volatile unsigned char           TU16AHLT            __at(0x12E);
#ifndef _LIB_BUILD
asm("TU16AHLT equ 012Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STOP                   :2;
        unsigned RESET                  :2;
        unsigned START                  :2;
        unsigned CSYNC                  :1;
        unsigned EPOL                   :1;
    };
    struct {
        unsigned STOP0                  :1;
        unsigned STOP1                  :1;
        unsigned RESET0                 :1;
        unsigned RESET1                 :1;
        unsigned START0                 :1;
        unsigned START1                 :1;
    };
    struct {
        unsigned TU16ASTOP              :2;
        unsigned TU16ARESET             :2;
        unsigned TU16ASTART             :2;
        unsigned TU16ACSYNC             :1;
        unsigned TU16AEPOL              :1;
    };
    struct {
        unsigned TU16ASTOP0             :1;
        unsigned TU16ASTOP1             :1;
        unsigned TU16ARESET0            :1;
        unsigned TU16ARESET1            :1;
        unsigned TU16ASTART0            :1;
        unsigned TU16ASTART1            :1;
    };
} TU16AHLTbits_t;
extern volatile TU16AHLTbits_t TU16AHLTbits __at(0x12E);
// bitfield macros
#define _TU16AHLT_STOP_POSN                                 0x0
#define _TU16AHLT_STOP_POSITION                             0x0
#define _TU16AHLT_STOP_SIZE                                 0x2
#define _TU16AHLT_STOP_LENGTH                               0x2
#define _TU16AHLT_STOP_MASK                                 0x3
#define _TU16AHLT_RESET_POSN                                0x2
#define _TU16AHLT_RESET_POSITION                            0x2
#define _TU16AHLT_RESET_SIZE                                0x2
#define _TU16AHLT_RESET_LENGTH                              0x2
#define _TU16AHLT_RESET_MASK                                0xC
#define _TU16AHLT_START_POSN                                0x4
#define _TU16AHLT_START_POSITION                            0x4
#define _TU16AHLT_START_SIZE                                0x2
#define _TU16AHLT_START_LENGTH                              0x2
#define _TU16AHLT_START_MASK                                0x30
#define _TU16AHLT_CSYNC_POSN                                0x6
#define _TU16AHLT_CSYNC_POSITION                            0x6
#define _TU16AHLT_CSYNC_SIZE                                0x1
#define _TU16AHLT_CSYNC_LENGTH                              0x1
#define _TU16AHLT_CSYNC_MASK                                0x40
#define _TU16AHLT_EPOL_POSN                                 0x7
#define _TU16AHLT_EPOL_POSITION                             0x7
#define _TU16AHLT_EPOL_SIZE                                 0x1
#define _TU16AHLT_EPOL_LENGTH                               0x1
#define _TU16AHLT_EPOL_MASK                                 0x80
#define _TU16AHLT_STOP0_POSN                                0x0
#define _TU16AHLT_STOP0_POSITION                            0x0
#define _TU16AHLT_STOP0_SIZE                                0x1
#define _TU16AHLT_STOP0_LENGTH                              0x1
#define _TU16AHLT_STOP0_MASK                                0x1
#define _TU16AHLT_STOP1_POSN                                0x1
#define _TU16AHLT_STOP1_POSITION                            0x1
#define _TU16AHLT_STOP1_SIZE                                0x1
#define _TU16AHLT_STOP1_LENGTH                              0x1
#define _TU16AHLT_STOP1_MASK                                0x2
#define _TU16AHLT_RESET0_POSN                               0x2
#define _TU16AHLT_RESET0_POSITION                           0x2
#define _TU16AHLT_RESET0_SIZE                               0x1
#define _TU16AHLT_RESET0_LENGTH                             0x1
#define _TU16AHLT_RESET0_MASK                               0x4
#define _TU16AHLT_RESET1_POSN                               0x3
#define _TU16AHLT_RESET1_POSITION                           0x3
#define _TU16AHLT_RESET1_SIZE                               0x1
#define _TU16AHLT_RESET1_LENGTH                             0x1
#define _TU16AHLT_RESET1_MASK                               0x8
#define _TU16AHLT_START0_POSN                               0x4
#define _TU16AHLT_START0_POSITION                           0x4
#define _TU16AHLT_START0_SIZE                               0x1
#define _TU16AHLT_START0_LENGTH                             0x1
#define _TU16AHLT_START0_MASK                               0x10
#define _TU16AHLT_START1_POSN                               0x5
#define _TU16AHLT_START1_POSITION                           0x5
#define _TU16AHLT_START1_SIZE                               0x1
#define _TU16AHLT_START1_LENGTH                             0x1
#define _TU16AHLT_START1_MASK                               0x20
#define _TU16AHLT_TU16ASTOP_POSN                            0x0
#define _TU16AHLT_TU16ASTOP_POSITION                        0x0
#define _TU16AHLT_TU16ASTOP_SIZE                            0x2
#define _TU16AHLT_TU16ASTOP_LENGTH                          0x2
#define _TU16AHLT_TU16ASTOP_MASK                            0x3
#define _TU16AHLT_TU16ARESET_POSN                           0x2
#define _TU16AHLT_TU16ARESET_POSITION                       0x2
#define _TU16AHLT_TU16ARESET_SIZE                           0x2
#define _TU16AHLT_TU16ARESET_LENGTH                         0x2
#define _TU16AHLT_TU16ARESET_MASK                           0xC
#define _TU16AHLT_TU16ASTART_POSN                           0x4
#define _TU16AHLT_TU16ASTART_POSITION                       0x4
#define _TU16AHLT_TU16ASTART_SIZE                           0x2
#define _TU16AHLT_TU16ASTART_LENGTH                         0x2
#define _TU16AHLT_TU16ASTART_MASK                           0x30
#define _TU16AHLT_TU16ACSYNC_POSN                           0x6
#define _TU16AHLT_TU16ACSYNC_POSITION                       0x6
#define _TU16AHLT_TU16ACSYNC_SIZE                           0x1
#define _TU16AHLT_TU16ACSYNC_LENGTH                         0x1
#define _TU16AHLT_TU16ACSYNC_MASK                           0x40
#define _TU16AHLT_TU16AEPOL_POSN                            0x7
#define _TU16AHLT_TU16AEPOL_POSITION                        0x7
#define _TU16AHLT_TU16AEPOL_SIZE                            0x1
#define _TU16AHLT_TU16AEPOL_LENGTH                          0x1
#define _TU16AHLT_TU16AEPOL_MASK                            0x80
#define _TU16AHLT_TU16ASTOP0_POSN                           0x0
#define _TU16AHLT_TU16ASTOP0_POSITION                       0x0
#define _TU16AHLT_TU16ASTOP0_SIZE                           0x1
#define _TU16AHLT_TU16ASTOP0_LENGTH                         0x1
#define _TU16AHLT_TU16ASTOP0_MASK                           0x1
#define _TU16AHLT_TU16ASTOP1_POSN                           0x1
#define _TU16AHLT_TU16ASTOP1_POSITION                       0x1
#define _TU16AHLT_TU16ASTOP1_SIZE                           0x1
#define _TU16AHLT_TU16ASTOP1_LENGTH                         0x1
#define _TU16AHLT_TU16ASTOP1_MASK                           0x2
#define _TU16AHLT_TU16ARESET0_POSN                          0x2
#define _TU16AHLT_TU16ARESET0_POSITION                      0x2
#define _TU16AHLT_TU16ARESET0_SIZE                          0x1
#define _TU16AHLT_TU16ARESET0_LENGTH                        0x1
#define _TU16AHLT_TU16ARESET0_MASK                          0x4
#define _TU16AHLT_TU16ARESET1_POSN                          0x3
#define _TU16AHLT_TU16ARESET1_POSITION                      0x3
#define _TU16AHLT_TU16ARESET1_SIZE                          0x1
#define _TU16AHLT_TU16ARESET1_LENGTH                        0x1
#define _TU16AHLT_TU16ARESET1_MASK                          0x8
#define _TU16AHLT_TU16ASTART0_POSN                          0x4
#define _TU16AHLT_TU16ASTART0_POSITION                      0x4
#define _TU16AHLT_TU16ASTART0_SIZE                          0x1
#define _TU16AHLT_TU16ASTART0_LENGTH                        0x1
#define _TU16AHLT_TU16ASTART0_MASK                          0x10
#define _TU16AHLT_TU16ASTART1_POSN                          0x5
#define _TU16AHLT_TU16ASTART1_POSITION                      0x5
#define _TU16AHLT_TU16ASTART1_SIZE                          0x1
#define _TU16AHLT_TU16ASTART1_LENGTH                        0x1
#define _TU16AHLT_TU16ASTART1_MASK                          0x20

