garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile TU16APRLbits_t TU16APRLbits __at(0x134);
// bitfield macros
#define _TU16APRL_PRL_POSN                                  0x0
#define _TU16APRL_PRL_POSITION                              0x0
#define _TU16APRL_PRL_SIZE                                  0x8
#define _TU16APRL_PRL_LENGTH                                0x8
#define _TU16APRL_PRL_MASK                                  0xFF
#define _TU16APRL_PRL0_POSN                                 0x0
#define _TU16APRL_PRL0_POSITION                             0x0
#define _TU16APRL_PRL0_SIZE                                 0x1
#define _TU16APRL_PRL0_LENGTH                               0x1
#define _TU16APRL_PRL0_MASK                                 0x1
#define _TU16APRL_PRL1_POSN                                 0x1
#define _TU16APRL_PRL1_POSITION                             0x1
#define _TU16APRL_PRL1_SIZE                                 0x1
#define _TU16APRL_PRL1_LENGTH                               0x1
#define _TU16APRL_PRL1_MASK                                 0x2
#define _TU16APRL_PRL2_POSN                                 0x2
#define _TU16APRL_PRL2_POSITION                             0x2
#define _TU16APRL_PRL2_SIZE                                 0x1
#define _TU16APRL_PRL2_LENGTH                               0x1
#define _TU16APRL_PRL2_MASK                                 0x4
#define _TU16APRL_PRL3_POSN                                 0x3
#define _TU16APRL_PRL3_POSITION                             0x3
#define _TU16APRL_PRL3_SIZE                                 0x1
#define _TU16APRL_PRL3_LENGTH                               0x1
#define _TU16APRL_PRL3_MASK                                 0x8
#define _TU16APRL_PRL4_POSN                                 0x4
#define _TU16APRL_PRL4_POSITION                             0x4
#define _TU16APRL_PRL4_SIZE                                 0x1
#define _TU16APRL_PRL4_LENGTH                               0x1
#define _TU16APRL_PRL4_MASK                                 0x10
#define _TU16APRL_PRL5_POSN                                 0x5
#define _TU16APRL_PRL5_POSITION                             0x5
#define _TU16APRL_PRL5_SIZE                                 0x1
#define _TU16APRL_PRL5_LENGTH                               0x1
#define _TU16APRL_PRL5_MASK                                 0x20
#define _TU16APRL_PRL6_POSN                                 0x6
#define _TU16APRL_PRL6_POSITION                             0x6
#define _TU16APRL_PRL6_SIZE                                 0x1
#define _TU16APRL_PRL6_LENGTH                               0x1
#define _TU16APRL_PRL6_MASK                                 0x40
#define _TU16APRL_PRL7_POSN                                 0x7
#define _TU16APRL_PRL7_POSITION                             0x7
#define _TU16APRL_PRL7_SIZE                                 0x1
#define _TU16APRL_PRL7_LENGTH                               0x1
#define _TU16APRL_PRL7_MASK                                 0x80
#define _TU16APRL_TU16APRL0_POSN                            0x0
#define _TU16APRL_TU16APRL0_POSITION                        0x0
#define _TU16APRL_TU16APRL0_SIZE                            0x1
#define _TU16APRL_TU16APRL0_LENGTH                          0x1
#define _TU16APRL_TU16APRL0_MASK                            0x1
#define _TU16APRL_TU16APRL1_POSN                            0x1
#define _TU16APRL_TU16APRL1_POSITION                        0x1
#define _TU16APRL_TU16APRL1_SIZE                            0x1
#define _TU16APRL_TU16APRL1_LENGTH                          0x1
#define _TU16APRL_TU16APRL1_MASK                            0x2
#define _TU16APRL_TU16APRL2_POSN                            0x2
#define _TU16APRL_TU16APRL2_POSITION                        0x2
#define _TU16APRL_TU16APRL2_SIZE                            0x1
#define _TU16APRL_TU16APRL2_LENGTH                          0x1
#define _TU16APRL_TU16APRL2_MASK                            0x4
#define _TU16APRL_TU16APRL3_POSN                            0x3
#define _TU16APRL_TU16APRL3_POSITION                        0x3
#define _TU16APRL_TU16APRL3_SIZE                            0x1
#define _TU16APRL_TU16APRL3_LENGTH                          0x1
#define _TU16APRL_TU16APRL3_MASK                            0x8
#define _TU16APRL_TU16APRL4_POSN                            0x4
#define _TU16APRL_TU16APRL4_POSITION                        0x4
#define _TU16APRL_TU16APRL4_SIZE                            0x1
#define _TU16APRL_TU16APRL4_LENGTH                          0x1
#define _TU16APRL_TU16APRL4_MASK                            0x10
#define _TU16APRL_TU16APRL5_POSN                            0x5
#define _TU16APRL_TU16APRL5_POSITION                        0x5
#define _TU16APRL_TU16APRL5_SIZE                            0x1
#define _TU16APRL_TU16APRL5_LENGTH                          0x1
#define _TU16APRL_TU16APRL5_MASK                            0x20
#define _TU16APRL_TU16APRL6_POSN                            0x6
#define _TU16APRL_TU16APRL6_POSITION                        0x6
#define _TU16APRL_TU16APRL6_SIZE                            0x1
#define _TU16APRL_TU16APRL6_LENGTH                          0x1
#define _TU16APRL_TU16APRL6_MASK                            0x40
#define _TU16APRL_TU16APRL7_POSN                            0x7
#define _TU16APRL_TU16APRL7_POSITION                        0x7
#define _TU16APRL_TU16APRL7_SIZE                            0x1
#define _TU16APRL_TU16APRL7_LENGTH                          0x1
#define _TU16APRL_TU16APRL7_MASK                            0x80
#define _TU16APRL_TU16APR0_POSN                             0x0
#define _TU16APRL_TU16APR0_POSITION                         0x0
#define _TU16APRL_TU16APR0_SIZE                             0x1
#define _TU16APRL_TU16APR0_LENGTH                           0x1
#define _TU16APRL_TU16APR0_MASK                             0x1
#define _TU16APRL_TU16APR1_POSN                             0x1
#define _TU16APRL_TU16APR1_POSITION                         0x1
#define _TU16APRL_TU16APR1_SIZE                             0x1
#define _TU16APRL_TU16APR1_LENGTH                           0x1
#define _TU16APRL_TU16APR1_MASK                             0x2
#define _TU16APRL_TU16APR2_POSN                             0x2
#define _TU16APRL_TU16APR2_POSITION                         0x2
#define _TU16APRL_TU16APR2_SIZE                             0x1
#define _TU16APRL_TU16APR2_LENGTH                           0x1
#define _TU16APRL_TU16APR2_MASK                             0x4
#define _TU16APRL_TU16APR3_POSN                             0x3
#define _TU16APRL_TU16APR3_POSITION                         0x3
#define _TU16APRL_TU16APR3_SIZE                             0x1
#define _TU16APRL_TU16APR3_LENGTH                           0x1
#define _TU16APRL_TU16APR3_MASK                             0x8
#define _TU16APRL_TU16APR4_POSN                             0x4
#define _TU16APRL_TU16APR4_POSITION                         0x4
#define _TU16APRL_TU16APR4_SIZE                             0x1
#define _TU16APRL_TU16APR4_LENGTH                           0x1
#define _TU16APRL_TU16APR4_MASK                             0x10
#define _TU16APRL_TU16APR5_POSN                             0x5
#define _TU16APRL_TU16APR5_POSITION                         0x5
#define _TU16APRL_TU16APR5_SIZE                             0x1
#define _TU16APRL_TU16APR5_LENGTH                           0x1
#define _TU16APRL_TU16APR5_MASK                             0x20
#define _TU16APRL_TU16APR6_POSN                             0x6
#define _TU16APRL_TU16APR6_POSITION                         0x6
#define _TU16APRL_TU16APR6_SIZE                             0x1
#define _TU16APRL_TU16APR6_LENGTH                           0x1
#define _TU16APRL_TU16APR6_MASK                             0x40
#define _TU16APRL_TU16APR7_POSN                             0x7
#define _TU16APRL_TU16APR7_POSITION                         0x7
#define _TU16APRL_TU16APR7_SIZE                             0x1
#define _TU16APRL_TU16APR7_LENGTH                           0x1
#define _TU16APRL_TU16APR7_MASK                             0x80

// Register: TU16APRH
#define TU16APRH TU16APRH
extern volatile unsigned char           TU16APRH            __at(0x135);
#ifndef _LIB_BUILD
asm("TU16APRH equ 0135h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
    struct {
        unsigned PRH0                   :1;
        unsigned PRH1                   :1;
        unsigned PRH2                   :1;
        unsigned PRH3                   :1;
        unsigned PRH4                   :1;
        unsigned PRH5                   :1;
        unsigned PRH6                   :1;
        unsigned PRH7                   :1;
    };
    struct {
        unsigned TU16APRH0              :1;
        unsigned TU16APRH1              :1;
        unsigned TU16APRH2              :1;
        unsigned TU16APRH3              :1;
        unsigned TU16APRH4              :1;
        unsigned TU16APRH5              :1;
        unsigned TU16APRH6              :1;
        unsigned TU16APRH7              :1;
    };
    struct {
        unsigned TU16APR8               :1;
        unsigned TU16APR9               :1;
        unsigned TU16APR10              :1;
        unsigned TU16APR11              :1;
        unsigned TU16APR12              :1;
        unsigned TU16APR13              :1;
        unsigned TU16APR14              :1;
        unsigned TU16APR15              :1;
    };
} TU16APRHbits_t;
extern volatile TU16APRHbits_t TU16APRHbits __at(0x135);
// bitfield macros
#define _TU16APRH_PRH_POSN                                  0x0
#define _TU16APRH_PRH_POSITION                              0x0
#define _TU16APRH_PRH_SIZE                                  0x8
#define _TU16APRH_PRH_LENGTH                                0x8
#define _TU16APRH_PRH_MASK                                  0xFF
#define _TU16APRH_PRH0_POSN                                 0x0
#define _TU16APRH_PRH0_POSITION                             0x0
#define _TU16APRH_PRH0_SIZE                                 0x1
#define _TU16APRH_PRH0_LENGTH                               0x1
#define _TU16APRH_PRH0_MASK                                 0x1
#define _TU16APRH_PRH1_POSN                                 0x1
#define _TU16APRH_PRH1_POSITION                             0x1
#define _TU16APRH_PRH1_SIZE                                 0x1
#define _TU16APRH_PRH1_LENGTH                               0x1
#define _TU16APRH_PRH1_MASK                                 0x2
#define _TU16APRH_PRH2_POSN                                 0x2
#define _TU16APRH_PRH2_POSITION                             0x2
#define _TU16APRH_PRH2_SIZE                                 0x1
#define _TU16APRH_PRH2_LENGTH                               0x1
#define _TU16APRH_PRH2_MASK                                 0x4
#define _TU16APRH_PRH3_POSN                                 0x3
#define _TU16APRH_PRH3_POSITION                             0x3
#define _TU16APRH_PRH3_SIZE                                 0x1
#define _TU16APRH_PRH3_LENGTH                               0x1
#define _TU16APRH_PRH3_MASK                                 0x8
#define _TU16APRH_PRH4_POSN                                 0x4
#define _TU16APRH_PRH4_POSITION                             0x4
#define _TU16APRH_PRH4_SIZE                                 0x1
#define _TU16APRH_PRH4_LENGTH                               0x1
#define _TU16APRH_PRH4_MASK                                 0x10
#define _TU16APRH_PRH5_POSN                                 0x5
#define _TU16APRH_PRH5_POSITION                             0x5
#define _TU16APRH_PRH5_SIZE                                 0x1
#define _TU16APRH_PRH5_LENGTH                               0x1
#define _TU16APRH_PRH5_MASK                                 0x20
#define _TU16APRH_PRH6_POSN                                 0x6
#define _TU16APRH_PRH6_POSITION                             0x6
#define _TU16APRH_PRH6_SIZE                                 0x1
#define _TU16APRH_PRH6_LENGTH                               0x1
#define _TU16APRH_PRH6_MASK                                 0x40
#define _TU16APRH_PRH7_POSN                                 0x7
#define _TU16APRH_PRH7_POSITION                             0x7
#define _TU16APRH_PRH7_SIZE                                 0x1
#define _TU16APRH_PRH7_LENGTH                               0x1
#define _TU16APRH_PRH7_MASK                                 0x80
#define _TU16APRH_TU16APRH0_POSN                            0x0
#define _TU16APRH_TU16APRH0_POSITION                        0x0
#define _TU16APRH_TU16APRH0_SIZE                            0x1
#define _TU16APRH_TU16APRH0_LENGTH                          0x1
#define _TU16APRH_TU16APRH0_MASK                            0x1
#define _TU16APRH_TU16APRH1_POSN                            0x1
#define _TU16APRH_TU16APRH1_POSITION                        0x1
#define _TU16APRH_TU16APRH1_SIZE                            0x1
#define _TU16APRH_TU16APRH1_LENGTH                          0x1
#define _TU16APRH_TU16APRH1_MASK                            0x2
#define _TU16APRH_TU16APRH2_POSN                            0x2
#define _TU16APRH_TU16APRH2_POSITION                        0x2
#define _TU16APRH_TU16APRH2_SIZE                            0x1
#define _TU16APRH_TU16APRH2_LENGTH                          0x1
#define _TU16APRH_TU16APRH2_MASK                            0x4
#define _TU16APRH_TU16APRH3_POSN                            0x3
#define _TU16APRH_TU16APRH3_POSITION                        0x3
#define _TU16APRH_TU16APRH3_SIZE                            0x1
#define _TU16APRH_TU16APRH3_LENGTH                          0x1
#define _TU16APRH_TU16APRH3_MASK                            0x8
#define _TU16APRH_TU16APRH4_POSN                            0x4
#define _TU16APRH_TU16APRH4_POSITION                        0x4
#define _TU16APRH_TU16APRH4_SIZE                            0x1
#define _TU16APRH_TU16APRH4_LENGTH                          0x1
#define _TU16APRH_TU16APRH4_MASK                            0x10
#define _TU16APRH_TU16APRH5_POSN                            0x5
#define _TU16APRH_TU16APRH5_POSITION                        0x5
#define _TU16APRH_TU16APRH5_SIZE                            0x1
#define _TU16APRH_TU16APRH5_LENGTH                          0x1
#define _TU16APRH_TU16APRH5_MASK                            0x20
#define _TU16APRH_TU16APRH6_POSN                            0x6
#define _TU16APRH_TU16APRH6_POSITION                        0x6
#define _TU16APRH_TU16APRH6_SIZE                            0x1
#define _TU16APRH_TU16APRH6_LENGTH                          0x1
#define _TU16APRH_TU16APRH6_MASK                            0x40
#define _TU16APRH_TU16APRH7_POSN                            0x7
#define _TU16APRH_TU16APRH7_POSITION                        0x7
#define _TU16APRH_TU16APRH7_SIZE                            0x1
#define _TU16APRH_TU16APRH7_LENGTH                          0x1
#define _TU16APRH_TU16APRH7_MASK                            0x80
#define _TU16APRH_TU16APR8_POSN                             0x0
#define _TU16APRH_TU16APR8_POSITION                         0x0
#define _TU16APRH_TU16APR8_SIZE                             0x1
#define _TU16APRH_TU16APR8_LENGTH                           0x1
#define _TU16APRH_TU16APR8_MASK                             0x1
#define _TU16APRH_TU16APR9_POSN                             0x1
#define _TU16APRH_TU16APR9_POSITION                         0x1
#define _TU16APRH_TU16APR9_SIZE                             0x1
#define _TU16APRH_TU16APR9_LENGTH                           0x1
#define _TU16APRH_TU16APR9_MASK                             0x2
#define _TU16APRH_TU16APR10_POSN                            0x2
#define _TU16APRH_TU16APR10_POSITION                        0x2
#define _TU16APRH_TU16APR10_SIZE                            0x1
#define _TU16APRH_TU16APR10_LENGTH                          0x1
#define _TU16APRH_TU16APR10_MASK                            0x4
#define _TU16APRH_TU16APR11_POSN                            0x3
#define _TU16APRH_TU16APR11_POSITION                        0x3
#define _TU16APRH_TU16APR11_SIZE                            0x1
#define _TU16APRH_TU16APR11_LENGTH                          0x1
#define _TU16APRH_TU16APR11_MASK                            0x8
#define _TU16APRH_TU16APR12_POSN                            0x4
#define _TU16APRH_TU16APR12_POSITION                        0x4
#define _TU16APRH_TU16APR12_SIZE                            0x1
#define _TU16APRH_TU16APR12_LENGTH                          0x1
#define _TU16APRH_TU16APR12_MASK                            0x10
#define _TU16APRH_TU16APR13_POSN                            0x5
#define _TU16APRH_TU16APR13_POSITION                        0x5
#define _TU16APRH_TU16APR13_SIZE                            0x1
#define _TU16APRH_TU16APR13_LENGTH                          0x1
#define _TU16APRH_TU16APR13_MASK                            0x20
#define _TU16APRH_TU16APR14_POSN                            0x6
#define _TU16APRH_TU16APR14_POSITION                        0x6
#define _TU16APRH_TU16APR14_SIZE                            0x1
#define _TU16APRH_TU16APR14_LENGTH                          0x1
#define _TU16APRH_TU16APR14_MASK                            0x40
#define _TU16APRH_TU16APR15_POSN                            0x7
#define _TU16APRH_TU16APR15_POSITION                        0x7
#define _TU16APRH_TU16APR15_SIZE                            0x1
#define _TU16APRH_TU16APR15_LENGTH                          0x1
#define _TU16APRH_TU16APR15_MASK                            0x80

// Register: TU16APRT
#define TU16APRT TU16APRT
extern volatile unsigned char           TU16APRT            __at(0x137);
#ifndef _LIB_BUILD
asm("TU16APRT equ 0137h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRT                    :8;
    };
    struct {
        unsigned PRT0                   :1;
        unsigned PRT1                   :1;
        unsigned PRT2                   :1;
        unsigned PRT3                   :1;
        unsigned PRT4                   :1;
        unsigned PRT5                   :1;
        unsigned PRT6                   :1;
        unsigned PRT7                   :1;
    };
    struct {
        unsigned TU16APRT0              :1;
        unsigned TU16APRT1              :1;
        unsigned TU16APRT2              :1;
        unsigned TU16APRT3              :1;
        unsigned TU16APRT4              :1;
        unsigned TU16APRT5              :1;
        unsigned TU16APRT6              :1;
        unsigned TU16APRT7              :1;
    };
    struct {
        unsigned TU16APR24              :1;
        unsigned TU16APR25              :1;
        unsigned TU16APR26              :1;
        unsigned TU16APR27              :1;
        unsigned TU16APR28              :1;
        unsigned TU16APR29              :1;
        unsigned TU16APR30              :1;
        unsigned TU16APR31              :1;
    };
} TU16APRTbits_t;
