garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: SPI1STATUS
#define SPI1STATUS SPI1STATUS
extern volatile unsigned char           SPI1STATUS          __at(0x1DE);
#ifndef _LIB_BUILD
asm("SPI1STATUS equ 01DEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned                        :1;
        unsigned CLRBF                  :1;
        unsigned RXRE                   :1;
        unsigned                        :1;
        unsigned TXBE                   :1;
        unsigned                        :1;
        unsigned TXWE                   :1;
    };
    struct {
        unsigned SPI1RXBF               :1;
        unsigned                        :1;
        unsigned SPI1CLRBF              :1;
        unsigned SPI1RXRE               :1;
        unsigned                        :1;
        unsigned SPI1TXBE               :1;
        unsigned                        :1;
        unsigned SPI1TXWE               :1;
    };
} SPI1STATUSbits_t;
extern volatile SPI1STATUSbits_t SPI1STATUSbits __at(0x1DE);
// bitfield macros
#define _SPI1STATUS_RXBF_POSN                               0x0
#define _SPI1STATUS_RXBF_POSITION                           0x0
#define _SPI1STATUS_RXBF_SIZE                               0x1
#define _SPI1STATUS_RXBF_LENGTH                             0x1
#define _SPI1STATUS_RXBF_MASK                               0x1
#define _SPI1STATUS_CLRBF_POSN                              0x2
#define _SPI1STATUS_CLRBF_POSITION                          0x2
#define _SPI1STATUS_CLRBF_SIZE                              0x1
#define _SPI1STATUS_CLRBF_LENGTH                            0x1
#define _SPI1STATUS_CLRBF_MASK                              0x4
#define _SPI1STATUS_RXRE_POSN                               0x3
#define _SPI1STATUS_RXRE_POSITION                           0x3
#define _SPI1STATUS_RXRE_SIZE                               0x1
#define _SPI1STATUS_RXRE_LENGTH                             0x1
#define _SPI1STATUS_RXRE_MASK                               0x8
#define _SPI1STATUS_TXBE_POSN                               0x5
#define _SPI1STATUS_TXBE_POSITION                           0x5
#define _SPI1STATUS_TXBE_SIZE                               0x1
#define _SPI1STATUS_TXBE_LENGTH                             0x1
#define _SPI1STATUS_TXBE_MASK                               0x20
#define _SPI1STATUS_TXWE_POSN                               0x7
#define _SPI1STATUS_TXWE_POSITION                           0x7
#define _SPI1STATUS_TXWE_SIZE                               0x1
#define _SPI1STATUS_TXWE_LENGTH                             0x1
#define _SPI1STATUS_TXWE_MASK                               0x80
#define _SPI1STATUS_SPI1RXBF_POSN                           0x0
#define _SPI1STATUS_SPI1RXBF_POSITION                       0x0
#define _SPI1STATUS_SPI1RXBF_SIZE                           0x1
#define _SPI1STATUS_SPI1RXBF_LENGTH                         0x1
#define _SPI1STATUS_SPI1RXBF_MASK                           0x1
#define _SPI1STATUS_SPI1CLRBF_POSN                          0x2
#define _SPI1STATUS_SPI1CLRBF_POSITION                      0x2
#define _SPI1STATUS_SPI1CLRBF_SIZE                          0x1
#define _SPI1STATUS_SPI1CLRBF_LENGTH                        0x1
#define _SPI1STATUS_SPI1CLRBF_MASK                          0x4
#define _SPI1STATUS_SPI1RXRE_POSN                           0x3
#define _SPI1STATUS_SPI1RXRE_POSITION                       0x3
#define _SPI1STATUS_SPI1RXRE_SIZE                           0x1
#define _SPI1STATUS_SPI1RXRE_LENGTH                         0x1
#define _SPI1STATUS_SPI1RXRE_MASK                           0x8
#define _SPI1STATUS_SPI1TXBE_POSN                           0x5
#define _SPI1STATUS_SPI1TXBE_POSITION                       0x5
#define _SPI1STATUS_SPI1TXBE_SIZE                           0x1
#define _SPI1STATUS_SPI1TXBE_LENGTH                         0x1
#define _SPI1STATUS_SPI1TXBE_MASK                           0x20
#define _SPI1STATUS_SPI1TXWE_POSN                           0x7
#define _SPI1STATUS_SPI1TXWE_POSITION                       0x7
#define _SPI1STATUS_SPI1TXWE_SIZE                           0x1
#define _SPI1STATUS_SPI1TXWE_LENGTH                         0x1
#define _SPI1STATUS_SPI1TXWE_MASK                           0x80

// Register: SPI1TWIDTH
#define SPI1TWIDTH SPI1TWIDTH
extern volatile unsigned char           SPI1TWIDTH          __at(0x1DF);
#ifndef _LIB_BUILD
asm("SPI1TWIDTH equ 01DFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TWIDTH                 :3;
    };
    struct {
        unsigned TWIDTH0                :1;
        unsigned TWIDTH1                :1;
        unsigned TWIDTH2                :1;
    };
} SPI1TWIDTHbits_t;
extern volatile SPI1TWIDTHbits_t SPI1TWIDTHbits __at(0x1DF);
// bitfield macros
#define _SPI1TWIDTH_TWIDTH_POSN                             0x0
#define _SPI1TWIDTH_TWIDTH_POSITION                         0x0
#define _SPI1TWIDTH_TWIDTH_SIZE                             0x3
#define _SPI1TWIDTH_TWIDTH_LENGTH                           0x3
#define _SPI1TWIDTH_TWIDTH_MASK                             0x7
#define _SPI1TWIDTH_TWIDTH0_POSN                            0x0
#define _SPI1TWIDTH_TWIDTH0_POSITION                        0x0
#define _SPI1TWIDTH_TWIDTH0_SIZE                            0x1
#define _SPI1TWIDTH_TWIDTH0_LENGTH                          0x1
#define _SPI1TWIDTH_TWIDTH0_MASK                            0x1
#define _SPI1TWIDTH_TWIDTH1_POSN                            0x1
#define _SPI1TWIDTH_TWIDTH1_POSITION                        0x1
#define _SPI1TWIDTH_TWIDTH1_SIZE                            0x1
#define _SPI1TWIDTH_TWIDTH1_LENGTH                          0x1
#define _SPI1TWIDTH_TWIDTH1_MASK                            0x2
#define _SPI1TWIDTH_TWIDTH2_POSN                            0x2
#define _SPI1TWIDTH_TWIDTH2_POSITION                        0x2
#define _SPI1TWIDTH_TWIDTH2_SIZE                            0x1
#define _SPI1TWIDTH_TWIDTH2_LENGTH                          0x1
#define _SPI1TWIDTH_TWIDTH2_MASK                            0x4

// Register: SPI1BAUD
#define SPI1BAUD SPI1BAUD
extern volatile unsigned char           SPI1BAUD            __at(0x1E0);
#ifndef _LIB_BUILD
asm("SPI1BAUD equ 01E0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAUD                   :8;
    };
    struct {
        unsigned BAUD0                  :1;
        unsigned BAUD1                  :1;
        unsigned BAUD2                  :1;
        unsigned BAUD3                  :1;
        unsigned BAUD4                  :1;
        unsigned BAUD5                  :1;
        unsigned BAUD6                  :1;
        unsigned BAUD7                  :1;
    };
} SPI1BAUDbits_t;
