garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: I2C1BAUD
#define I2C1BAUD I2C1BAUD
extern volatile unsigned char           I2C1BAUD            __at(0x1F8);
#ifndef _LIB_BUILD
asm("I2C1BAUD equ 01F8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BAUD                   :8;
    };
} I2C1BAUDbits_t;
extern volatile I2C1BAUDbits_t I2C1BAUDbits __at(0x1F8);
// bitfield macros
#define _I2C1BAUD_BAUD_POSN                                 0x0
#define _I2C1BAUD_BAUD_POSITION                             0x0
#define _I2C1BAUD_BAUD_SIZE                                 0x8
#define _I2C1BAUD_BAUD_LENGTH                               0x8
#define _I2C1BAUD_BAUD_MASK                                 0xFF

// Register: I2C1CLK
#define I2C1CLK I2C1CLK
extern volatile unsigned char           I2C1CLK             __at(0x1F9);
#ifndef _LIB_BUILD
asm("I2C1CLK equ 01F9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned I2CCLK                 :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
    struct {
        unsigned I2CCLK0                :1;
        unsigned I2CCLK1                :1;
        unsigned I2CCLK2                :1;
        unsigned I2CCLK3                :1;
    };
} I2C1CLKbits_t;
extern volatile I2C1CLKbits_t I2C1CLKbits __at(0x1F9);
// bitfield macros
#define _I2C1CLK_CLK_POSN                                   0x0
#define _I2C1CLK_CLK_POSITION                               0x0
#define _I2C1CLK_CLK_SIZE                                   0x8
#define _I2C1CLK_CLK_LENGTH                                 0x8
#define _I2C1CLK_CLK_MASK                                   0xFF
#define _I2C1CLK_I2CCLK_POSN                                0x0
#define _I2C1CLK_I2CCLK_POSITION                            0x0
#define _I2C1CLK_I2CCLK_SIZE                                0x8
#define _I2C1CLK_I2CCLK_LENGTH                              0x8
#define _I2C1CLK_I2CCLK_MASK                                0xFF
#define _I2C1CLK_CLK0_POSN                                  0x0
#define _I2C1CLK_CLK0_POSITION                              0x0
#define _I2C1CLK_CLK0_SIZE                                  0x1
#define _I2C1CLK_CLK0_LENGTH                                0x1
#define _I2C1CLK_CLK0_MASK                                  0x1
#define _I2C1CLK_CLK1_POSN                                  0x1
#define _I2C1CLK_CLK1_POSITION                              0x1
#define _I2C1CLK_CLK1_SIZE                                  0x1
#define _I2C1CLK_CLK1_LENGTH                                0x1
#define _I2C1CLK_CLK1_MASK                                  0x2
#define _I2C1CLK_CLK2_POSN                                  0x2
#define _I2C1CLK_CLK2_POSITION                              0x2
#define _I2C1CLK_CLK2_SIZE                                  0x1
#define _I2C1CLK_CLK2_LENGTH                                0x1
#define _I2C1CLK_CLK2_MASK                                  0x4
#define _I2C1CLK_CLK3_POSN                                  0x3
#define _I2C1CLK_CLK3_POSITION                              0x3
#define _I2C1CLK_CLK3_SIZE                                  0x1
#define _I2C1CLK_CLK3_LENGTH                                0x1
#define _I2C1CLK_CLK3_MASK                                  0x8
#define _I2C1CLK_I2CCLK0_POSN                               0x0
#define _I2C1CLK_I2CCLK0_POSITION                           0x0
#define _I2C1CLK_I2CCLK0_SIZE                               0x1
#define _I2C1CLK_I2CCLK0_LENGTH                             0x1
#define _I2C1CLK_I2CCLK0_MASK                               0x1
#define _I2C1CLK_I2CCLK1_POSN                               0x1
#define _I2C1CLK_I2CCLK1_POSITION                           0x1
#define _I2C1CLK_I2CCLK1_SIZE                               0x1
#define _I2C1CLK_I2CCLK1_LENGTH                             0x1
#define _I2C1CLK_I2CCLK1_MASK                               0x2
#define _I2C1CLK_I2CCLK2_POSN                               0x2
#define _I2C1CLK_I2CCLK2_POSITION                           0x2
#define _I2C1CLK_I2CCLK2_SIZE                               0x1
#define _I2C1CLK_I2CCLK2_LENGTH                             0x1
#define _I2C1CLK_I2CCLK2_MASK                               0x4
#define _I2C1CLK_I2CCLK3_POSN                               0x3
#define _I2C1CLK_I2CCLK3_POSITION                           0x3
#define _I2C1CLK_I2CCLK3_SIZE                               0x1
#define _I2C1CLK_I2CCLK3_LENGTH                             0x1
#define _I2C1CLK_I2CCLK3_MASK                               0x8

// Register: I2C1BTOC
#define I2C1BTOC I2C1BTOC
extern volatile unsigned char           I2C1BTOC            __at(0x1FA);
#ifndef _LIB_BUILD
asm("I2C1BTOC equ 01FAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTOC                   :8;
    };
    struct {
        unsigned I2CBTOC                :8;
    };
    struct {
        unsigned BTOC0                  :1;
        unsigned BTOC1                  :1;
        unsigned BTOC2                  :1;
    };
    struct {
        unsigned I2CBTOC0               :1;
        unsigned I2CBTOC1               :1;
        unsigned I2CBTOC2               :1;
    };
} I2C1BTOCbits_t;
extern volatile I2C1BTOCbits_t I2C1BTOCbits __at(0x1FA);
// bitfield macros
#define _I2C1BTOC_BTOC_POSN                                 0x0
#define _I2C1BTOC_BTOC_POSITION                             0x0
#define _I2C1BTOC_BTOC_SIZE                                 0x8
#define _I2C1BTOC_BTOC_LENGTH                               0x8
#define _I2C1BTOC_BTOC_MASK                                 0xFF
#define _I2C1BTOC_I2CBTOC_POSN                              0x0
#define _I2C1BTOC_I2CBTOC_POSITION                          0x0
#define _I2C1BTOC_I2CBTOC_SIZE                              0x8
#define _I2C1BTOC_I2CBTOC_LENGTH                            0x8
#define _I2C1BTOC_I2CBTOC_MASK                              0xFF
#define _I2C1BTOC_BTOC0_POSN                                0x0
#define _I2C1BTOC_BTOC0_POSITION                            0x0
#define _I2C1BTOC_BTOC0_SIZE                                0x1
#define _I2C1BTOC_BTOC0_LENGTH                              0x1
#define _I2C1BTOC_BTOC0_MASK                                0x1
#define _I2C1BTOC_BTOC1_POSN                                0x1
#define _I2C1BTOC_BTOC1_POSITION                            0x1
#define _I2C1BTOC_BTOC1_SIZE                                0x1
#define _I2C1BTOC_BTOC1_LENGTH                              0x1
#define _I2C1BTOC_BTOC1_MASK                                0x2
#define _I2C1BTOC_BTOC2_POSN                                0x2
#define _I2C1BTOC_BTOC2_POSITION                            0x2
#define _I2C1BTOC_BTOC2_SIZE                                0x1
#define _I2C1BTOC_BTOC2_LENGTH                              0x1
#define _I2C1BTOC_BTOC2_MASK                                0x4
#define _I2C1BTOC_I2CBTOC0_POSN                             0x0
#define _I2C1BTOC_I2CBTOC0_POSITION                         0x0
#define _I2C1BTOC_I2CBTOC0_SIZE                             0x1
#define _I2C1BTOC_I2CBTOC0_LENGTH                           0x1
#define _I2C1BTOC_I2CBTOC0_MASK                             0x1
#define _I2C1BTOC_I2CBTOC1_POSN                             0x1
#define _I2C1BTOC_I2CBTOC1_POSITION                         0x1
#define _I2C1BTOC_I2CBTOC1_SIZE                             0x1
#define _I2C1BTOC_I2CBTOC1_LENGTH                           0x1
#define _I2C1BTOC_I2CBTOC1_MASK                             0x2
#define _I2C1BTOC_I2CBTOC2_POSN                             0x2
#define _I2C1BTOC_I2CBTOC2_POSITION                         0x2
#define _I2C1BTOC_I2CBTOC2_SIZE                             0x1
#define _I2C1BTOC_I2CBTOC2_LENGTH                           0x1
#define _I2C1BTOC_I2CBTOC2_MASK                             0x4

// Register: FVRCON
#define FVRCON FVRCON
extern volatile unsigned char           FVRCON              __at(0x201);
#ifndef _LIB_BUILD
asm("FVRCON equ 0201h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADFVR                  :2;
        unsigned                        :2;
        unsigned TSRNG                  :1;
        unsigned TSEN                   :1;
        unsigned RDY                    :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned ADFVR0                 :1;
        unsigned ADFVR1                 :1;
        unsigned                        :4;
        unsigned FVRRDY                 :1;
        unsigned FVREN                  :1;
    };
} FVRCONbits_t;
