garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: ADCLK
#define ADCLK ADCLK
extern volatile unsigned char           ADCLK               __at(0x236);
#ifndef _LIB_BUILD
asm("ADCLK equ 0236h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ADCS3                  :1;
        unsigned ADCS4                  :1;
        unsigned ADCS5                  :1;
    };
    struct {
        unsigned ADCS                   :8;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
        unsigned CS5                    :1;
    };
} ADCLKbits_t;
extern volatile ADCLKbits_t ADCLKbits __at(0x236);
// bitfield macros
#define _ADCLK_CS_POSN                                      0x0
#define _ADCLK_CS_POSITION                                  0x0
#define _ADCLK_CS_SIZE                                      0x8
#define _ADCLK_CS_LENGTH                                    0x8
#define _ADCLK_CS_MASK                                      0xFF
#define _ADCLK_ADCS0_POSN                                   0x0
#define _ADCLK_ADCS0_POSITION                               0x0
#define _ADCLK_ADCS0_SIZE                                   0x1
#define _ADCLK_ADCS0_LENGTH                                 0x1
#define _ADCLK_ADCS0_MASK                                   0x1
#define _ADCLK_ADCS1_POSN                                   0x1
#define _ADCLK_ADCS1_POSITION                               0x1
#define _ADCLK_ADCS1_SIZE                                   0x1
#define _ADCLK_ADCS1_LENGTH                                 0x1
#define _ADCLK_ADCS1_MASK                                   0x2
#define _ADCLK_ADCS2_POSN                                   0x2
#define _ADCLK_ADCS2_POSITION                               0x2
#define _ADCLK_ADCS2_SIZE                                   0x1
#define _ADCLK_ADCS2_LENGTH                                 0x1
#define _ADCLK_ADCS2_MASK                                   0x4
#define _ADCLK_ADCS3_POSN                                   0x3
#define _ADCLK_ADCS3_POSITION                               0x3
#define _ADCLK_ADCS3_SIZE                                   0x1
#define _ADCLK_ADCS3_LENGTH                                 0x1
#define _ADCLK_ADCS3_MASK                                   0x8
#define _ADCLK_ADCS4_POSN                                   0x4
#define _ADCLK_ADCS4_POSITION                               0x4
#define _ADCLK_ADCS4_SIZE                                   0x1
#define _ADCLK_ADCS4_LENGTH                                 0x1
#define _ADCLK_ADCS4_MASK                                   0x10
#define _ADCLK_ADCS5_POSN                                   0x5
#define _ADCLK_ADCS5_POSITION                               0x5
#define _ADCLK_ADCS5_SIZE                                   0x1
#define _ADCLK_ADCS5_LENGTH                                 0x1
#define _ADCLK_ADCS5_MASK                                   0x20
#define _ADCLK_ADCS_POSN                                    0x0
#define _ADCLK_ADCS_POSITION                                0x0
#define _ADCLK_ADCS_SIZE                                    0x8
#define _ADCLK_ADCS_LENGTH                                  0x8
#define _ADCLK_ADCS_MASK                                    0xFF
#define _ADCLK_CS0_POSN                                     0x0
#define _ADCLK_CS0_POSITION                                 0x0
#define _ADCLK_CS0_SIZE                                     0x1
#define _ADCLK_CS0_LENGTH                                   0x1
#define _ADCLK_CS0_MASK                                     0x1
#define _ADCLK_CS1_POSN                                     0x1
#define _ADCLK_CS1_POSITION                                 0x1
#define _ADCLK_CS1_SIZE                                     0x1
#define _ADCLK_CS1_LENGTH                                   0x1
#define _ADCLK_CS1_MASK                                     0x2
#define _ADCLK_CS2_POSN                                     0x2
#define _ADCLK_CS2_POSITION                                 0x2
#define _ADCLK_CS2_SIZE                                     0x1
#define _ADCLK_CS2_LENGTH                                   0x1
#define _ADCLK_CS2_MASK                                     0x4
#define _ADCLK_CS3_POSN                                     0x3
#define _ADCLK_CS3_POSITION                                 0x3
#define _ADCLK_CS3_SIZE                                     0x1
#define _ADCLK_CS3_LENGTH                                   0x1
#define _ADCLK_CS3_MASK                                     0x8
#define _ADCLK_CS4_POSN                                     0x4
#define _ADCLK_CS4_POSITION                                 0x4
#define _ADCLK_CS4_SIZE                                     0x1
#define _ADCLK_CS4_LENGTH                                   0x1
#define _ADCLK_CS4_MASK                                     0x10
#define _ADCLK_CS5_POSN                                     0x5
#define _ADCLK_CS5_POSITION                                 0x5
#define _ADCLK_CS5_SIZE                                     0x1
#define _ADCLK_CS5_LENGTH                                   0x1
#define _ADCLK_CS5_MASK                                     0x20

// Register: ADCG1A
#define ADCG1A ADCG1A
extern volatile unsigned char           ADCG1A              __at(0x237);
#ifndef _LIB_BUILD
asm("ADCG1A equ 0237h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGA0                   :1;
        unsigned CGA1                   :1;
        unsigned CGA2                   :1;
        unsigned                        :1;
        unsigned CGA4                   :1;
        unsigned CGA5                   :1;
    };
} ADCG1Abits_t;
extern volatile ADCG1Abits_t ADCG1Abits __at(0x237);
// bitfield macros
#define _ADCG1A_CGA0_POSN                                   0x0
#define _ADCG1A_CGA0_POSITION                               0x0
#define _ADCG1A_CGA0_SIZE                                   0x1
#define _ADCG1A_CGA0_LENGTH                                 0x1
#define _ADCG1A_CGA0_MASK                                   0x1
#define _ADCG1A_CGA1_POSN                                   0x1
#define _ADCG1A_CGA1_POSITION                               0x1
#define _ADCG1A_CGA1_SIZE                                   0x1
#define _ADCG1A_CGA1_LENGTH                                 0x1
#define _ADCG1A_CGA1_MASK                                   0x2
#define _ADCG1A_CGA2_POSN                                   0x2
#define _ADCG1A_CGA2_POSITION                               0x2
#define _ADCG1A_CGA2_SIZE                                   0x1
#define _ADCG1A_CGA2_LENGTH                                 0x1
#define _ADCG1A_CGA2_MASK                                   0x4
#define _ADCG1A_CGA4_POSN                                   0x4
#define _ADCG1A_CGA4_POSITION                               0x4
#define _ADCG1A_CGA4_SIZE                                   0x1
#define _ADCG1A_CGA4_LENGTH                                 0x1
#define _ADCG1A_CGA4_MASK                                   0x10
#define _ADCG1A_CGA5_POSN                                   0x5
#define _ADCG1A_CGA5_POSITION                               0x5
#define _ADCG1A_CGA5_SIZE                                   0x1
#define _ADCG1A_CGA5_LENGTH                                 0x1
#define _ADCG1A_CGA5_MASK                                   0x20

