garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile RC1FEATbits_t RC1FEATbits __at(0x313);
// bitfield macros
#define _RC1FEAT_SYSBUF_POSN                                0x0
#define _RC1FEAT_SYSBUF_POSITION                            0x0
#define _RC1FEAT_SYSBUF_SIZE                                0x3
#define _RC1FEAT_SYSBUF_LENGTH                              0x3
#define _RC1FEAT_SYSBUF_MASK                                0x7
#define _RC1FEAT_I3CBUF_POSN                                0x3
#define _RC1FEAT_I3CBUF_POSITION                            0x3
#define _RC1FEAT_I3CBUF_SIZE                                0x3
#define _RC1FEAT_I3CBUF_LENGTH                              0x3
#define _RC1FEAT_I3CBUF_MASK                                0x38
#define _RC1FEAT_SLEW_POSN                                  0x6
#define _RC1FEAT_SLEW_POSITION                              0x6
#define _RC1FEAT_SLEW_SIZE                                  0x2
#define _RC1FEAT_SLEW_LENGTH                                0x2
#define _RC1FEAT_SLEW_MASK                                  0xC0

// Register: RC4FEAT
#define RC4FEAT RC4FEAT
extern volatile unsigned char           RC4FEAT             __at(0x315);
#ifndef _LIB_BUILD
asm("RC4FEAT equ 0315h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYSBUF                 :2;
        unsigned                        :4;
        unsigned SLEW                   :2;
    };
} RC4FEATbits_t;
extern volatile RC4FEATbits_t RC4FEATbits __at(0x315);
// bitfield macros
#define _RC4FEAT_SYSBUF_POSN                                0x0
#define _RC4FEAT_SYSBUF_POSITION                            0x0
#define _RC4FEAT_SYSBUF_SIZE                                0x2
#define _RC4FEAT_SYSBUF_LENGTH                              0x2
#define _RC4FEAT_SYSBUF_MASK                                0x3
#define _RC4FEAT_SLEW_POSN                                  0x6
#define _RC4FEAT_SLEW_POSITION                              0x6
#define _RC4FEAT_SLEW_SIZE                                  0x2
#define _RC4FEAT_SLEW_LENGTH                                0x2
#define _RC4FEAT_SLEW_MASK                                  0xC0

// Register: RC5FEAT
#define RC5FEAT RC5FEAT
extern volatile unsigned char           RC5FEAT             __at(0x316);
#ifndef _LIB_BUILD
asm("RC5FEAT equ 0316h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYSBUF                 :2;
        unsigned                        :4;
        unsigned SLEW                   :2;
    };
} RC5FEATbits_t;
extern volatile RC5FEATbits_t RC5FEATbits __at(0x316);
// bitfield macros
#define _RC5FEAT_SYSBUF_POSN                                0x0
#define _RC5FEAT_SYSBUF_POSITION                            0x0
#define _RC5FEAT_SYSBUF_SIZE                                0x2
#define _RC5FEAT_SYSBUF_LENGTH                              0x2
#define _RC5FEAT_SYSBUF_MASK                                0x3
#define _RC5FEAT_SLEW_POSN                                  0x6
#define _RC5FEAT_SLEW_POSITION                              0x6
#define _RC5FEAT_SLEW_SIZE                                  0x2
#define _RC5FEAT_SLEW_LENGTH                                0x2
#define _RC5FEAT_SLEW_MASK                                  0xC0

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x319);
#ifndef _LIB_BUILD
asm("RA0PPS equ 0319h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0x319);
// bitfield macros
#define _RA0PPS_RA0PPS0_POSN                                0x0
#define _RA0PPS_RA0PPS0_POSITION                            0x0
#define _RA0PPS_RA0PPS0_SIZE                                0x1
#define _RA0PPS_RA0PPS0_LENGTH                              0x1
#define _RA0PPS_RA0PPS0_MASK                                0x1
#define _RA0PPS_RA0PPS1_POSN                                0x1
#define _RA0PPS_RA0PPS1_POSITION                            0x1
#define _RA0PPS_RA0PPS1_SIZE                                0x1
#define _RA0PPS_RA0PPS1_LENGTH                              0x1
#define _RA0PPS_RA0PPS1_MASK                                0x2
#define _RA0PPS_RA0PPS2_POSN                                0x2
#define _RA0PPS_RA0PPS2_POSITION                            0x2
#define _RA0PPS_RA0PPS2_SIZE                                0x1
#define _RA0PPS_RA0PPS2_LENGTH                              0x1
#define _RA0PPS_RA0PPS2_MASK                                0x4
#define _RA0PPS_RA0PPS3_POSN                                0x3
#define _RA0PPS_RA0PPS3_POSITION                            0x3
#define _RA0PPS_RA0PPS3_SIZE                                0x1
#define _RA0PPS_RA0PPS3_LENGTH                              0x1
#define _RA0PPS_RA0PPS3_MASK                                0x8
#define _RA0PPS_RA0PPS4_POSN                                0x4
#define _RA0PPS_RA0PPS4_POSITION                            0x4
#define _RA0PPS_RA0PPS4_SIZE                                0x1
#define _RA0PPS_RA0PPS4_LENGTH                              0x1
#define _RA0PPS_RA0PPS4_MASK                                0x10

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0x31A);
#ifndef _LIB_BUILD
asm("RA1PPS equ 031Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS0                :1;
        unsigned RA1PPS1                :1;
        unsigned RA1PPS2                :1;
        unsigned RA1PPS3                :1;
        unsigned RA1PPS4                :1;
    };
} RA1PPSbits_t;
extern volatile RA1PPSbits_t RA1PPSbits __at(0x31A);
// bitfield macros
#define _RA1PPS_RA1PPS0_POSN                                0x0
#define _RA1PPS_RA1PPS0_POSITION                            0x0
#define _RA1PPS_RA1PPS0_SIZE                                0x1
#define _RA1PPS_RA1PPS0_LENGTH                              0x1
#define _RA1PPS_RA1PPS0_MASK                                0x1
#define _RA1PPS_RA1PPS1_POSN                                0x1
#define _RA1PPS_RA1PPS1_POSITION                            0x1
#define _RA1PPS_RA1PPS1_SIZE                                0x1
#define _RA1PPS_RA1PPS1_LENGTH                              0x1
#define _RA1PPS_RA1PPS1_MASK                                0x2
#define _RA1PPS_RA1PPS2_POSN                                0x2
#define _RA1PPS_RA1PPS2_POSITION                            0x2
#define _RA1PPS_RA1PPS2_SIZE                                0x1
#define _RA1PPS_RA1PPS2_LENGTH                              0x1
#define _RA1PPS_RA1PPS2_MASK                                0x4
#define _RA1PPS_RA1PPS3_POSN                                0x3
#define _RA1PPS_RA1PPS3_POSITION                            0x3
#define _RA1PPS_RA1PPS3_SIZE                                0x1
#define _RA1PPS_RA1PPS3_LENGTH                              0x1
#define _RA1PPS_RA1PPS3_MASK                                0x8
#define _RA1PPS_RA1PPS4_POSN                                0x4
#define _RA1PPS_RA1PPS4_POSITION                            0x4
#define _RA1PPS_RA1PPS4_SIZE                                0x1
#define _RA1PPS_RA1PPS4_LENGTH                              0x1
#define _RA1PPS_RA1PPS4_MASK                                0x10

// Register: RA2PPS
#define RA2PPS RA2PPS
extern volatile unsigned char           RA2PPS              __at(0x31B);
#ifndef _LIB_BUILD
asm("RA2PPS equ 031Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA2PPS0                :1;
        unsigned RA2PPS1                :1;
        unsigned RA2PPS2                :1;
        unsigned RA2PPS3                :1;
        unsigned RA2PPS4                :1;
    };
} RA2PPSbits_t;
