garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
extern volatile unsigned char           PWMIN0PPS           __at(0x384);
#ifndef _LIB_BUILD
asm("PWMIN0PPS equ 0384h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWMIN0PPS              :5;
    };
    struct {
        unsigned PWMIN0PPS0             :1;
        unsigned PWMIN0PPS1             :1;
        unsigned PWMIN0PPS2             :1;
        unsigned PWMIN0PPS3             :1;
        unsigned PWMIN0PPS4             :1;
    };
} PWMIN0PPSbits_t;
extern volatile PWMIN0PPSbits_t PWMIN0PPSbits __at(0x384);
// bitfield macros
#define _PWMIN0PPS_PWMIN0PPS_POSN                           0x0
#define _PWMIN0PPS_PWMIN0PPS_POSITION                       0x0
#define _PWMIN0PPS_PWMIN0PPS_SIZE                           0x5
#define _PWMIN0PPS_PWMIN0PPS_LENGTH                         0x5
#define _PWMIN0PPS_PWMIN0PPS_MASK                           0x1F
#define _PWMIN0PPS_PWMIN0PPS0_POSN                          0x0
#define _PWMIN0PPS_PWMIN0PPS0_POSITION                      0x0
#define _PWMIN0PPS_PWMIN0PPS0_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS0_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS0_MASK                          0x1
#define _PWMIN0PPS_PWMIN0PPS1_POSN                          0x1
#define _PWMIN0PPS_PWMIN0PPS1_POSITION                      0x1
#define _PWMIN0PPS_PWMIN0PPS1_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS1_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS1_MASK                          0x2
#define _PWMIN0PPS_PWMIN0PPS2_POSN                          0x2
#define _PWMIN0PPS_PWMIN0PPS2_POSITION                      0x2
#define _PWMIN0PPS_PWMIN0PPS2_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS2_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS2_MASK                          0x4
#define _PWMIN0PPS_PWMIN0PPS3_POSN                          0x3
#define _PWMIN0PPS_PWMIN0PPS3_POSITION                      0x3
#define _PWMIN0PPS_PWMIN0PPS3_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS3_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS3_MASK                          0x8
#define _PWMIN0PPS_PWMIN0PPS4_POSN                          0x4
#define _PWMIN0PPS_PWMIN0PPS4_POSITION                      0x4
#define _PWMIN0PPS_PWMIN0PPS4_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS4_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS4_MASK                          0x10

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
extern volatile unsigned char           PWMIN1PPS           __at(0x385);
#ifndef _LIB_BUILD
asm("PWMIN1PPS equ 0385h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWMIN1PPS              :5;
    };
    struct {
        unsigned PWMIN1PPS0             :1;
        unsigned PWMIN1PPS1             :1;
        unsigned PWMIN1PPS2             :1;
        unsigned PWMIN1PPS3             :1;
        unsigned PWMIN1PPS4             :1;
    };
} PWMIN1PPSbits_t;
extern volatile PWMIN1PPSbits_t PWMIN1PPSbits __at(0x385);
// bitfield macros
#define _PWMIN1PPS_PWMIN1PPS_POSN                           0x0
#define _PWMIN1PPS_PWMIN1PPS_POSITION                       0x0
#define _PWMIN1PPS_PWMIN1PPS_SIZE                           0x5
#define _PWMIN1PPS_PWMIN1PPS_LENGTH                         0x5
#define _PWMIN1PPS_PWMIN1PPS_MASK                           0x1F
#define _PWMIN1PPS_PWMIN1PPS0_POSN                          0x0
#define _PWMIN1PPS_PWMIN1PPS0_POSITION                      0x0
#define _PWMIN1PPS_PWMIN1PPS0_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS0_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS0_MASK                          0x1
#define _PWMIN1PPS_PWMIN1PPS1_POSN                          0x1
#define _PWMIN1PPS_PWMIN1PPS1_POSITION                      0x1
#define _PWMIN1PPS_PWMIN1PPS1_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS1_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS1_MASK                          0x2
#define _PWMIN1PPS_PWMIN1PPS2_POSN                          0x2
#define _PWMIN1PPS_PWMIN1PPS2_POSITION                      0x2
#define _PWMIN1PPS_PWMIN1PPS2_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS2_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS2_MASK                          0x4
#define _PWMIN1PPS_PWMIN1PPS3_POSN                          0x3
#define _PWMIN1PPS_PWMIN1PPS3_POSITION                      0x3
#define _PWMIN1PPS_PWMIN1PPS3_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS3_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS3_MASK                          0x8
#define _PWMIN1PPS_PWMIN1PPS4_POSN                          0x4
#define _PWMIN1PPS_PWMIN1PPS4_POSITION                      0x4
#define _PWMIN1PPS_PWMIN1PPS4_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS4_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS4_MASK                          0x10

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
extern volatile unsigned char           PWM1ERSPPS          __at(0x386);
#ifndef _LIB_BUILD
asm("PWM1ERSPPS equ 0386h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1ERSPPS             :5;
    };
    struct {
        unsigned PWM1ERSPPS0            :1;
        unsigned PWM1ERSPPS1            :1;
        unsigned PWM1ERSPPS2            :1;
        unsigned PWM1ERSPPS3            :1;
        unsigned PWM1ERSPPS4            :1;
    };
} PWM1ERSPPSbits_t;
extern volatile PWM1ERSPPSbits_t PWM1ERSPPSbits __at(0x386);
// bitfield macros
#define _PWM1ERSPPS_PWM1ERSPPS_POSN                         0x0
#define _PWM1ERSPPS_PWM1ERSPPS_POSITION                     0x0
#define _PWM1ERSPPS_PWM1ERSPPS_SIZE                         0x5
#define _PWM1ERSPPS_PWM1ERSPPS_LENGTH                       0x5
#define _PWM1ERSPPS_PWM1ERSPPS_MASK                         0x1F
#define _PWM1ERSPPS_PWM1ERSPPS0_POSN                        0x0
#define _PWM1ERSPPS_PWM1ERSPPS0_POSITION                    0x0
#define _PWM1ERSPPS_PWM1ERSPPS0_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS0_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS0_MASK                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_POSN                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_POSITION                    0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_MASK                        0x2
#define _PWM1ERSPPS_PWM1ERSPPS2_POSN                        0x2
#define _PWM1ERSPPS_PWM1ERSPPS2_POSITION                    0x2
#define _PWM1ERSPPS_PWM1ERSPPS2_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS2_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS2_MASK                        0x4
#define _PWM1ERSPPS_PWM1ERSPPS3_POSN                        0x3
#define _PWM1ERSPPS_PWM1ERSPPS3_POSITION                    0x3
#define _PWM1ERSPPS_PWM1ERSPPS3_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS3_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS3_MASK                        0x8
#define _PWM1ERSPPS_PWM1ERSPPS4_POSN                        0x4
#define _PWM1ERSPPS_PWM1ERSPPS4_POSITION                    0x4
#define _PWM1ERSPPS_PWM1ERSPPS4_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS4_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS4_MASK                        0x10

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
extern volatile unsigned char           PWM2ERSPPS          __at(0x387);
#ifndef _LIB_BUILD
asm("PWM2ERSPPS equ 0387h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM2ERSPPS             :5;
    };
    struct {
        unsigned PWM2ERSPPS0            :1;
        unsigned PWM2ERSPPS1            :1;
        unsigned PWM2ERSPPS2            :1;
        unsigned PWM2ERSPPS3            :1;
        unsigned PWM2ERSPPS4            :1;
    };
} PWM2ERSPPSbits_t;
