garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: I2C1SDAPPS
#define I2C1SDAPPS I2C1SDAPPS
extern volatile unsigned char           I2C1SDAPPS          __at(0x3AE);
#ifndef _LIB_BUILD
asm("I2C1SDAPPS equ 03AEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1SDAPPS             :5;
    };
    struct {
        unsigned I2C1SDAPPS0            :1;
        unsigned I2C1SDAPPS1            :1;
        unsigned I2C1SDAPPS2            :1;
        unsigned I2C1SDAPPS3            :1;
        unsigned I2C1SDAPPS4            :1;
    };
} I2C1SDAPPSbits_t;
extern volatile I2C1SDAPPSbits_t I2C1SDAPPSbits __at(0x3AE);
// bitfield macros
#define _I2C1SDAPPS_I2C1SDAPPS_POSN                         0x0
#define _I2C1SDAPPS_I2C1SDAPPS_POSITION                     0x0
#define _I2C1SDAPPS_I2C1SDAPPS_SIZE                         0x5
#define _I2C1SDAPPS_I2C1SDAPPS_LENGTH                       0x5
#define _I2C1SDAPPS_I2C1SDAPPS_MASK                         0x1F
#define _I2C1SDAPPS_I2C1SDAPPS0_POSN                        0x0
#define _I2C1SDAPPS_I2C1SDAPPS0_POSITION                    0x0
#define _I2C1SDAPPS_I2C1SDAPPS0_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS0_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS0_MASK                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_POSN                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_POSITION                    0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS1_MASK                        0x2
#define _I2C1SDAPPS_I2C1SDAPPS2_POSN                        0x2
#define _I2C1SDAPPS_I2C1SDAPPS2_POSITION                    0x2
#define _I2C1SDAPPS_I2C1SDAPPS2_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS2_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS2_MASK                        0x4
#define _I2C1SDAPPS_I2C1SDAPPS3_POSN                        0x3
#define _I2C1SDAPPS_I2C1SDAPPS3_POSITION                    0x3
#define _I2C1SDAPPS_I2C1SDAPPS3_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS3_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS3_MASK                        0x8
#define _I2C1SDAPPS_I2C1SDAPPS4_POSN                        0x4
#define _I2C1SDAPPS_I2C1SDAPPS4_POSITION                    0x4
#define _I2C1SDAPPS_I2C1SDAPPS4_SIZE                        0x1
#define _I2C1SDAPPS_I2C1SDAPPS4_LENGTH                      0x1
#define _I2C1SDAPPS_I2C1SDAPPS4_MASK                        0x10

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
extern volatile unsigned char           ADACTPPS            __at(0x3B1);
#ifndef _LIB_BUILD
asm("ADACTPPS equ 03B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACTPPS               :5;
    };
    struct {
        unsigned ADACTPPS0              :1;
        unsigned ADACTPPS1              :1;
        unsigned ADACTPPS2              :1;
        unsigned ADACTPPS3              :1;
        unsigned ADACTPPS4              :1;
    };
} ADACTPPSbits_t;
extern volatile ADACTPPSbits_t ADACTPPSbits __at(0x3B1);
// bitfield macros
#define _ADACTPPS_ADACTPPS_POSN                             0x0
#define _ADACTPPS_ADACTPPS_POSITION                         0x0
#define _ADACTPPS_ADACTPPS_SIZE                             0x5
#define _ADACTPPS_ADACTPPS_LENGTH                           0x5
#define _ADACTPPS_ADACTPPS_MASK                             0x1F
#define _ADACTPPS_ADACTPPS0_POSN                            0x0
#define _ADACTPPS_ADACTPPS0_POSITION                        0x0
#define _ADACTPPS_ADACTPPS0_SIZE                            0x1
#define _ADACTPPS_ADACTPPS0_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS0_MASK                            0x1
#define _ADACTPPS_ADACTPPS1_POSN                            0x1
#define _ADACTPPS_ADACTPPS1_POSITION                        0x1
#define _ADACTPPS_ADACTPPS1_SIZE                            0x1
#define _ADACTPPS_ADACTPPS1_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS1_MASK                            0x2
#define _ADACTPPS_ADACTPPS2_POSN                            0x2
#define _ADACTPPS_ADACTPPS2_POSITION                        0x2
#define _ADACTPPS_ADACTPPS2_SIZE                            0x1
#define _ADACTPPS_ADACTPPS2_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS2_MASK                            0x4
#define _ADACTPPS_ADACTPPS3_POSN                            0x3
#define _ADACTPPS_ADACTPPS3_POSITION                        0x3
#define _ADACTPPS_ADACTPPS3_SIZE                            0x1
#define _ADACTPPS_ADACTPPS3_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS3_MASK                            0x8
#define _ADACTPPS_ADACTPPS4_POSN                            0x4
#define _ADACTPPS_ADACTPPS4_POSITION                        0x4
#define _ADACTPPS_ADACTPPS4_SIZE                            0x1
#define _ADACTPPS_ADACTPPS4_LENGTH                          0x1
#define _ADACTPPS_ADACTPPS4_MASK                            0x10

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x416);
#ifndef _LIB_BUILD
asm("ANSELA equ 0416h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELA0                :1;
        unsigned ANSELA1                :1;
        unsigned ANSELA2                :1;
        unsigned                        :1;
        unsigned ANSELA4                :1;
        unsigned ANSELA5                :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x416);
// bitfield macros
#define _ANSELA_ANSELA0_POSN                                0x0
#define _ANSELA_ANSELA0_POSITION                            0x0
#define _ANSELA_ANSELA0_SIZE                                0x1
#define _ANSELA_ANSELA0_LENGTH                              0x1
#define _ANSELA_ANSELA0_MASK                                0x1
#define _ANSELA_ANSELA1_POSN                                0x1
#define _ANSELA_ANSELA1_POSITION                            0x1
#define _ANSELA_ANSELA1_SIZE                                0x1
#define _ANSELA_ANSELA1_LENGTH                              0x1
#define _ANSELA_ANSELA1_MASK                                0x2
#define _ANSELA_ANSELA2_POSN                                0x2
#define _ANSELA_ANSELA2_POSITION                            0x2
#define _ANSELA_ANSELA2_SIZE                                0x1
#define _ANSELA_ANSELA2_LENGTH                              0x1
#define _ANSELA_ANSELA2_MASK                                0x4
#define _ANSELA_ANSELA4_POSN                                0x4
#define _ANSELA_ANSELA4_POSITION                            0x4
#define _ANSELA_ANSELA4_SIZE                                0x1
#define _ANSELA_ANSELA4_LENGTH                              0x1
#define _ANSELA_ANSELA4_MASK                                0x10
#define _ANSELA_ANSELA5_POSN                                0x5
#define _ANSELA_ANSELA5_POSITION                            0x5
#define _ANSELA_ANSELA5_SIZE                                0x1
#define _ANSELA_ANSELA5_LENGTH                              0x1
#define _ANSELA_ANSELA5_MASK                                0x20

