garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile IOCWFbits_t IOCWFbits __at(0x459);
// bitfield macros
#define _IOCWF_IOCWF0_POSN                                  0x0
#define _IOCWF_IOCWF0_POSITION                              0x0
#define _IOCWF_IOCWF0_SIZE                                  0x1
#define _IOCWF_IOCWF0_LENGTH                                0x1
#define _IOCWF_IOCWF0_MASK                                  0x1
#define _IOCWF_IOCWF1_POSN                                  0x1
#define _IOCWF_IOCWF1_POSITION                              0x1
#define _IOCWF_IOCWF1_SIZE                                  0x1
#define _IOCWF_IOCWF1_LENGTH                                0x1
#define _IOCWF_IOCWF1_MASK                                  0x2
#define _IOCWF_IOCWF2_POSN                                  0x2
#define _IOCWF_IOCWF2_POSITION                              0x2
#define _IOCWF_IOCWF2_SIZE                                  0x1
#define _IOCWF_IOCWF2_LENGTH                                0x1
#define _IOCWF_IOCWF2_MASK                                  0x4
#define _IOCWF_IOCWF3_POSN                                  0x3
#define _IOCWF_IOCWF3_POSITION                              0x3
#define _IOCWF_IOCWF3_SIZE                                  0x1
#define _IOCWF_IOCWF3_LENGTH                                0x1
#define _IOCWF_IOCWF3_MASK                                  0x8
#define _IOCWF_IOCWF4_POSN                                  0x4
#define _IOCWF_IOCWF4_POSITION                              0x4
#define _IOCWF_IOCWF4_SIZE                                  0x1
#define _IOCWF_IOCWF4_LENGTH                                0x1
#define _IOCWF_IOCWF4_MASK                                  0x10
#define _IOCWF_IOCWF5_POSN                                  0x5
#define _IOCWF_IOCWF5_POSITION                              0x5
#define _IOCWF_IOCWF5_SIZE                                  0x1
#define _IOCWF_IOCWF5_LENGTH                                0x1
#define _IOCWF_IOCWF5_MASK                                  0x20
#define _IOCWF_IOCWF6_POSN                                  0x6
#define _IOCWF_IOCWF6_POSITION                              0x6
#define _IOCWF_IOCWF6_SIZE                                  0x1
#define _IOCWF_IOCWF6_LENGTH                                0x1
#define _IOCWF_IOCWF6_MASK                                  0x40
#define _IOCWF_IOCWF7_POSN                                  0x7
#define _IOCWF_IOCWF7_POSITION                              0x7
#define _IOCWF_IOCWF7_SIZE                                  0x1
#define _IOCWF_IOCWF7_LENGTH                                0x1
#define _IOCWF_IOCWF7_MASK                                  0x80

// Register: IVTLOCK
#define IVTLOCK IVTLOCK
extern volatile unsigned char           IVTLOCK             __at(0x460);
#ifndef _LIB_BUILD
asm("IVTLOCK equ 0460h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTLOCKED              :1;
    };
} IVTLOCKbits_t;
extern volatile IVTLOCKbits_t IVTLOCKbits __at(0x460);
// bitfield macros
#define _IVTLOCK_IVTLOCKED_POSN                             0x0
#define _IVTLOCK_IVTLOCKED_POSITION                         0x0
#define _IVTLOCK_IVTLOCKED_SIZE                             0x1
#define _IVTLOCK_IVTLOCKED_LENGTH                           0x1
#define _IVTLOCK_IVTLOCKED_MASK                             0x1

// Register: INTCON0
#define INTCON0 INTCON0
extern volatile unsigned char           INTCON0             __at(0x461);
#ifndef _LIB_BUILD
asm("INTCON0 equ 0461h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0EDG                :1;
        unsigned INT1EDG                :1;
        unsigned INT2EDG                :1;
        unsigned                        :2;
        unsigned IPEN                   :1;
        unsigned GIEL                   :1;
        unsigned GIE                    :1;
    };
    struct {
        unsigned                        :7;
        unsigned GIEH                   :1;
    };
} INTCON0bits_t;
extern volatile INTCON0bits_t INTCON0bits __at(0x461);
// bitfield macros
#define _INTCON0_INT0EDG_POSN                               0x0
#define _INTCON0_INT0EDG_POSITION                           0x0
#define _INTCON0_INT0EDG_SIZE                               0x1
#define _INTCON0_INT0EDG_LENGTH                             0x1
#define _INTCON0_INT0EDG_MASK                               0x1
#define _INTCON0_INT1EDG_POSN                               0x1
#define _INTCON0_INT1EDG_POSITION                           0x1
#define _INTCON0_INT1EDG_SIZE                               0x1
#define _INTCON0_INT1EDG_LENGTH                             0x1
#define _INTCON0_INT1EDG_MASK                               0x2
#define _INTCON0_INT2EDG_POSN                               0x2
#define _INTCON0_INT2EDG_POSITION                           0x2
#define _INTCON0_INT2EDG_SIZE                               0x1
#define _INTCON0_INT2EDG_LENGTH                             0x1
#define _INTCON0_INT2EDG_MASK                               0x4
#define _INTCON0_IPEN_POSN                                  0x5
#define _INTCON0_IPEN_POSITION                              0x5
#define _INTCON0_IPEN_SIZE                                  0x1
#define _INTCON0_IPEN_LENGTH                                0x1
#define _INTCON0_IPEN_MASK                                  0x20
#define _INTCON0_GIEL_POSN                                  0x6
#define _INTCON0_GIEL_POSITION                              0x6
#define _INTCON0_GIEL_SIZE                                  0x1
#define _INTCON0_GIEL_LENGTH                                0x1
#define _INTCON0_GIEL_MASK                                  0x40
#define _INTCON0_GIE_POSN                                   0x7
#define _INTCON0_GIE_POSITION                               0x7
#define _INTCON0_GIE_SIZE                                   0x1
#define _INTCON0_GIE_LENGTH                                 0x1
#define _INTCON0_GIE_MASK                                   0x80
#define _INTCON0_GIEH_POSN                                  0x7
#define _INTCON0_GIEH_POSITION                              0x7
#define _INTCON0_GIEH_SIZE                                  0x1
#define _INTCON0_GIEH_LENGTH                                0x1
#define _INTCON0_GIEH_MASK                                  0x80

