garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile PIE0bits_t PIE0bits __at(0x473);
// bitfield macros
#define _PIE0_SWIE_POSN                                     0x0
#define _PIE0_SWIE_POSITION                                 0x0
#define _PIE0_SWIE_SIZE                                     0x1
#define _PIE0_SWIE_LENGTH                                   0x1
#define _PIE0_SWIE_MASK                                     0x1
#define _PIE0_INT0IE_POSN                                   0x1
#define _PIE0_INT0IE_POSITION                               0x1
#define _PIE0_INT0IE_SIZE                                   0x1
#define _PIE0_INT0IE_LENGTH                                 0x1
#define _PIE0_INT0IE_MASK                                   0x2
#define _PIE0_INT1IE_POSN                                   0x2
#define _PIE0_INT1IE_POSITION                               0x2
#define _PIE0_INT1IE_SIZE                                   0x1
#define _PIE0_INT1IE_LENGTH                                 0x1
#define _PIE0_INT1IE_MASK                                   0x4
#define _PIE0_INT2IE_POSN                                   0x3
#define _PIE0_INT2IE_POSITION                               0x3
#define _PIE0_INT2IE_SIZE                                   0x1
#define _PIE0_INT2IE_LENGTH                                 0x1
#define _PIE0_INT2IE_MASK                                   0x8
#define _PIE0_DMA1SCNTIE_POSN                               0x4
#define _PIE0_DMA1SCNTIE_POSITION                           0x4
#define _PIE0_DMA1SCNTIE_SIZE                               0x1
#define _PIE0_DMA1SCNTIE_LENGTH                             0x1
#define _PIE0_DMA1SCNTIE_MASK                               0x10
#define _PIE0_DMA1DCNTIE_POSN                               0x5
#define _PIE0_DMA1DCNTIE_POSITION                           0x5
#define _PIE0_DMA1DCNTIE_SIZE                               0x1
#define _PIE0_DMA1DCNTIE_LENGTH                             0x1
#define _PIE0_DMA1DCNTIE_MASK                               0x20
#define _PIE0_DMA1ORIE_POSN                                 0x6
#define _PIE0_DMA1ORIE_POSITION                             0x6
#define _PIE0_DMA1ORIE_SIZE                                 0x1
#define _PIE0_DMA1ORIE_LENGTH                               0x1
#define _PIE0_DMA1ORIE_MASK                                 0x40
#define _PIE0_DMA1AIE_POSN                                  0x7
#define _PIE0_DMA1AIE_POSITION                              0x7
#define _PIE0_DMA1AIE_SIZE                                  0x1
#define _PIE0_DMA1AIE_LENGTH                                0x1
#define _PIE0_DMA1AIE_MASK                                  0x80

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x474);
#ifndef _LIB_BUILD
asm("PIE1 equ 0474h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA2SCNTIE             :1;
        unsigned DMA2DCNTIE             :1;
        unsigned DMA2ORIE               :1;
        unsigned DMA2AIE                :1;
        unsigned DMA3SCNTIE             :1;
        unsigned DMA3DCNTIE             :1;
        unsigned DMA3ORIE               :1;
        unsigned DMA3AIE                :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x474);
// bitfield macros
#define _PIE1_DMA2SCNTIE_POSN                               0x0
#define _PIE1_DMA2SCNTIE_POSITION                           0x0
#define _PIE1_DMA2SCNTIE_SIZE                               0x1
#define _PIE1_DMA2SCNTIE_LENGTH                             0x1
#define _PIE1_DMA2SCNTIE_MASK                               0x1
#define _PIE1_DMA2DCNTIE_POSN                               0x1
#define _PIE1_DMA2DCNTIE_POSITION                           0x1
#define _PIE1_DMA2DCNTIE_SIZE                               0x1
#define _PIE1_DMA2DCNTIE_LENGTH                             0x1
#define _PIE1_DMA2DCNTIE_MASK                               0x2
#define _PIE1_DMA2ORIE_POSN                                 0x2
#define _PIE1_DMA2ORIE_POSITION                             0x2
#define _PIE1_DMA2ORIE_SIZE                                 0x1
#define _PIE1_DMA2ORIE_LENGTH                               0x1
#define _PIE1_DMA2ORIE_MASK                                 0x4
#define _PIE1_DMA2AIE_POSN                                  0x3
#define _PIE1_DMA2AIE_POSITION                              0x3
#define _PIE1_DMA2AIE_SIZE                                  0x1
#define _PIE1_DMA2AIE_LENGTH                                0x1
#define _PIE1_DMA2AIE_MASK                                  0x8
#define _PIE1_DMA3SCNTIE_POSN                               0x4
#define _PIE1_DMA3SCNTIE_POSITION                           0x4
#define _PIE1_DMA3SCNTIE_SIZE                               0x1
#define _PIE1_DMA3SCNTIE_LENGTH                             0x1
#define _PIE1_DMA3SCNTIE_MASK                               0x10
#define _PIE1_DMA3DCNTIE_POSN                               0x5
#define _PIE1_DMA3DCNTIE_POSITION                           0x5
#define _PIE1_DMA3DCNTIE_SIZE                               0x1
#define _PIE1_DMA3DCNTIE_LENGTH                             0x1
#define _PIE1_DMA3DCNTIE_MASK                               0x20
#define _PIE1_DMA3ORIE_POSN                                 0x6
#define _PIE1_DMA3ORIE_POSITION                             0x6
#define _PIE1_DMA3ORIE_SIZE                                 0x1
#define _PIE1_DMA3ORIE_LENGTH                               0x1
#define _PIE1_DMA3ORIE_MASK                                 0x40
#define _PIE1_DMA3AIE_POSN                                  0x7
#define _PIE1_DMA3AIE_POSITION                              0x7
#define _PIE1_DMA3AIE_SIZE                                  0x1
#define _PIE1_DMA3AIE_LENGTH                                0x1
#define _PIE1_DMA3AIE_MASK                                  0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x475);
#ifndef _LIB_BUILD
asm("PIE2 equ 0475h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA4SCNTIE             :1;
        unsigned DMA4DCNTIE             :1;
        unsigned DMA4ORIE               :1;
        unsigned DMA4AIE                :1;
        unsigned NVMIE                  :1;
        unsigned CRCIE                  :1;
        unsigned SCANIE                 :1;
        unsigned ACTIE                  :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x475);
// bitfield macros
#define _PIE2_DMA4SCNTIE_POSN                               0x0
#define _PIE2_DMA4SCNTIE_POSITION                           0x0
#define _PIE2_DMA4SCNTIE_SIZE                               0x1
#define _PIE2_DMA4SCNTIE_LENGTH                             0x1
#define _PIE2_DMA4SCNTIE_MASK                               0x1
#define _PIE2_DMA4DCNTIE_POSN                               0x1
#define _PIE2_DMA4DCNTIE_POSITION                           0x1
#define _PIE2_DMA4DCNTIE_SIZE                               0x1
#define _PIE2_DMA4DCNTIE_LENGTH                             0x1
#define _PIE2_DMA4DCNTIE_MASK                               0x2
#define _PIE2_DMA4ORIE_POSN                                 0x2
#define _PIE2_DMA4ORIE_POSITION                             0x2
#define _PIE2_DMA4ORIE_SIZE                                 0x1
#define _PIE2_DMA4ORIE_LENGTH                               0x1
#define _PIE2_DMA4ORIE_MASK                                 0x4
#define _PIE2_DMA4AIE_POSN                                  0x3
#define _PIE2_DMA4AIE_POSITION                              0x3
#define _PIE2_DMA4AIE_SIZE                                  0x1
#define _PIE2_DMA4AIE_LENGTH                                0x1
#define _PIE2_DMA4AIE_MASK                                  0x8
#define _PIE2_NVMIE_POSN                                    0x4
#define _PIE2_NVMIE_POSITION                                0x4
#define _PIE2_NVMIE_SIZE                                    0x1
#define _PIE2_NVMIE_LENGTH                                  0x1
#define _PIE2_NVMIE_MASK                                    0x10
#define _PIE2_CRCIE_POSN                                    0x5
#define _PIE2_CRCIE_POSITION                                0x5
#define _PIE2_CRCIE_SIZE                                    0x1
#define _PIE2_CRCIE_LENGTH                                  0x1
#define _PIE2_CRCIE_MASK                                    0x20
#define _PIE2_SCANIE_POSN                                   0x6
#define _PIE2_SCANIE_POSITION                               0x6
#define _PIE2_SCANIE_SIZE                                   0x1
#define _PIE2_SCANIE_LENGTH                                 0x1
#define _PIE2_SCANIE_MASK                                   0x40
#define _PIE2_ACTIE_POSN                                    0x7
#define _PIE2_ACTIE_POSITION                                0x7
#define _PIE2_ACTIE_SIZE                                    0x1
#define _PIE2_ACTIE_LENGTH                                  0x1
#define _PIE2_ACTIE_MASK                                    0x80

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x476);
#ifndef _LIB_BUILD
asm("PIE3 equ 0476h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSWIE                  :1;
        unsigned OSFIE                  :1;
        unsigned VDDIO2IE               :1;
        unsigned VDDIO3IE               :1;
        unsigned IOCIE                  :1;
        unsigned TMR0IE                 :1;
        unsigned TMR1IE                 :1;
        unsigned TMR1GIE                :1;
    };
} PIE3bits_t;
extern volatile PIE3bits_t PIE3bits __at(0x476);
// bitfield macros
#define _PIE3_CSWIE_POSN                                    0x0
#define _PIE3_CSWIE_POSITION                                0x0
#define _PIE3_CSWIE_SIZE                                    0x1
#define _PIE3_CSWIE_LENGTH                                  0x1
#define _PIE3_CSWIE_MASK                                    0x1
#define _PIE3_OSFIE_POSN                                    0x1
#define _PIE3_OSFIE_POSITION                                0x1
#define _PIE3_OSFIE_SIZE                                    0x1
#define _PIE3_OSFIE_LENGTH                                  0x1
#define _PIE3_OSFIE_MASK                                    0x2
#define _PIE3_VDDIO2IE_POSN                                 0x2
#define _PIE3_VDDIO2IE_POSITION                             0x2
#define _PIE3_VDDIO2IE_SIZE                                 0x1
#define _PIE3_VDDIO2IE_LENGTH                               0x1
#define _PIE3_VDDIO2IE_MASK                                 0x4
#define _PIE3_VDDIO3IE_POSN                                 0x3
#define _PIE3_VDDIO3IE_POSITION                             0x3
#define _PIE3_VDDIO3IE_SIZE                                 0x1
#define _PIE3_VDDIO3IE_LENGTH                               0x1
#define _PIE3_VDDIO3IE_MASK                                 0x8
#define _PIE3_IOCIE_POSN                                    0x4
#define _PIE3_IOCIE_POSITION                                0x4
#define _PIE3_IOCIE_SIZE                                    0x1
#define _PIE3_IOCIE_LENGTH                                  0x1
#define _PIE3_IOCIE_MASK                                    0x10
#define _PIE3_TMR0IE_POSN                                   0x5
#define _PIE3_TMR0IE_POSITION                               0x5
#define _PIE3_TMR0IE_SIZE                                   0x1
#define _PIE3_TMR0IE_LENGTH                                 0x1
#define _PIE3_TMR0IE_MASK                                   0x20
#define _PIE3_TMR1IE_POSN                                   0x6
#define _PIE3_TMR1IE_POSITION                               0x6
#define _PIE3_TMR1IE_SIZE                                   0x1
#define _PIE3_TMR1IE_LENGTH                                 0x1
#define _PIE3_TMR1IE_MASK                                   0x40
#define _PIE3_TMR1GIE_POSN                                  0x7
#define _PIE3_TMR1GIE_POSITION                              0x7
#define _PIE3_TMR1GIE_SIZE                                  0x1
#define _PIE3_TMR1GIE_LENGTH                                0x1
#define _PIE3_TMR1GIE_MASK                                  0x80

