garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern const _CONFIG3bits_t _CONFIG3bits __at(0x300002);

// Register: CONFIG4
extern const unsigned char              _CONFIG4            __at(0x300003);
// bitfield definitions
typedef union {
    struct {
        unsigned BORV                   :2;
        unsigned                        :1;
        unsigned PPS1WAY                :1;
        unsigned STVREN                 :1;
        unsigned LVP                    :1;
        unsigned _DEBUG                 :1;
        unsigned XINST                  :1;
    };
} _CONFIG4bits_t;
extern const _CONFIG4bits_t _CONFIG4bits __at(0x300003);

// Register: CONFIG5
extern const unsigned char              _CONFIG5            __at(0x300004);
// bitfield definitions
typedef union {
    struct {
        unsigned WDTCPS                 :5;
        unsigned WDTE                   :2;
    };
} _CONFIG5bits_t;
extern const _CONFIG5bits_t _CONFIG5bits __at(0x300004);

// Register: CONFIG6
extern const unsigned char              _CONFIG6            __at(0x300005);
// bitfield definitions
typedef union {
    struct {
        unsigned WDTCWS                 :3;
        unsigned WDTCCS                 :3;
    };
} _CONFIG6bits_t;
extern const _CONFIG6bits_t _CONFIG6bits __at(0x300005);

// Register: CONFIG7
extern const unsigned char              _CONFIG7            __at(0x300006);
// bitfield definitions
typedef union {
    struct {
        unsigned VDDIO2MD               :1;
        unsigned VDDIO3MD               :1;
    };
} _CONFIG7bits_t;
extern const _CONFIG7bits_t _CONFIG7bits __at(0x300006);

// Register: CONFIG8
extern const unsigned char              _CONFIG8            __at(0x300007);
// bitfield definitions
typedef union {
    struct {
        unsigned BBSIZE                 :8;
    };
} _CONFIG8bits_t;
extern const _CONFIG8bits_t _CONFIG8bits __at(0x300007);

// Register: CONFIG10
extern const unsigned char              _CONFIG10           __at(0x300008);
// bitfield definitions
typedef union {
    struct {
        unsigned WRTB                   :1;
        unsigned WRTC                   :1;
        unsigned WRTD                   :1;
        unsigned WRTSAF                 :1;
        unsigned                        :3;
        unsigned WRTAPP                 :1;
    };
} _CONFIG10bits_t;
extern const _CONFIG10bits_t _CONFIG10bits __at(0x300008);

// Register: CONFIG11
extern const unsigned char              _CONFIG11           __at(0x300009);
// bitfield definitions
typedef union {
    struct {
        unsigned CP                     :1;
    };
} _CONFIG11bits_t;
extern const _CONFIG11bits_t _CONFIG11bits __at(0x300009);

// Register: CONFIG12
extern const unsigned char              _CONFIG12           __at(0x30000A);
// bitfield definitions
typedef union {
    struct {
        unsigned CPD                    :1;
    };
} _CONFIG12bits_t;
extern const _CONFIG12bits_t _CONFIG12bits __at(0x30000A);

// Register: CONFIG14
extern const unsigned char              _CONFIG14           __at(0x300018);
// bitfield definitions
typedef union {
    struct {
        unsigned SAFLOCK                :1;
    };
} _CONFIG14bits_t;
extern const _CONFIG14bits_t _CONFIG14bits __at(0x300018);

// Register: CONFIG9
extern const unsigned char              _CONFIG9            __at(0x300019);
// bitfield definitions
typedef union {
    struct {
        unsigned SAFSZ                  :8;
    };
} _CONFIG9bits_t;
extern const _CONFIG9bits_t _CONFIG9bits __at(0x300019);

extern const unsigned short             _IDLOCs[32]         __at(0x200000);
// Register: IDLOC0
extern const unsigned short             _IDLOC0             __at(0x200000);

// Register: IDLOC1
extern const unsigned short             _IDLOC1             __at(0x200002);

// Register: IDLOC2
extern const unsigned short             _IDLOC2             __at(0x200004);

// Register: IDLOC3
extern const unsigned short             _IDLOC3             __at(0x200006);

// Register: IDLOC4
extern const unsigned short             _IDLOC4             __at(0x200008);

// Register: IDLOC5
extern const unsigned short             _IDLOC5             __at(0x20000A);

// Register: IDLOC6
extern const unsigned short             _IDLOC6             __at(0x20000C);

// Register: IDLOC7
extern const unsigned short             _IDLOC7             __at(0x20000E);

// Register: IDLOC8
extern const unsigned short             _IDLOC8             __at(0x200010);

// Register: IDLOC9
extern const unsigned short             _IDLOC9             __at(0x200012);

// Register: IDLOC10
extern const unsigned short             _IDLOC10            __at(0x200014);

// Register: IDLOC11
extern const unsigned short             _IDLOC11            __at(0x200016);

// Register: IDLOC12
extern const unsigned short             _IDLOC12            __at(0x200018);

// Register: IDLOC13
extern const unsigned short             _IDLOC13            __at(0x20001A);

// Register: IDLOC14
extern const unsigned short             _IDLOC14            __at(0x20001C);

// Register: IDLOC15
extern const unsigned short             _IDLOC15            __at(0x20001E);

// Register: IDLOC16
extern const unsigned short             _IDLOC16            __at(0x200020);

// Register: IDLOC17
extern const unsigned short             _IDLOC17            __at(0x200022);

// Register: IDLOC18
extern const unsigned short             _IDLOC18            __at(0x200024);

// Register: IDLOC19
extern const unsigned short             _IDLOC19            __at(0x200026);

// Register: IDLOC20
extern const unsigned short             _IDLOC20            __at(0x200028);

// Register: IDLOC21
extern const unsigned short             _IDLOC21            __at(0x20002A);

// Register: IDLOC22
extern const unsigned short             _IDLOC22            __at(0x20002C);

// Register: IDLOC23
extern const unsigned short             _IDLOC23            __at(0x20002E);

// Register: IDLOC24
extern const unsigned short             _IDLOC24            __at(0x200030);

// Register: IDLOC25
extern const unsigned short             _IDLOC25            __at(0x200032);

