garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
// Register: IDLOC26
extern const unsigned short             _IDLOC26            __at(0x200034);

// Register: IDLOC27
extern const unsigned short             _IDLOC27            __at(0x200036);

// Register: IDLOC28
extern const unsigned short             _IDLOC28            __at(0x200038);

// Register: IDLOC29
extern const unsigned short             _IDLOC29            __at(0x20003A);

// Register: IDLOC30
extern const unsigned short             _IDLOC30            __at(0x20003C);

// Register: IDLOC31
extern const unsigned short             _IDLOC31            __at(0x20003E);

/*
 * Device ID
 */
extern const unsigned short             _DEVID              __at(0x3FFFFE);

/*
 * Revision ID
 */
extern const unsigned short             _REVID              __at(0x3FFFFC);

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// I2C1CON2<ABD>
extern volatile __bit                   ABD                 __at(0xF44);	// @ (0x1E8 * 8 + 4)
#define                                 ABD_bit             _BIT_ACCESS(I2C1CON2,4)
// ADACCL<ACC0>
extern volatile __bit                   ACC0                __at(0x10F8);	// @ (0x21F * 8 + 0)
#define                                 ACC0_bit            _BIT_ACCESS(ADACCL,0)
// ADACCL<ACC1>
extern volatile __bit                   ACC1                __at(0x10F9);	// @ (0x21F * 8 + 1)
#define                                 ACC1_bit            _BIT_ACCESS(ADACCL,1)
// ADACCH<ACC10>
extern volatile __bit                   ACC10               __at(0x1102);	// @ (0x220 * 8 + 2)
#define                                 ACC10_bit           _BIT_ACCESS(ADACCH,2)
// ADACCH<ACC11>
extern volatile __bit                   ACC11               __at(0x1103);	// @ (0x220 * 8 + 3)
#define                                 ACC11_bit           _BIT_ACCESS(ADACCH,3)
// ADACCH<ACC12>
extern volatile __bit                   ACC12               __at(0x1104);	// @ (0x220 * 8 + 4)
#define                                 ACC12_bit           _BIT_ACCESS(ADACCH,4)
// ADACCH<ACC13>
extern volatile __bit                   ACC13               __at(0x1105);	// @ (0x220 * 8 + 5)
#define                                 ACC13_bit           _BIT_ACCESS(ADACCH,5)
// ADACCH<ACC14>
extern volatile __bit                   ACC14               __at(0x1106);	// @ (0x220 * 8 + 6)
#define                                 ACC14_bit           _BIT_ACCESS(ADACCH,6)
// ADACCH<ACC15>
extern volatile __bit                   ACC15               __at(0x1107);	// @ (0x220 * 8 + 7)
#define                                 ACC15_bit           _BIT_ACCESS(ADACCH,7)
// ADACCL<ACC2>
extern volatile __bit                   ACC2                __at(0x10FA);	// @ (0x21F * 8 + 2)
#define                                 ACC2_bit            _BIT_ACCESS(ADACCL,2)
// ADACCL<ACC3>
extern volatile __bit                   ACC3                __at(0x10FB);	// @ (0x21F * 8 + 3)
#define                                 ACC3_bit            _BIT_ACCESS(ADACCL,3)
// ADACCL<ACC4>
extern volatile __bit                   ACC4                __at(0x10FC);	// @ (0x21F * 8 + 4)
#define                                 ACC4_bit            _BIT_ACCESS(ADACCL,4)
// ADACCL<ACC5>
extern volatile __bit                   ACC5                __at(0x10FD);	// @ (0x21F * 8 + 5)
#define                                 ACC5_bit            _BIT_ACCESS(ADACCL,5)
// ADACCL<ACC6>
extern volatile __bit                   ACC6                __at(0x10FE);	// @ (0x21F * 8 + 6)
#define                                 ACC6_bit            _BIT_ACCESS(ADACCL,6)
// ADACCL<ACC7>
extern volatile __bit                   ACC7                __at(0x10FF);	// @ (0x21F * 8 + 7)
#define                                 ACC7_bit            _BIT_ACCESS(ADACCL,7)
// ADACCH<ACC8>
extern volatile __bit                   ACC8                __at(0x1100);	// @ (0x220 * 8 + 0)
#define                                 ACC8_bit            _BIT_ACCESS(ADACCH,0)
// ADACCH<ACC9>
extern volatile __bit                   ACC9                __at(0x1101);	// @ (0x220 * 8 + 1)
#define                                 ACC9_bit            _BIT_ACCESS(ADACCH,1)
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x344);	// @ (0x68 * 8 + 4)
#define                                 ACCM_bit            _BIT_ACCESS(CRCCON0,4)
// CRCCON0<ACCMOD>
extern volatile __bit                   ACCMOD              __at(0x344);	// @ (0x68 * 8 + 4)
#define                                 ACCMOD_bit          _BIT_ACCESS(CRCCON0,4)
// I2C1CON1<ACKCNT>
extern volatile __bit                   ACKCNT              __at(0xF3F);	// @ (0x1E7 * 8 + 7)
#define                                 ACKCNT_bit          _BIT_ACCESS(I2C1CON1,7)
// I2C1CON1<ACKDT>
extern volatile __bit                   ACKDT               __at(0xF3E);	// @ (0x1E7 * 8 + 6)
#define                                 ACKDT_bit           _BIT_ACCESS(I2C1CON1,6)
// I2C1CON1<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0xF3D);	// @ (0x1E7 * 8 + 5)
#define                                 ACKSTAT_bit         _BIT_ACCESS(I2C1CON1,5)
// I2C1CON1<ACKT>
extern volatile __bit                   ACKT                __at(0xF3C);	// @ (0x1E7 * 8 + 4)
#define                                 ACKT_bit            _BIT_ACCESS(I2C1CON1,4)
// I2C1PIE<ACKT1IE>
extern volatile __bit                   ACKT1IE             __at(0xF5E);	// @ (0x1EB * 8 + 6)
#define                                 ACKT1IE_bit         _BIT_ACCESS(I2C1PIE,6)
// I2C1PIR<ACKT1IF>
extern volatile __bit                   ACKT1IF             __at(0xF56);	// @ (0x1EA * 8 + 6)
#define                                 ACKT1IF_bit         _BIT_ACCESS(I2C1PIR,6)
// I2C1PIE<ACKTIE>
extern volatile __bit                   ACKTIE              __at(0xF5E);	// @ (0x1EB * 8 + 6)
#define                                 ACKTIE_bit          _BIT_ACCESS(I2C1PIE,6)
// I2C1PIR<ACKTIF>
extern volatile __bit                   ACKTIF              __at(0xF56);	// @ (0x1EA * 8 + 6)
#define                                 ACKTIF_bit          _BIT_ACCESS(I2C1PIR,6)
// ADCON2<ACLR>
extern volatile __bit                   ACLR                __at(0x118B);	// @ (0x231 * 8 + 3)
#define                                 ACLR_bit            _BIT_ACCESS(ADCON2,3)
// I2C1CON2<ACNT>
extern volatile __bit                   ACNT                __at(0xF47);	// @ (0x1E8 * 8 + 7)
#define                                 ACNT_bit            _BIT_ACCESS(I2C1CON2,7)
// I2C1CON3<ACNTMD0>
extern volatile __bit                   ACNTMD0             __at(0xF48);	// @ (0x1E9 * 8 + 0)
#define                                 ACNTMD0_bit         _BIT_ACCESS(I2C1CON3,0)
// I2C1CON3<ACNTMD1>
extern volatile __bit                   ACNTMD1             __at(0xF49);	// @ (0x1E9 * 8 + 1)
#define                                 ACNTMD1_bit         _BIT_ACCESS(I2C1CON3,1)
// ADACQL<ACQ0>
extern volatile __bit                   ACQ0                __at(0x1150);	// @ (0x22A * 8 + 0)
#define                                 ACQ0_bit            _BIT_ACCESS(ADACQL,0)
// ADACQL<ACQ1>
extern volatile __bit                   ACQ1                __at(0x1151);	// @ (0x22A * 8 + 1)
#define                                 ACQ1_bit            _BIT_ACCESS(ADACQL,1)
// ADACQH<ACQ10>
extern volatile __bit                   ACQ10               __at(0x115A);	// @ (0x22B * 8 + 2)
#define                                 ACQ10_bit           _BIT_ACCESS(ADACQH,2)
// ADACQH<ACQ11>
extern volatile __bit                   ACQ11               __at(0x115B);	// @ (0x22B * 8 + 3)
#define                                 ACQ11_bit           _BIT_ACCESS(ADACQH,3)
// ADACQH<ACQ12>
extern volatile __bit                   ACQ12               __at(0x115C);	// @ (0x22B * 8 + 4)
#define                                 ACQ12_bit           _BIT_ACCESS(ADACQH,4)
// ADACQL<ACQ2>
extern volatile __bit                   ACQ2                __at(0x1152);	// @ (0x22A * 8 + 2)
#define                                 ACQ2_bit            _BIT_ACCESS(ADACQL,2)
// ADACQL<ACQ3>
extern volatile __bit                   ACQ3                __at(0x1153);	// @ (0x22A * 8 + 3)
#define                                 ACQ3_bit            _BIT_ACCESS(ADACQL,3)
// ADACQL<ACQ4>
extern volatile __bit                   ACQ4                __at(0x1154);	// @ (0x22A * 8 + 4)
#define                                 ACQ4_bit            _BIT_ACCESS(ADACQL,4)
// ADACQL<ACQ5>
extern volatile __bit                   ACQ5                __at(0x1155);	// @ (0x22A * 8 + 5)
#define                                 ACQ5_bit            _BIT_ACCESS(ADACQL,5)
// ADACQL<ACQ6>
extern volatile __bit                   ACQ6                __at(0x1156);	// @ (0x22A * 8 + 6)
#define                                 ACQ6_bit            _BIT_ACCESS(ADACQL,6)
// ADACQL<ACQ7>
extern volatile __bit                   ACQ7                __at(0x1157);	// @ (0x22A * 8 + 7)
#define                                 ACQ7_bit            _BIT_ACCESS(ADACQL,7)
// ADACQH<ACQ8>
extern volatile __bit                   ACQ8                __at(0x1158);	// @ (0x22B * 8 + 0)
#define                                 ACQ8_bit            _BIT_ACCESS(ADACQH,0)
// ADACQH<ACQ9>
extern volatile __bit                   ACQ9                __at(0x1159);	// @ (0x22B * 8 + 1)
#define                                 ACQ9_bit            _BIT_ACCESS(ADACQH,1)
// ADACT<ACT0>
extern volatile __bit                   ACT0                __at(0x11A8);	// @ (0x235 * 8 + 0)
#define                                 ACT0_bit            _BIT_ACCESS(ADACT,0)
// ADACT<ACT1>
extern volatile __bit                   ACT1                __at(0x11A9);	// @ (0x235 * 8 + 1)
#define                                 ACT1_bit            _BIT_ACCESS(ADACT,1)
// ADACT<ACT2>
extern volatile __bit                   ACT2                __at(0x11AA);	// @ (0x235 * 8 + 2)
#define                                 ACT2_bit            _BIT_ACCESS(ADACT,2)
// ADACT<ACT3>
extern volatile __bit                   ACT3                __at(0x11AB);	// @ (0x235 * 8 + 3)
#define                                 ACT3_bit            _BIT_ACCESS(ADACT,3)
// ADACT<ACT4>
extern volatile __bit                   ACT4                __at(0x11AC);	// @ (0x235 * 8 + 4)
#define                                 ACT4_bit            _BIT_ACCESS(ADACT,4)
// ADACT<ACT5>
extern volatile __bit                   ACT5                __at(0x11AD);	// @ (0x235 * 8 + 5)
#define                                 ACT5_bit            _BIT_ACCESS(ADACT,5)
// ACTCON<ACTEN>
extern volatile __bit                   ACTEN               __at(0x40F);	// @ (0x81 * 8 + 7)
#define                                 ACTEN_bit           _BIT_ACCESS(ACTCON,7)
// PIE2<ACTIE>
extern volatile __bit                   ACTIE               __at(0x23AF);	// @ (0x475 * 8 + 7)
#define                                 ACTIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<ACTIF>
extern volatile __bit                   ACTIF               __at(0x235F);	// @ (0x46B * 8 + 7)
#define                                 ACTIF_bit           _BIT_ACCESS(PIR2,7)
// IPR2<ACTIP>
extern volatile __bit                   ACTIP               __at(0x23FF);	// @ (0x47F * 8 + 7)
#define                                 ACTIP_bit           _BIT_ACCESS(IPR2,7)
// ACTCON<ACTLOCK>
extern volatile __bit                   ACTLOCK             __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 ACTLOCK_bit         _BIT_ACCESS(ACTCON,3)
// PMD1<ACTMD>
extern volatile __bit                   ACTMD               __at(0x1808);	// @ (0x301 * 8 + 0)
#define                                 ACTMD_bit           _BIT_ACCESS(PMD1,0)
// ACTCON<ACTORS>
extern volatile __bit                   ACTORS              __at(0x409);	// @ (0x81 * 8 + 1)
#define                                 ACTORS_bit          _BIT_ACCESS(ACTCON,1)
// ACTCON<ACTUD>
extern volatile __bit                   ACTUD               __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 ACTUD_bit           _BIT_ACCESS(ACTCON,6)
// ADACCL<ADACC0>
extern volatile __bit                   ADACC0              __at(0x10F8);	// @ (0x21F * 8 + 0)
#define                                 ADACC0_bit          _BIT_ACCESS(ADACCL,0)
// ADACCL<ADACC1>
extern volatile __bit                   ADACC1              __at(0x10F9);	// @ (0x21F * 8 + 1)
#define                                 ADACC1_bit          _BIT_ACCESS(ADACCL,1)
// ADACCH<ADACC10>
extern volatile __bit                   ADACC10             __at(0x1102);	// @ (0x220 * 8 + 2)
#define                                 ADACC10_bit         _BIT_ACCESS(ADACCH,2)
// ADACCH<ADACC11>
extern volatile __bit                   ADACC11             __at(0x1103);	// @ (0x220 * 8 + 3)
#define                                 ADACC11_bit         _BIT_ACCESS(ADACCH,3)
// ADACCH<ADACC12>
extern volatile __bit                   ADACC12             __at(0x1104);	// @ (0x220 * 8 + 4)
#define                                 ADACC12_bit         _BIT_ACCESS(ADACCH,4)
// ADACCH<ADACC13>
extern volatile __bit                   ADACC13             __at(0x1105);	// @ (0x220 * 8 + 5)
#define                                 ADACC13_bit         _BIT_ACCESS(ADACCH,5)
// ADACCH<ADACC14>
extern volatile __bit                   ADACC14             __at(0x1106);	// @ (0x220 * 8 + 6)
#define                                 ADACC14_bit         _BIT_ACCESS(ADACCH,6)
// ADACCH<ADACC15>
extern volatile __bit                   ADACC15             __at(0x1107);	// @ (0x220 * 8 + 7)
#define                                 ADACC15_bit         _BIT_ACCESS(ADACCH,7)
// ADACCL<ADACC2>
extern volatile __bit                   ADACC2              __at(0x10FA);	// @ (0x21F * 8 + 2)
#define                                 ADACC2_bit          _BIT_ACCESS(ADACCL,2)
// ADACCL<ADACC3>
extern volatile __bit                   ADACC3              __at(0x10FB);	// @ (0x21F * 8 + 3)
#define                                 ADACC3_bit          _BIT_ACCESS(ADACCL,3)
// ADACCL<ADACC4>
extern volatile __bit                   ADACC4              __at(0x10FC);	// @ (0x21F * 8 + 4)
#define                                 ADACC4_bit          _BIT_ACCESS(ADACCL,4)
// ADACCL<ADACC5>
extern volatile __bit                   ADACC5              __at(0x10FD);	// @ (0x21F * 8 + 5)
#define                                 ADACC5_bit          _BIT_ACCESS(ADACCL,5)
// ADACCL<ADACC6>
extern volatile __bit                   ADACC6              __at(0x10FE);	// @ (0x21F * 8 + 6)
#define                                 ADACC6_bit          _BIT_ACCESS(ADACCL,6)
// ADACCL<ADACC7>
extern volatile __bit                   ADACC7              __at(0x10FF);	// @ (0x21F * 8 + 7)
#define                                 ADACC7_bit          _BIT_ACCESS(ADACCL,7)
// ADACCH<ADACC8>
extern volatile __bit                   ADACC8              __at(0x1100);	// @ (0x220 * 8 + 0)
#define                                 ADACC8_bit          _BIT_ACCESS(ADACCH,0)
// ADACCH<ADACC9>
extern volatile __bit                   ADACC9              __at(0x1101);	// @ (0x220 * 8 + 1)
#define                                 ADACC9_bit          _BIT_ACCESS(ADACCH,1)
// ADCON2<ADACLR>
extern volatile __bit                   ADACLR              __at(0x118B);	// @ (0x231 * 8 + 3)
#define                                 ADACLR_bit          _BIT_ACCESS(ADCON2,3)
// ADACQL<ADACQ0>
extern volatile __bit                   ADACQ0              __at(0x1150);	// @ (0x22A * 8 + 0)
#define                                 ADACQ0_bit          _BIT_ACCESS(ADACQL,0)
// ADACQL<ADACQ1>
extern volatile __bit                   ADACQ1              __at(0x1151);	// @ (0x22A * 8 + 1)
#define                                 ADACQ1_bit          _BIT_ACCESS(ADACQL,1)
// ADACQH<ADACQ10>
extern volatile __bit                   ADACQ10             __at(0x115A);	// @ (0x22B * 8 + 2)
#define                                 ADACQ10_bit         _BIT_ACCESS(ADACQH,2)
// ADACQH<ADACQ11>
extern volatile __bit                   ADACQ11             __at(0x115B);	// @ (0x22B * 8 + 3)
#define                                 ADACQ11_bit         _BIT_ACCESS(ADACQH,3)
// ADACQH<ADACQ12>
extern volatile __bit                   ADACQ12             __at(0x115C);	// @ (0x22B * 8 + 4)
#define                                 ADACQ12_bit         _BIT_ACCESS(ADACQH,4)
// ADACQL<ADACQ2>
extern volatile __bit                   ADACQ2              __at(0x1152);	// @ (0x22A * 8 + 2)
#define                                 ADACQ2_bit          _BIT_ACCESS(ADACQL,2)
// ADACQL<ADACQ3>
extern volatile __bit                   ADACQ3              __at(0x1153);	// @ (0x22A * 8 + 3)
#define                                 ADACQ3_bit          _BIT_ACCESS(ADACQL,3)
// ADACQL<ADACQ4>
extern volatile __bit                   ADACQ4              __at(0x1154);	// @ (0x22A * 8 + 4)
#define                                 ADACQ4_bit          _BIT_ACCESS(ADACQL,4)
// ADACQL<ADACQ5>
extern volatile __bit                   ADACQ5              __at(0x1155);	// @ (0x22A * 8 + 5)
#define                                 ADACQ5_bit          _BIT_ACCESS(ADACQL,5)
// ADACQL<ADACQ6>
extern volatile __bit                   ADACQ6              __at(0x1156);	// @ (0x22A * 8 + 6)
#define                                 ADACQ6_bit          _BIT_ACCESS(ADACQL,6)
// ADACQL<ADACQ7>
extern volatile __bit                   ADACQ7              __at(0x1157);	// @ (0x22A * 8 + 7)
#define                                 ADACQ7_bit          _BIT_ACCESS(ADACQL,7)
// ADACQH<ADACQ8>
extern volatile __bit                   ADACQ8              __at(0x1158);	// @ (0x22B * 8 + 0)
#define                                 ADACQ8_bit          _BIT_ACCESS(ADACQH,0)
// ADACQH<ADACQ9>
extern volatile __bit                   ADACQ9              __at(0x1159);	// @ (0x22B * 8 + 1)
#define                                 ADACQ9_bit          _BIT_ACCESS(ADACQH,1)
// ADACT<ADACT0>
extern volatile __bit                   ADACT0              __at(0x11A8);	// @ (0x235 * 8 + 0)
#define                                 ADACT0_bit          _BIT_ACCESS(ADACT,0)
// ADACT<ADACT1>
extern volatile __bit                   ADACT1              __at(0x11A9);	// @ (0x235 * 8 + 1)
#define                                 ADACT1_bit          _BIT_ACCESS(ADACT,1)
// ADACT<ADACT2>
extern volatile __bit                   ADACT2              __at(0x11AA);	// @ (0x235 * 8 + 2)
#define                                 ADACT2_bit          _BIT_ACCESS(ADACT,2)
// ADACT<ADACT3>
extern volatile __bit                   ADACT3              __at(0x11AB);	// @ (0x235 * 8 + 3)
#define                                 ADACT3_bit          _BIT_ACCESS(ADACT,3)
// ADACT<ADACT4>
extern volatile __bit                   ADACT4              __at(0x11AC);	// @ (0x235 * 8 + 4)
#define                                 ADACT4_bit          _BIT_ACCESS(ADACT,4)
// ADACT<ADACT5>
extern volatile __bit                   ADACT5              __at(0x11AD);	// @ (0x235 * 8 + 5)
#define                                 ADACT5_bit          _BIT_ACCESS(ADACT,5)
// ADACTPPS<ADACTPPS0>
extern volatile __bit                   ADACTPPS0           __at(0x1D88);	// @ (0x3B1 * 8 + 0)
#define                                 ADACTPPS0_bit       _BIT_ACCESS(ADACTPPS,0)
// ADACTPPS<ADACTPPS1>
extern volatile __bit                   ADACTPPS1           __at(0x1D89);	// @ (0x3B1 * 8 + 1)
#define                                 ADACTPPS1_bit       _BIT_ACCESS(ADACTPPS,1)
// ADACTPPS<ADACTPPS2>
extern volatile __bit                   ADACTPPS2           __at(0x1D8A);	// @ (0x3B1 * 8 + 2)
#define                                 ADACTPPS2_bit       _BIT_ACCESS(ADACTPPS,2)
// ADACTPPS<ADACTPPS3>
extern volatile __bit                   ADACTPPS3           __at(0x1D8B);	// @ (0x3B1 * 8 + 3)
#define                                 ADACTPPS3_bit       _BIT_ACCESS(ADACTPPS,3)
// ADACTPPS<ADACTPPS4>
extern volatile __bit                   ADACTPPS4           __at(0x1D8C);	// @ (0x3B1 * 8 + 4)
#define                                 ADACTPPS4_bit       _BIT_ACCESS(ADACTPPS,4)
// ADSTAT<ADAOV>
extern volatile __bit                   ADAOV               __at(0x119F);	// @ (0x233 * 8 + 7)
#define                                 ADAOV_bit           _BIT_ACCESS(ADSTAT,7)
// ADCON3<ADCALC0>
extern volatile __bit                   ADCALC0             __at(0x1194);	// @ (0x232 * 8 + 4)
#define                                 ADCALC0_bit         _BIT_ACCESS(ADCON3,4)
// ADCON3<ADCALC1>
extern volatile __bit                   ADCALC1             __at(0x1195);	// @ (0x232 * 8 + 5)
#define                                 ADCALC1_bit         _BIT_ACCESS(ADCON3,5)
// ADCON3<ADCALC2>
extern volatile __bit                   ADCALC2             __at(0x1196);	// @ (0x232 * 8 + 6)
#define                                 ADCALC2_bit         _BIT_ACCESS(ADCON3,6)
// ADCAP<ADCAP0>
extern volatile __bit                   ADCAP0              __at(0x1160);	// @ (0x22C * 8 + 0)
#define                                 ADCAP0_bit          _BIT_ACCESS(ADCAP,0)
// ADCAP<ADCAP1>
extern volatile __bit                   ADCAP1              __at(0x1161);	// @ (0x22C * 8 + 1)
#define                                 ADCAP1_bit          _BIT_ACCESS(ADCAP,1)
// ADCAP<ADCAP2>
extern volatile __bit                   ADCAP2              __at(0x1162);	// @ (0x22C * 8 + 2)
#define                                 ADCAP2_bit          _BIT_ACCESS(ADCAP,2)
// ADCAP<ADCAP3>
extern volatile __bit                   ADCAP3              __at(0x1163);	// @ (0x22C * 8 + 3)
#define                                 ADCAP3_bit          _BIT_ACCESS(ADCAP,3)
// ADCAP<ADCAP4>
extern volatile __bit                   ADCAP4              __at(0x1164);	// @ (0x22C * 8 + 4)
#define                                 ADCAP4_bit          _BIT_ACCESS(ADCAP,4)
// PMD4<ADCMD>
extern volatile __bit                   ADCMD               __at(0x1823);	// @ (0x304 * 8 + 3)
#define                                 ADCMD_bit           _BIT_ACCESS(PMD4,3)
// ADCNT<ADCNT0>
extern volatile __bit                   ADCNT0              __at(0x1110);	// @ (0x222 * 8 + 0)
#define                                 ADCNT0_bit          _BIT_ACCESS(ADCNT,0)
// ADCNT<ADCNT1>
extern volatile __bit                   ADCNT1              __at(0x1111);	// @ (0x222 * 8 + 1)
#define                                 ADCNT1_bit          _BIT_ACCESS(ADCNT,1)
// ADCNT<ADCNT2>
extern volatile __bit                   ADCNT2              __at(0x1112);	// @ (0x222 * 8 + 2)
#define                                 ADCNT2_bit          _BIT_ACCESS(ADCNT,2)
// ADCNT<ADCNT3>
extern volatile __bit                   ADCNT3              __at(0x1113);	// @ (0x222 * 8 + 3)
#define                                 ADCNT3_bit          _BIT_ACCESS(ADCNT,3)
// ADCNT<ADCNT4>
extern volatile __bit                   ADCNT4              __at(0x1114);	// @ (0x222 * 8 + 4)
#define                                 ADCNT4_bit          _BIT_ACCESS(ADCNT,4)
// ADCNT<ADCNT5>
extern volatile __bit                   ADCNT5              __at(0x1115);	// @ (0x222 * 8 + 5)
#define                                 ADCNT5_bit          _BIT_ACCESS(ADCNT,5)
// ADCNT<ADCNT6>
extern volatile __bit                   ADCNT6              __at(0x1116);	// @ (0x222 * 8 + 6)
#define                                 ADCNT6_bit          _BIT_ACCESS(ADCNT,6)
// ADCNT<ADCNT7>
extern volatile __bit                   ADCNT7              __at(0x1117);	// @ (0x222 * 8 + 7)
#define                                 ADCNT7_bit          _BIT_ACCESS(ADCNT,7)
// ADCON0<ADCONT>
extern volatile __bit                   ADCONT              __at(0x117E);	// @ (0x22F * 8 + 6)
#define                                 ADCONT_bit          _BIT_ACCESS(ADCON0,6)
// ADCON2<ADCRS0>
