garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile __bit                   BTOC2               __at(0xFD2);	// @ (0x1FA * 8 + 2)
#define                                 BTOC2_bit           _BIT_ACCESS(I2C1BTOC,2)
// DMAnBUF<BUF0>
extern volatile __bit                   BUF0                __at(0x208);	// @ (0x41 * 8 + 0)
#define                                 BUF0_bit            _BIT_ACCESS(DMAnBUF,0)
// DMAnBUF<BUF1>
extern volatile __bit                   BUF1                __at(0x209);	// @ (0x41 * 8 + 1)
#define                                 BUF1_bit            _BIT_ACCESS(DMAnBUF,1)
// DMAnBUF<BUF2>
extern volatile __bit                   BUF2                __at(0x20A);	// @ (0x41 * 8 + 2)
#define                                 BUF2_bit            _BIT_ACCESS(DMAnBUF,2)
// DMAnBUF<BUF3>
extern volatile __bit                   BUF3                __at(0x20B);	// @ (0x41 * 8 + 3)
#define                                 BUF3_bit            _BIT_ACCESS(DMAnBUF,3)
// DMAnBUF<BUF4>
extern volatile __bit                   BUF4                __at(0x20C);	// @ (0x41 * 8 + 4)
#define                                 BUF4_bit            _BIT_ACCESS(DMAnBUF,4)
// DMAnBUF<BUF5>
extern volatile __bit                   BUF5                __at(0x20D);	// @ (0x41 * 8 + 5)
#define                                 BUF5_bit            _BIT_ACCESS(DMAnBUF,5)
// DMAnBUF<BUF6>
extern volatile __bit                   BUF6                __at(0x20E);	// @ (0x41 * 8 + 6)
#define                                 BUF6_bit            _BIT_ACCESS(DMAnBUF,6)
// DMAnBUF<BUF7>
extern volatile __bit                   BUF7                __at(0x20F);	// @ (0x41 * 8 + 7)
#define                                 BUF7_bit            _BIT_ACCESS(DMAnBUF,7)
// SCANCON0<BURSTMD>
extern volatile __bit                   BURSTMD             __at(0x389);	// @ (0x71 * 8 + 1)
#define                                 BURSTMD_bit         _BIT_ACCESS(SCANCON0,1)
// U1CON2<C0EN>
extern volatile __bit                   C0EN                __at(0xDDB);	// @ (0x1BB * 8 + 3)
#define                                 C0EN_bit            _BIT_ACCESS(U1CON2,3)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0xA40);	// @ (0x148 * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0xA41);	// @ (0x148 * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CCPTMRS0<C2TSEL2>
extern volatile __bit                   C2TSEL2             __at(0xA42);	// @ (0x148 * 8 + 2)
#define                                 C2TSEL2_bit         _BIT_ACCESS(CCPTMRS0,2)
// CCPTMRS0<C2TSEL3>
extern volatile __bit                   C2TSEL3             __at(0xA43);	// @ (0x148 * 8 + 3)
#define                                 C2TSEL3_bit         _BIT_ACCESS(CCPTMRS0,3)
// ADCON3<CALC0>
extern volatile __bit                   CALC0               __at(0x1194);	// @ (0x232 * 8 + 4)
#define                                 CALC0_bit           _BIT_ACCESS(ADCON3,4)
// ADCON3<CALC1>
extern volatile __bit                   CALC1               __at(0x1195);	// @ (0x232 * 8 + 5)
#define                                 CALC1_bit           _BIT_ACCESS(ADCON3,5)
// ADCON3<CALC2>
extern volatile __bit                   CALC2               __at(0x1196);	// @ (0x232 * 8 + 6)
#define                                 CALC2_bit           _BIT_ACCESS(ADCON3,6)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0xA60);	// @ (0x14C * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0xA61);	// @ (0x14C * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0xA62);	// @ (0x14C * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0xA5F);	// @ (0x14B * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0xA5C);	// @ (0x14B * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE4<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x23BC);	// @ (0x477 * 8 + 4)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x236C);	// @ (0x46D * 8 + 4)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x240C);	// @ (0x481 * 8 + 4)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR4,4)
// PMD2<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x1812);	// @ (0x302 * 8 + 2)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD2,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0xA58);	// @ (0x14B * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0xA59);	// @ (0x14B * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0xA5A);	// @ (0x14B * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0xA5B);	// @ (0x14B * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0xA5D);	// @ (0x14B * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x1B48);	// @ (0x369 * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x1B49);	// @ (0x369 * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x1B4A);	// @ (0x369 * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x1B4B);	// @ (0x369 * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x1B4C);	// @ (0x369 * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0xA80);	// @ (0x150 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0xA81);	// @ (0x150 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0xA82);	// @ (0x150 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0xA7F);	// @ (0x14F * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0xA7C);	// @ (0x14F * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE4<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x23BD);	// @ (0x477 * 8 + 5)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x236D);	// @ (0x46D * 8 + 5)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR4,5)
// IPR4<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x240D);	// @ (0x481 * 8 + 5)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR4,5)
// PMD2<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x1813);	// @ (0x302 * 8 + 3)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD2,3)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0xA78);	// @ (0x14F * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0xA79);	// @ (0x14F * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0xA7A);	// @ (0x14F * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0xA7B);	// @ (0x14F * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0xA7D);	// @ (0x14F * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0x1B50);	// @ (0x36A * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0x1B51);	// @ (0x36A * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0x1B52);	// @ (0x36A * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0x1B53);	// @ (0x36A * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0x1B54);	// @ (0x36A * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x3D8);	// @ (0x7B * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x3D9);	// @ (0x7B * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x3DA);	// @ (0x7B * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x3DB);	// @ (0x7B * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// U1ERRIE<CERIE>
extern volatile __bit                   CERIE               __at(0xE14);	// @ (0x1C2 * 8 + 4)
#define                                 CERIE_bit           _BIT_ACCESS(U1ERRIE,4)
// U1ERRIR<CERIF>
extern volatile __bit                   CERIF               __at(0xE0C);	// @ (0x1C1 * 8 + 4)
#define                                 CERIF_bit           _BIT_ACCESS(U1ERRIR,4)
// ADCG1A<CGA0>
extern volatile __bit                   CGA0                __at(0x11B8);	// @ (0x237 * 8 + 0)
#define                                 CGA0_bit            _BIT_ACCESS(ADCG1A,0)
// ADCG1A<CGA1>
extern volatile __bit                   CGA1                __at(0x11B9);	// @ (0x237 * 8 + 1)
#define                                 CGA1_bit            _BIT_ACCESS(ADCG1A,1)
// ADCG1A<CGA2>
extern volatile __bit                   CGA2                __at(0x11BA);	// @ (0x237 * 8 + 2)
#define                                 CGA2_bit            _BIT_ACCESS(ADCG1A,2)
// ADCG1A<CGA4>
extern volatile __bit                   CGA4                __at(0x11BC);	// @ (0x237 * 8 + 4)
#define                                 CGA4_bit            _BIT_ACCESS(ADCG1A,4)
// ADCG1A<CGA5>
extern volatile __bit                   CGA5                __at(0x11BD);	// @ (0x237 * 8 + 5)
#define                                 CGA5_bit            _BIT_ACCESS(ADCG1A,5)
// ADCG1B<CGB5>
extern volatile __bit                   CGB5                __at(0x11C5);	// @ (0x238 * 8 + 5)
#define                                 CGB5_bit            _BIT_ACCESS(ADCG1B,5)
// ADCG1B<CGB6>
extern volatile __bit                   CGB6                __at(0x11C6);	// @ (0x238 * 8 + 6)
#define                                 CGB6_bit            _BIT_ACCESS(ADCG1B,6)
// ADCG1B<CGB7>
extern volatile __bit                   CGB7                __at(0x11C7);	// @ (0x238 * 8 + 7)
#define                                 CGB7_bit            _BIT_ACCESS(ADCG1B,7)
// ADCG1C<CGC0>
extern volatile __bit                   CGC0                __at(0x11C8);	// @ (0x239 * 8 + 0)
#define                                 CGC0_bit            _BIT_ACCESS(ADCG1C,0)
// ADCG1C<CGC1>
extern volatile __bit                   CGC1                __at(0x11C9);	// @ (0x239 * 8 + 1)
#define                                 CGC1_bit            _BIT_ACCESS(ADCG1C,1)
// ADCG1C<CGC3>
extern volatile __bit                   CGC3                __at(0x11CB);	// @ (0x239 * 8 + 3)
#define                                 CGC3_bit            _BIT_ACCESS(ADCG1C,3)
// ADCG1C<CGC4>
extern volatile __bit                   CGC4                __at(0x11CC);	// @ (0x239 * 8 + 4)
#define                                 CGC4_bit            _BIT_ACCESS(ADCG1C,4)
// ADCG1C<CGC5>
extern volatile __bit                   CGC5                __at(0x11CD);	// @ (0x239 * 8 + 5)
#define                                 CGC5_bit            _BIT_ACCESS(ADCG1C,5)
// ADCG1C<CGC6>
extern volatile __bit                   CGC6                __at(0x11CE);	// @ (0x239 * 8 + 6)
#define                                 CGC6_bit            _BIT_ACCESS(ADCG1C,6)
// ADCG1C<CGC7>
extern volatile __bit                   CGC7                __at(0x11CF);	// @ (0x239 * 8 + 7)
#define                                 CGC7_bit            _BIT_ACCESS(ADCG1C,7)
// TUCHAIN<CH16AB>
extern volatile __bit                   CH16AB              __at(0x958);	// @ (0x12B * 8 + 0)
#define                                 CH16AB_bit          _BIT_ACCESS(TUCHAIN,0)
// SPI1CON1<CKE>
extern volatile __bit                   CKE                 __at(0xEE6);	// @ (0x1DC * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SPI1CON1,6)
// SPI1CON1<CKP>
extern volatile __bit                   CKP                 __at(0xEE5);	// @ (0x1DC * 8 + 5)
#define                                 CKP_bit             _BIT_ACCESS(SPI1CON1,5)
// T0CON1<CKPS3>
extern volatile __bit                   CKPS3               __at(0x833);	// @ (0x106 * 8 + 3)
#define                                 CKPS3_bit           _BIT_ACCESS(T0CON1,3)
// PIE5<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x23C3);	// @ (0x478 * 8 + 3)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE5,3)
// PIR5<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x2373);	// @ (0x46E * 8 + 3)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR5,3)
// IPR5<CLC1IP>
extern volatile __bit                   CLC1IP              __at(0x2413);	// @ (0x482 * 8 + 3)
#define                                 CLC1IP_bit          _BIT_ACCESS(IPR5,3)
// PMD2<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x1817);	// @ (0x302 * 8 + 7)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD2,7)
// CLCDATA<CLC1OUT>
extern volatile __bit                   CLC1OUT             __at(0xD18);	// @ (0x1A3 * 8 + 0)
#define                                 CLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// PIE5<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x23C4);	// @ (0x478 * 8 + 4)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x2374);	// @ (0x46E * 8 + 4)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR5,4)
// IPR5<CLC2IP>
extern volatile __bit                   CLC2IP              __at(0x2414);	// @ (0x482 * 8 + 4)
#define                                 CLC2IP_bit          _BIT_ACCESS(IPR5,4)
// PMD3<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x1818);	// @ (0x303 * 8 + 0)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD3,0)
// CLCDATA<CLC2OUT>
extern volatile __bit                   CLC2OUT             __at(0xD19);	// @ (0x1A3 * 8 + 1)
#define                                 CLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// PIE5<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x23C5);	// @ (0x478 * 8 + 5)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x2375);	// @ (0x46E * 8 + 5)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR5,5)
// IPR5<CLC3IP>
extern volatile __bit                   CLC3IP              __at(0x2415);	// @ (0x482 * 8 + 5)
#define                                 CLC3IP_bit          _BIT_ACCESS(IPR5,5)
// PMD3<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x1819);	// @ (0x303 * 8 + 1)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD3,1)
// CLCDATA<CLC3OUT>
extern volatile __bit                   CLC3OUT             __at(0xD1A);	// @ (0x1A3 * 8 + 2)
#define                                 CLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// PIE5<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x23C6);	// @ (0x478 * 8 + 6)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE5,6)
// PIR5<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x2376);	// @ (0x46E * 8 + 6)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR5,6)
// IPR5<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x2416);	// @ (0x482 * 8 + 6)
#define                                 CLC4IP_bit          _BIT_ACCESS(IPR5,6)
// PMD3<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x181A);	// @ (0x303 * 8 + 2)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD3,2)
// CLCDATA<CLC4OUT>
extern volatile __bit                   CLC4OUT             __at(0xD1B);	// @ (0x1A3 * 8 + 3)
#define                                 CLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0x1CE8);	// @ (0x39D * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0x1CE9);	// @ (0x39D * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0x1CEA);	// @ (0x39D * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0x1CEB);	// @ (0x39D * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0x1CEC);	// @ (0x39D * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0x1CF0);	// @ (0x39E * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0x1CF1);	// @ (0x39E * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0x1CF2);	// @ (0x39E * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0x1CF3);	// @ (0x39E * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0x1CF4);	// @ (0x39E * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0x1CF8);	// @ (0x39F * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0x1CF9);	// @ (0x39F * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
// CLCIN2PPS<CLCIN2PPS2>
extern volatile __bit                   CLCIN2PPS2          __at(0x1CFA);	// @ (0x39F * 8 + 2)
#define                                 CLCIN2PPS2_bit      _BIT_ACCESS(CLCIN2PPS,2)
// CLCIN2PPS<CLCIN2PPS3>
extern volatile __bit                   CLCIN2PPS3          __at(0x1CFB);	// @ (0x39F * 8 + 3)
#define                                 CLCIN2PPS3_bit      _BIT_ACCESS(CLCIN2PPS,3)
// CLCIN2PPS<CLCIN2PPS4>
extern volatile __bit                   CLCIN2PPS4          __at(0x1CFC);	// @ (0x39F * 8 + 4)
#define                                 CLCIN2PPS4_bit      _BIT_ACCESS(CLCIN2PPS,4)
// CLCIN3PPS<CLCIN3PPS0>
extern volatile __bit                   CLCIN3PPS0          __at(0x1D00);	// @ (0x3A0 * 8 + 0)
#define                                 CLCIN3PPS0_bit      _BIT_ACCESS(CLCIN3PPS,0)
// CLCIN3PPS<CLCIN3PPS1>
extern volatile __bit                   CLCIN3PPS1          __at(0x1D01);	// @ (0x3A0 * 8 + 1)
#define                                 CLCIN3PPS1_bit      _BIT_ACCESS(CLCIN3PPS,1)
// CLCIN3PPS<CLCIN3PPS2>
extern volatile __bit                   CLCIN3PPS2          __at(0x1D02);	// @ (0x3A0 * 8 + 2)
#define                                 CLCIN3PPS2_bit      _BIT_ACCESS(CLCIN3PPS,2)
// CLCIN3PPS<CLCIN3PPS3>
extern volatile __bit                   CLCIN3PPS3          __at(0x1D03);	// @ (0x3A0 * 8 + 3)
#define                                 CLCIN3PPS3_bit      _BIT_ACCESS(CLCIN3PPS,3)
// CLCIN3PPS<CLCIN3PPS4>
extern volatile __bit                   CLCIN3PPS4          __at(0x1D04);	// @ (0x3A0 * 8 + 4)
#define                                 CLCIN3PPS4_bit      _BIT_ACCESS(CLCIN3PPS,4)
// PORTWCON<CLKEN>
extern volatile __bit                   CLKEN               __at(0x2528);	// @ (0x4A5 * 8 + 0)
#define                                 CLKEN_bit           _BIT_ACCESS(PORTWCON,0)
// CLKRCLK<CLKRCLK0>
