garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
#define                                 TU16ATMR12_bit      _BIT_ACCESS(TU16ATMRH,4)
// TU16ATMRH<TU16ATMR13>
extern volatile __bit                   TU16ATMR13          __at(0x98D);	// @ (0x131 * 8 + 5)
#define                                 TU16ATMR13_bit      _BIT_ACCESS(TU16ATMRH,5)
// TU16ATMRH<TU16ATMR14>
extern volatile __bit                   TU16ATMR14          __at(0x98E);	// @ (0x131 * 8 + 6)
#define                                 TU16ATMR14_bit      _BIT_ACCESS(TU16ATMRH,6)
// TU16ATMRH<TU16ATMR15>
extern volatile __bit                   TU16ATMR15          __at(0x98F);	// @ (0x131 * 8 + 7)
#define                                 TU16ATMR15_bit      _BIT_ACCESS(TU16ATMRH,7)
// TU16ATMRL<TU16ATMR2>
extern volatile __bit                   TU16ATMR2           __at(0x982);	// @ (0x130 * 8 + 2)
#define                                 TU16ATMR2_bit       _BIT_ACCESS(TU16ATMRL,2)
// TU16ATMRT<TU16ATMR24>
extern volatile __bit                   TU16ATMR24          __at(0x998);	// @ (0x133 * 8 + 0)
#define                                 TU16ATMR24_bit      _BIT_ACCESS(TU16ATMRT,0)
// TU16ATMRT<TU16ATMR25>
extern volatile __bit                   TU16ATMR25          __at(0x999);	// @ (0x133 * 8 + 1)
#define                                 TU16ATMR25_bit      _BIT_ACCESS(TU16ATMRT,1)
// TU16ATMRT<TU16ATMR26>
extern volatile __bit                   TU16ATMR26          __at(0x99A);	// @ (0x133 * 8 + 2)
#define                                 TU16ATMR26_bit      _BIT_ACCESS(TU16ATMRT,2)
// TU16ATMRT<TU16ATMR27>
extern volatile __bit                   TU16ATMR27          __at(0x99B);	// @ (0x133 * 8 + 3)
#define                                 TU16ATMR27_bit      _BIT_ACCESS(TU16ATMRT,3)
// TU16ATMRT<TU16ATMR28>
extern volatile __bit                   TU16ATMR28          __at(0x99C);	// @ (0x133 * 8 + 4)
#define                                 TU16ATMR28_bit      _BIT_ACCESS(TU16ATMRT,4)
// TU16ATMRT<TU16ATMR29>
extern volatile __bit                   TU16ATMR29          __at(0x99D);	// @ (0x133 * 8 + 5)
#define                                 TU16ATMR29_bit      _BIT_ACCESS(TU16ATMRT,5)
// TU16ATMRL<TU16ATMR3>
extern volatile __bit                   TU16ATMR3           __at(0x983);	// @ (0x130 * 8 + 3)
#define                                 TU16ATMR3_bit       _BIT_ACCESS(TU16ATMRL,3)
// TU16ATMRT<TU16ATMR30>
extern volatile __bit                   TU16ATMR30          __at(0x99E);	// @ (0x133 * 8 + 6)
#define                                 TU16ATMR30_bit      _BIT_ACCESS(TU16ATMRT,6)
// TU16ATMRT<TU16ATMR31>
extern volatile __bit                   TU16ATMR31          __at(0x99F);	// @ (0x133 * 8 + 7)
#define                                 TU16ATMR31_bit      _BIT_ACCESS(TU16ATMRT,7)
// TU16ATMRL<TU16ATMR4>
extern volatile __bit                   TU16ATMR4           __at(0x984);	// @ (0x130 * 8 + 4)
#define                                 TU16ATMR4_bit       _BIT_ACCESS(TU16ATMRL,4)
// TU16ATMRL<TU16ATMR5>
extern volatile __bit                   TU16ATMR5           __at(0x985);	// @ (0x130 * 8 + 5)
#define                                 TU16ATMR5_bit       _BIT_ACCESS(TU16ATMRL,5)
// TU16ATMRL<TU16ATMR6>
extern volatile __bit                   TU16ATMR6           __at(0x986);	// @ (0x130 * 8 + 6)
#define                                 TU16ATMR6_bit       _BIT_ACCESS(TU16ATMRL,6)
// TU16ATMRL<TU16ATMR7>
extern volatile __bit                   TU16ATMR7           __at(0x987);	// @ (0x130 * 8 + 7)
#define                                 TU16ATMR7_bit       _BIT_ACCESS(TU16ATMRL,7)
// TU16ATMRH<TU16ATMR8>
extern volatile __bit                   TU16ATMR8           __at(0x988);	// @ (0x131 * 8 + 0)
#define                                 TU16ATMR8_bit       _BIT_ACCESS(TU16ATMRH,0)
// TU16ATMRH<TU16ATMR9>
extern volatile __bit                   TU16ATMR9           __at(0x989);	// @ (0x131 * 8 + 1)
#define                                 TU16ATMR9_bit       _BIT_ACCESS(TU16ATMRH,1)
// TU16ATMRH<TU16ATMRH0>
extern volatile __bit                   TU16ATMRH0          __at(0x988);	// @ (0x131 * 8 + 0)
#define                                 TU16ATMRH0_bit      _BIT_ACCESS(TU16ATMRH,0)
// TU16ATMRH<TU16ATMRH1>
extern volatile __bit                   TU16ATMRH1          __at(0x989);	// @ (0x131 * 8 + 1)
#define                                 TU16ATMRH1_bit      _BIT_ACCESS(TU16ATMRH,1)
// TU16ATMRH<TU16ATMRH2>
extern volatile __bit                   TU16ATMRH2          __at(0x98A);	// @ (0x131 * 8 + 2)
#define                                 TU16ATMRH2_bit      _BIT_ACCESS(TU16ATMRH,2)
// TU16ATMRH<TU16ATMRH3>
extern volatile __bit                   TU16ATMRH3          __at(0x98B);	// @ (0x131 * 8 + 3)
#define                                 TU16ATMRH3_bit      _BIT_ACCESS(TU16ATMRH,3)
// TU16ATMRH<TU16ATMRH4>
extern volatile __bit                   TU16ATMRH4          __at(0x98C);	// @ (0x131 * 8 + 4)
#define                                 TU16ATMRH4_bit      _BIT_ACCESS(TU16ATMRH,4)
// TU16ATMRH<TU16ATMRH5>
extern volatile __bit                   TU16ATMRH5          __at(0x98D);	// @ (0x131 * 8 + 5)
#define                                 TU16ATMRH5_bit      _BIT_ACCESS(TU16ATMRH,5)
// TU16ATMRH<TU16ATMRH6>
extern volatile __bit                   TU16ATMRH6          __at(0x98E);	// @ (0x131 * 8 + 6)
#define                                 TU16ATMRH6_bit      _BIT_ACCESS(TU16ATMRH,6)
// TU16ATMRH<TU16ATMRH7>
extern volatile __bit                   TU16ATMRH7          __at(0x98F);	// @ (0x131 * 8 + 7)
#define                                 TU16ATMRH7_bit      _BIT_ACCESS(TU16ATMRH,7)
// TU16ATMRL<TU16ATMRL0>
extern volatile __bit                   TU16ATMRL0          __at(0x980);	// @ (0x130 * 8 + 0)
#define                                 TU16ATMRL0_bit      _BIT_ACCESS(TU16ATMRL,0)
// TU16ATMRL<TU16ATMRL1>
extern volatile __bit                   TU16ATMRL1          __at(0x981);	// @ (0x130 * 8 + 1)
#define                                 TU16ATMRL1_bit      _BIT_ACCESS(TU16ATMRL,1)
// TU16ATMRL<TU16ATMRL2>
extern volatile __bit                   TU16ATMRL2          __at(0x982);	// @ (0x130 * 8 + 2)
#define                                 TU16ATMRL2_bit      _BIT_ACCESS(TU16ATMRL,2)
// TU16ATMRL<TU16ATMRL3>
extern volatile __bit                   TU16ATMRL3          __at(0x983);	// @ (0x130 * 8 + 3)
#define                                 TU16ATMRL3_bit      _BIT_ACCESS(TU16ATMRL,3)
// TU16ATMRL<TU16ATMRL4>
extern volatile __bit                   TU16ATMRL4          __at(0x984);	// @ (0x130 * 8 + 4)
#define                                 TU16ATMRL4_bit      _BIT_ACCESS(TU16ATMRL,4)
// TU16ATMRL<TU16ATMRL5>
extern volatile __bit                   TU16ATMRL5          __at(0x985);	// @ (0x130 * 8 + 5)
#define                                 TU16ATMRL5_bit      _BIT_ACCESS(TU16ATMRL,5)
// TU16ATMRL<TU16ATMRL6>
extern volatile __bit                   TU16ATMRL6          __at(0x986);	// @ (0x130 * 8 + 6)
#define                                 TU16ATMRL6_bit      _BIT_ACCESS(TU16ATMRL,6)
// TU16ATMRL<TU16ATMRL7>
extern volatile __bit                   TU16ATMRL7          __at(0x987);	// @ (0x130 * 8 + 7)
#define                                 TU16ATMRL7_bit      _BIT_ACCESS(TU16ATMRL,7)
// TU16ATMRT<TU16ATMRT0>
extern volatile __bit                   TU16ATMRT0          __at(0x998);	// @ (0x133 * 8 + 0)
#define                                 TU16ATMRT0_bit      _BIT_ACCESS(TU16ATMRT,0)
// TU16ATMRT<TU16ATMRT1>
extern volatile __bit                   TU16ATMRT1          __at(0x999);	// @ (0x133 * 8 + 1)
#define                                 TU16ATMRT1_bit      _BIT_ACCESS(TU16ATMRT,1)
// TU16ATMRT<TU16ATMRT2>
extern volatile __bit                   TU16ATMRT2          __at(0x99A);	// @ (0x133 * 8 + 2)
#define                                 TU16ATMRT2_bit      _BIT_ACCESS(TU16ATMRT,2)
// TU16ATMRT<TU16ATMRT3>
extern volatile __bit                   TU16ATMRT3          __at(0x99B);	// @ (0x133 * 8 + 3)
#define                                 TU16ATMRT3_bit      _BIT_ACCESS(TU16ATMRT,3)
// TU16ATMRT<TU16ATMRT4>
extern volatile __bit                   TU16ATMRT4          __at(0x99C);	// @ (0x133 * 8 + 4)
#define                                 TU16ATMRT4_bit      _BIT_ACCESS(TU16ATMRT,4)
// TU16ATMRT<TU16ATMRT5>
extern volatile __bit                   TU16ATMRT5          __at(0x99D);	// @ (0x133 * 8 + 5)
#define                                 TU16ATMRT5_bit      _BIT_ACCESS(TU16ATMRT,5)
// TU16ATMRT<TU16ATMRT6>
extern volatile __bit                   TU16ATMRT6          __at(0x99E);	// @ (0x133 * 8 + 6)
#define                                 TU16ATMRT6_bit      _BIT_ACCESS(TU16ATMRT,6)
// TU16ATMRT<TU16ATMRT7>
extern volatile __bit                   TU16ATMRT7          __at(0x99F);	// @ (0x133 * 8 + 7)
#define                                 TU16ATMRT7_bit      _BIT_ACCESS(TU16ATMRT,7)
// TU16ACON0<TU16AZIE>
extern volatile __bit                   TU16AZIE            __at(0x961);	// @ (0x12C * 8 + 1)
#define                                 TU16AZIE_bit        _BIT_ACCESS(TU16ACON0,1)
// TU16ACON1<TU16AZIF>
extern volatile __bit                   TU16AZIF            __at(0x969);	// @ (0x12D * 8 + 1)
#define                                 TU16AZIF_bit        _BIT_ACCESS(TU16ACON1,1)
// TU16BCON1<TU16BCAPT>
extern volatile __bit                   TU16BCAPT           __at(0x9DB);	// @ (0x13B * 8 + 3)
#define                                 TU16BCAPT_bit       _BIT_ACCESS(TU16BCON1,3)
// TU16BCON0<TU16BCIE>
extern volatile __bit                   TU16BCIE            __at(0x9D0);	// @ (0x13A * 8 + 0)
#define                                 TU16BCIE_bit        _BIT_ACCESS(TU16BCON0,0)
// TU16BCON1<TU16BCIF>
extern volatile __bit                   TU16BCIF            __at(0x9D8);	// @ (0x13B * 8 + 0)
#define                                 TU16BCIF_bit        _BIT_ACCESS(TU16BCON1,0)
// TU16BCLK<TU16BCLK0>
extern volatile __bit                   TU16BCLK0           __at(0xA30);	// @ (0x146 * 8 + 0)
#define                                 TU16BCLK0_bit       _BIT_ACCESS(TU16BCLK,0)
// TU16BCLK<TU16BCLK1>
extern volatile __bit                   TU16BCLK1           __at(0xA31);	// @ (0x146 * 8 + 1)
#define                                 TU16BCLK1_bit       _BIT_ACCESS(TU16BCLK,1)
// TU16BCLK<TU16BCLK2>
extern volatile __bit                   TU16BCLK2           __at(0xA32);	// @ (0x146 * 8 + 2)
#define                                 TU16BCLK2_bit       _BIT_ACCESS(TU16BCLK,2)
// TU16BCLK<TU16BCLK3>
extern volatile __bit                   TU16BCLK3           __at(0xA33);	// @ (0x146 * 8 + 3)
#define                                 TU16BCLK3_bit       _BIT_ACCESS(TU16BCLK,3)
// TU16BCLK<TU16BCLK4>
extern volatile __bit                   TU16BCLK4           __at(0xA34);	// @ (0x146 * 8 + 4)
#define                                 TU16BCLK4_bit       _BIT_ACCESS(TU16BCLK,4)
// TU16BCON1<TU16BCLR>
extern volatile __bit                   TU16BCLR            __at(0x9DD);	// @ (0x13B * 8 + 5)
#define                                 TU16BCLR_bit        _BIT_ACCESS(TU16BCON1,5)
// TU16BCON0<TU16BCPOL>
extern volatile __bit                   TU16BCPOL           __at(0x9D6);	// @ (0x13A * 8 + 6)
#define                                 TU16BCPOL_bit       _BIT_ACCESS(TU16BCON0,6)
// TU16BCRL<TU16BCR0>
extern volatile __bit                   TU16BCR0            __at(0x9F0);	// @ (0x13E * 8 + 0)
#define                                 TU16BCR0_bit        _BIT_ACCESS(TU16BCRL,0)
// TU16BCRL<TU16BCR1>
extern volatile __bit                   TU16BCR1            __at(0x9F1);	// @ (0x13E * 8 + 1)
#define                                 TU16BCR1_bit        _BIT_ACCESS(TU16BCRL,1)
// TU16BCRH<TU16BCR10>
extern volatile __bit                   TU16BCR10           __at(0x9FA);	// @ (0x13F * 8 + 2)
#define                                 TU16BCR10_bit       _BIT_ACCESS(TU16BCRH,2)
// TU16BCRH<TU16BCR11>
extern volatile __bit                   TU16BCR11           __at(0x9FB);	// @ (0x13F * 8 + 3)
#define                                 TU16BCR11_bit       _BIT_ACCESS(TU16BCRH,3)
// TU16BCRH<TU16BCR12>
extern volatile __bit                   TU16BCR12           __at(0x9FC);	// @ (0x13F * 8 + 4)
#define                                 TU16BCR12_bit       _BIT_ACCESS(TU16BCRH,4)
// TU16BCRH<TU16BCR13>
extern volatile __bit                   TU16BCR13           __at(0x9FD);	// @ (0x13F * 8 + 5)
#define                                 TU16BCR13_bit       _BIT_ACCESS(TU16BCRH,5)
// TU16BCRH<TU16BCR14>
extern volatile __bit                   TU16BCR14           __at(0x9FE);	// @ (0x13F * 8 + 6)
#define                                 TU16BCR14_bit       _BIT_ACCESS(TU16BCRH,6)
// TU16BCRH<TU16BCR15>
extern volatile __bit                   TU16BCR15           __at(0x9FF);	// @ (0x13F * 8 + 7)
#define                                 TU16BCR15_bit       _BIT_ACCESS(TU16BCRH,7)
// TU16BCRL<TU16BCR2>
extern volatile __bit                   TU16BCR2            __at(0x9F2);	// @ (0x13E * 8 + 2)
#define                                 TU16BCR2_bit        _BIT_ACCESS(TU16BCRL,2)
// TU16BCRT<TU16BCR24>
extern volatile __bit                   TU16BCR24           __at(0xA08);	// @ (0x141 * 8 + 0)
#define                                 TU16BCR24_bit       _BIT_ACCESS(TU16BCRT,0)
// TU16BCRT<TU16BCR25>
extern volatile __bit                   TU16BCR25           __at(0xA09);	// @ (0x141 * 8 + 1)
#define                                 TU16BCR25_bit       _BIT_ACCESS(TU16BCRT,1)
// TU16BCRT<TU16BCR26>
extern volatile __bit                   TU16BCR26           __at(0xA0A);	// @ (0x141 * 8 + 2)
#define                                 TU16BCR26_bit       _BIT_ACCESS(TU16BCRT,2)
// TU16BCRT<TU16BCR27>
extern volatile __bit                   TU16BCR27           __at(0xA0B);	// @ (0x141 * 8 + 3)
#define                                 TU16BCR27_bit       _BIT_ACCESS(TU16BCRT,3)
// TU16BCRT<TU16BCR28>
extern volatile __bit                   TU16BCR28           __at(0xA0C);	// @ (0x141 * 8 + 4)
#define                                 TU16BCR28_bit       _BIT_ACCESS(TU16BCRT,4)
// TU16BCRT<TU16BCR29>
extern volatile __bit                   TU16BCR29           __at(0xA0D);	// @ (0x141 * 8 + 5)
#define                                 TU16BCR29_bit       _BIT_ACCESS(TU16BCRT,5)
// TU16BCRL<TU16BCR3>
extern volatile __bit                   TU16BCR3            __at(0x9F3);	// @ (0x13E * 8 + 3)
#define                                 TU16BCR3_bit        _BIT_ACCESS(TU16BCRL,3)
// TU16BCRT<TU16BCR30>
extern volatile __bit                   TU16BCR30           __at(0xA0E);	// @ (0x141 * 8 + 6)
#define                                 TU16BCR30_bit       _BIT_ACCESS(TU16BCRT,6)
// TU16BCRT<TU16BCR31>
extern volatile __bit                   TU16BCR31           __at(0xA0F);	// @ (0x141 * 8 + 7)
#define                                 TU16BCR31_bit       _BIT_ACCESS(TU16BCRT,7)
// TU16BCRL<TU16BCR4>
extern volatile __bit                   TU16BCR4            __at(0x9F4);	// @ (0x13E * 8 + 4)
#define                                 TU16BCR4_bit        _BIT_ACCESS(TU16BCRL,4)
// TU16BCRL<TU16BCR5>
extern volatile __bit                   TU16BCR5            __at(0x9F5);	// @ (0x13E * 8 + 5)
#define                                 TU16BCR5_bit        _BIT_ACCESS(TU16BCRL,5)
// TU16BCRL<TU16BCR6>
extern volatile __bit                   TU16BCR6            __at(0x9F6);	// @ (0x13E * 8 + 6)
#define                                 TU16BCR6_bit        _BIT_ACCESS(TU16BCRL,6)
// TU16BCRL<TU16BCR7>
extern volatile __bit                   TU16BCR7            __at(0x9F7);	// @ (0x13E * 8 + 7)
#define                                 TU16BCR7_bit        _BIT_ACCESS(TU16BCRL,7)
// TU16BCRH<TU16BCR8>
extern volatile __bit                   TU16BCR8            __at(0x9F8);	// @ (0x13F * 8 + 0)
#define                                 TU16BCR8_bit        _BIT_ACCESS(TU16BCRH,0)
// TU16BCRH<TU16BCR9>
extern volatile __bit                   TU16BCR9            __at(0x9F9);	// @ (0x13F * 8 + 1)
#define                                 TU16BCR9_bit        _BIT_ACCESS(TU16BCRH,1)
// TU16BCRH<TU16BCRH0>
extern volatile __bit                   TU16BCRH0           __at(0x9F8);	// @ (0x13F * 8 + 0)
#define                                 TU16BCRH0_bit       _BIT_ACCESS(TU16BCRH,0)
// TU16BCRH<TU16BCRH1>
extern volatile __bit                   TU16BCRH1           __at(0x9F9);	// @ (0x13F * 8 + 1)
#define                                 TU16BCRH1_bit       _BIT_ACCESS(TU16BCRH,1)
// TU16BCRH<TU16BCRH2>
extern volatile __bit                   TU16BCRH2           __at(0x9FA);	// @ (0x13F * 8 + 2)
#define                                 TU16BCRH2_bit       _BIT_ACCESS(TU16BCRH,2)
// TU16BCRH<TU16BCRH3>
extern volatile __bit                   TU16BCRH3           __at(0x9FB);	// @ (0x13F * 8 + 3)
#define                                 TU16BCRH3_bit       _BIT_ACCESS(TU16BCRH,3)
// TU16BCRH<TU16BCRH4>
extern volatile __bit                   TU16BCRH4           __at(0x9FC);	// @ (0x13F * 8 + 4)
#define                                 TU16BCRH4_bit       _BIT_ACCESS(TU16BCRH,4)
// TU16BCRH<TU16BCRH5>
extern volatile __bit                   TU16BCRH5           __at(0x9FD);	// @ (0x13F * 8 + 5)
#define                                 TU16BCRH5_bit       _BIT_ACCESS(TU16BCRH,5)
// TU16BCRH<TU16BCRH6>
extern volatile __bit                   TU16BCRH6           __at(0x9FE);	// @ (0x13F * 8 + 6)
#define                                 TU16BCRH6_bit       _BIT_ACCESS(TU16BCRH,6)
// TU16BCRH<TU16BCRH7>
extern volatile __bit                   TU16BCRH7           __at(0x9FF);	// @ (0x13F * 8 + 7)
#define                                 TU16BCRH7_bit       _BIT_ACCESS(TU16BCRH,7)
// TU16BCRL<TU16BCRL0>
extern volatile __bit                   TU16BCRL0           __at(0x9F0);	// @ (0x13E * 8 + 0)
#define                                 TU16BCRL0_bit       _BIT_ACCESS(TU16BCRL,0)
// TU16BCRL<TU16BCRL1>
extern volatile __bit                   TU16BCRL1           __at(0x9F1);	// @ (0x13E * 8 + 1)
#define                                 TU16BCRL1_bit       _BIT_ACCESS(TU16BCRL,1)
// TU16BCRL<TU16BCRL2>
extern volatile __bit                   TU16BCRL2           __at(0x9F2);	// @ (0x13E * 8 + 2)
#define                                 TU16BCRL2_bit       _BIT_ACCESS(TU16BCRL,2)
// TU16BCRL<TU16BCRL3>
extern volatile __bit                   TU16BCRL3           __at(0x9F3);	// @ (0x13E * 8 + 3)
#define                                 TU16BCRL3_bit       _BIT_ACCESS(TU16BCRL,3)
// TU16BCRL<TU16BCRL4>
extern volatile __bit                   TU16BCRL4           __at(0x9F4);	// @ (0x13E * 8 + 4)
#define                                 TU16BCRL4_bit       _BIT_ACCESS(TU16BCRL,4)
// TU16BCRL<TU16BCRL5>
extern volatile __bit                   TU16BCRL5           __at(0x9F5);	// @ (0x13E * 8 + 5)
#define                                 TU16BCRL5_bit       _BIT_ACCESS(TU16BCRL,5)
// TU16BCRL<TU16BCRL6>
extern volatile __bit                   TU16BCRL6           __at(0x9F6);	// @ (0x13E * 8 + 6)
#define                                 TU16BCRL6_bit       _BIT_ACCESS(TU16BCRL,6)
// TU16BCRL<TU16BCRL7>
extern volatile __bit                   TU16BCRL7           __at(0x9F7);	// @ (0x13E * 8 + 7)
#define                                 TU16BCRL7_bit       _BIT_ACCESS(TU16BCRL,7)
// TU16BCRT<TU16BCRT0>
extern volatile __bit                   TU16BCRT0           __at(0xA08);	// @ (0x141 * 8 + 0)
#define                                 TU16BCRT0_bit       _BIT_ACCESS(TU16BCRT,0)
// TU16BCRT<TU16BCRT1>
extern volatile __bit                   TU16BCRT1           __at(0xA09);	// @ (0x141 * 8 + 1)
#define                                 TU16BCRT1_bit       _BIT_ACCESS(TU16BCRT,1)
// TU16BCRT<TU16BCRT2>
extern volatile __bit                   TU16BCRT2           __at(0xA0A);	// @ (0x141 * 8 + 2)
#define                                 TU16BCRT2_bit       _BIT_ACCESS(TU16BCRT,2)
// TU16BCRT<TU16BCRT3>
extern volatile __bit                   TU16BCRT3           __at(0xA0B);	// @ (0x141 * 8 + 3)
#define                                 TU16BCRT3_bit       _BIT_ACCESS(TU16BCRT,3)
// TU16BCRT<TU16BCRT4>
extern volatile __bit                   TU16BCRT4           __at(0xA0C);	// @ (0x141 * 8 + 4)
#define                                 TU16BCRT4_bit       _BIT_ACCESS(TU16BCRT,4)
// TU16BCRT<TU16BCRT5>
extern volatile __bit                   TU16BCRT5           __at(0xA0D);	// @ (0x141 * 8 + 5)
#define                                 TU16BCRT5_bit       _BIT_ACCESS(TU16BCRT,5)
// TU16BCRT<TU16BCRT6>
extern volatile __bit                   TU16BCRT6           __at(0xA0E);	// @ (0x141 * 8 + 6)
#define                                 TU16BCRT6_bit       _BIT_ACCESS(TU16BCRT,6)
// TU16BCRT<TU16BCRT7>
extern volatile __bit                   TU16BCRT7           __at(0xA0F);	// @ (0x141 * 8 + 7)
#define                                 TU16BCRT7_bit       _BIT_ACCESS(TU16BCRT,7)
// TU16BHLT<TU16BCSYNC>
extern volatile __bit                   TU16BCSYNC          __at(0x9E6);	// @ (0x13C * 8 + 6)
#define                                 TU16BCSYNC_bit      _BIT_ACCESS(TU16BHLT,6)
// TU16BHLT<TU16BEPOL>
extern volatile __bit                   TU16BEPOL           __at(0x9E7);	// @ (0x13C * 8 + 7)
#define                                 TU16BEPOL_bit       _BIT_ACCESS(TU16BHLT,7)
// TU16BERS<TU16BERS0>
extern volatile __bit                   TU16BERS0           __at(0xA38);	// @ (0x147 * 8 + 0)
#define                                 TU16BERS0_bit       _BIT_ACCESS(TU16BERS,0)
// TU16BERS<TU16BERS1>
extern volatile __bit                   TU16BERS1           __at(0xA39);	// @ (0x147 * 8 + 1)
#define                                 TU16BERS1_bit       _BIT_ACCESS(TU16BERS,1)
// TU16BERS<TU16BERS2>
extern volatile __bit                   TU16BERS2           __at(0xA3A);	// @ (0x147 * 8 + 2)
#define                                 TU16BERS2_bit       _BIT_ACCESS(TU16BERS,2)
// TU16BERS<TU16BERS3>
extern volatile __bit                   TU16BERS3           __at(0xA3B);	// @ (0x147 * 8 + 3)
#define                                 TU16BERS3_bit       _BIT_ACCESS(TU16BERS,3)
// TU16BERS<TU16BERS4>
extern volatile __bit                   TU16BERS4           __at(0xA3C);	// @ (0x147 * 8 + 4)
#define                                 TU16BERS4_bit       _BIT_ACCESS(TU16BERS,4)
// TU16BERS<TU16BERS5>
extern volatile __bit                   TU16BERS5           __at(0xA3D);	// @ (0x147 * 8 + 5)
#define                                 TU16BERS5_bit       _BIT_ACCESS(TU16BERS,5)
// PIE4<TU16BIE>
extern volatile __bit                   TU16BIE             __at(0x23BB);	// @ (0x477 * 8 + 3)
#define                                 TU16BIE_bit         _BIT_ACCESS(PIE4,3)
// PIR4<TU16BIF>
extern volatile __bit                   TU16BIF             __at(0x236B);	// @ (0x46D * 8 + 3)
#define                                 TU16BIF_bit         _BIT_ACCESS(PIR4,3)
// IPR4<TU16BIP>
extern volatile __bit                   TU16BIP             __at(0x240B);	// @ (0x481 * 8 + 3)
#define                                 TU16BIP_bit         _BIT_ACCESS(IPR4,3)
// TU16BCON1<TU16BLIMIT>
extern volatile __bit                   TU16BLIMIT          __at(0x9DC);	// @ (0x13B * 8 + 4)
#define                                 TU16BLIMIT_bit      _BIT_ACCESS(TU16BCON1,4)
// PMD2<TU16BMD>
extern volatile __bit                   TU16BMD             __at(0x1811);	// @ (0x302 * 8 + 1)
#define                                 TU16BMD_bit         _BIT_ACCESS(PMD2,1)
// TU16BCON0<TU16BOM>
extern volatile __bit                   TU16BOM             __at(0x9D5);	// @ (0x13A * 8 + 5)
#define                                 TU16BOM_bit         _BIT_ACCESS(TU16BCON0,5)
// TU16BCON0<TU16BON>
extern volatile __bit                   TU16BON             __at(0x9D7);	// @ (0x13A * 8 + 7)
#define                                 TU16BON_bit         _BIT_ACCESS(TU16BCON0,7)
// TU16BCON0<TU16BOPOL>
