garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f15q20.h
extern volatile __bit                   TU16BOPOL           __at(0x9D4);	// @ (0x13A * 8 + 4)
#define                                 TU16BOPOL_bit       _BIT_ACCESS(TU16BCON0,4)
// TU16BPRL<TU16BPR0>
extern volatile __bit                   TU16BPR0            __at(0xA10);	// @ (0x142 * 8 + 0)
#define                                 TU16BPR0_bit        _BIT_ACCESS(TU16BPRL,0)
// TU16BPRL<TU16BPR1>
extern volatile __bit                   TU16BPR1            __at(0xA11);	// @ (0x142 * 8 + 1)
#define                                 TU16BPR1_bit        _BIT_ACCESS(TU16BPRL,1)
// TU16BPRH<TU16BPR10>
extern volatile __bit                   TU16BPR10           __at(0xA1A);	// @ (0x143 * 8 + 2)
#define                                 TU16BPR10_bit       _BIT_ACCESS(TU16BPRH,2)
// TU16BPRH<TU16BPR11>
extern volatile __bit                   TU16BPR11           __at(0xA1B);	// @ (0x143 * 8 + 3)
#define                                 TU16BPR11_bit       _BIT_ACCESS(TU16BPRH,3)
// TU16BPRH<TU16BPR12>
extern volatile __bit                   TU16BPR12           __at(0xA1C);	// @ (0x143 * 8 + 4)
#define                                 TU16BPR12_bit       _BIT_ACCESS(TU16BPRH,4)
// TU16BPRH<TU16BPR13>
extern volatile __bit                   TU16BPR13           __at(0xA1D);	// @ (0x143 * 8 + 5)
#define                                 TU16BPR13_bit       _BIT_ACCESS(TU16BPRH,5)
// TU16BPRH<TU16BPR14>
extern volatile __bit                   TU16BPR14           __at(0xA1E);	// @ (0x143 * 8 + 6)
#define                                 TU16BPR14_bit       _BIT_ACCESS(TU16BPRH,6)
// TU16BPRH<TU16BPR15>
extern volatile __bit                   TU16BPR15           __at(0xA1F);	// @ (0x143 * 8 + 7)
#define                                 TU16BPR15_bit       _BIT_ACCESS(TU16BPRH,7)
// TU16BPRL<TU16BPR2>
extern volatile __bit                   TU16BPR2            __at(0xA12);	// @ (0x142 * 8 + 2)
#define                                 TU16BPR2_bit        _BIT_ACCESS(TU16BPRL,2)
// TU16BPRT<TU16BPR24>
extern volatile __bit                   TU16BPR24           __at(0xA28);	// @ (0x145 * 8 + 0)
#define                                 TU16BPR24_bit       _BIT_ACCESS(TU16BPRT,0)
// TU16BPRT<TU16BPR25>
extern volatile __bit                   TU16BPR25           __at(0xA29);	// @ (0x145 * 8 + 1)
#define                                 TU16BPR25_bit       _BIT_ACCESS(TU16BPRT,1)
// TU16BPRT<TU16BPR26>
extern volatile __bit                   TU16BPR26           __at(0xA2A);	// @ (0x145 * 8 + 2)
#define                                 TU16BPR26_bit       _BIT_ACCESS(TU16BPRT,2)
// TU16BPRT<TU16BPR27>
extern volatile __bit                   TU16BPR27           __at(0xA2B);	// @ (0x145 * 8 + 3)
#define                                 TU16BPR27_bit       _BIT_ACCESS(TU16BPRT,3)
// TU16BPRT<TU16BPR28>
extern volatile __bit                   TU16BPR28           __at(0xA2C);	// @ (0x145 * 8 + 4)
#define                                 TU16BPR28_bit       _BIT_ACCESS(TU16BPRT,4)
// TU16BPRT<TU16BPR29>
extern volatile __bit                   TU16BPR29           __at(0xA2D);	// @ (0x145 * 8 + 5)
#define                                 TU16BPR29_bit       _BIT_ACCESS(TU16BPRT,5)
// TU16BPRL<TU16BPR3>
extern volatile __bit                   TU16BPR3            __at(0xA13);	// @ (0x142 * 8 + 3)
#define                                 TU16BPR3_bit        _BIT_ACCESS(TU16BPRL,3)
// TU16BPRT<TU16BPR30>
extern volatile __bit                   TU16BPR30           __at(0xA2E);	// @ (0x145 * 8 + 6)
#define                                 TU16BPR30_bit       _BIT_ACCESS(TU16BPRT,6)
// TU16BPRT<TU16BPR31>
extern volatile __bit                   TU16BPR31           __at(0xA2F);	// @ (0x145 * 8 + 7)
#define                                 TU16BPR31_bit       _BIT_ACCESS(TU16BPRT,7)
// TU16BPRL<TU16BPR4>
extern volatile __bit                   TU16BPR4            __at(0xA14);	// @ (0x142 * 8 + 4)
#define                                 TU16BPR4_bit        _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPR5>
extern volatile __bit                   TU16BPR5            __at(0xA15);	// @ (0x142 * 8 + 5)
#define                                 TU16BPR5_bit        _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPR6>
extern volatile __bit                   TU16BPR6            __at(0xA16);	// @ (0x142 * 8 + 6)
#define                                 TU16BPR6_bit        _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPR7>
extern volatile __bit                   TU16BPR7            __at(0xA17);	// @ (0x142 * 8 + 7)
#define                                 TU16BPR7_bit        _BIT_ACCESS(TU16BPRL,7)
// TU16BPRH<TU16BPR8>
extern volatile __bit                   TU16BPR8            __at(0xA18);	// @ (0x143 * 8 + 0)
#define                                 TU16BPR8_bit        _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPR9>
extern volatile __bit                   TU16BPR9            __at(0xA19);	// @ (0x143 * 8 + 1)
#define                                 TU16BPR9_bit        _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH0>
extern volatile __bit                   TU16BPRH0           __at(0xA18);	// @ (0x143 * 8 + 0)
#define                                 TU16BPRH0_bit       _BIT_ACCESS(TU16BPRH,0)
// TU16BPRH<TU16BPRH1>
extern volatile __bit                   TU16BPRH1           __at(0xA19);	// @ (0x143 * 8 + 1)
#define                                 TU16BPRH1_bit       _BIT_ACCESS(TU16BPRH,1)
// TU16BPRH<TU16BPRH2>
extern volatile __bit                   TU16BPRH2           __at(0xA1A);	// @ (0x143 * 8 + 2)
#define                                 TU16BPRH2_bit       _BIT_ACCESS(TU16BPRH,2)
// TU16BPRH<TU16BPRH3>
extern volatile __bit                   TU16BPRH3           __at(0xA1B);	// @ (0x143 * 8 + 3)
#define                                 TU16BPRH3_bit       _BIT_ACCESS(TU16BPRH,3)
// TU16BPRH<TU16BPRH4>
extern volatile __bit                   TU16BPRH4           __at(0xA1C);	// @ (0x143 * 8 + 4)
#define                                 TU16BPRH4_bit       _BIT_ACCESS(TU16BPRH,4)
// TU16BPRH<TU16BPRH5>
extern volatile __bit                   TU16BPRH5           __at(0xA1D);	// @ (0x143 * 8 + 5)
#define                                 TU16BPRH5_bit       _BIT_ACCESS(TU16BPRH,5)
// TU16BPRH<TU16BPRH6>
extern volatile __bit                   TU16BPRH6           __at(0xA1E);	// @ (0x143 * 8 + 6)
#define                                 TU16BPRH6_bit       _BIT_ACCESS(TU16BPRH,6)
// TU16BPRH<TU16BPRH7>
extern volatile __bit                   TU16BPRH7           __at(0xA1F);	// @ (0x143 * 8 + 7)
#define                                 TU16BPRH7_bit       _BIT_ACCESS(TU16BPRH,7)
// TU16BCON0<TU16BPRIE>
extern volatile __bit                   TU16BPRIE           __at(0x9D2);	// @ (0x13A * 8 + 2)
#define                                 TU16BPRIE_bit       _BIT_ACCESS(TU16BCON0,2)
// TU16BCON1<TU16BPRIF>
extern volatile __bit                   TU16BPRIF           __at(0x9DA);	// @ (0x13B * 8 + 2)
#define                                 TU16BPRIF_bit       _BIT_ACCESS(TU16BCON1,2)
// TU16BPRL<TU16BPRL0>
extern volatile __bit                   TU16BPRL0           __at(0xA10);	// @ (0x142 * 8 + 0)
#define                                 TU16BPRL0_bit       _BIT_ACCESS(TU16BPRL,0)
// TU16BPRL<TU16BPRL1>
extern volatile __bit                   TU16BPRL1           __at(0xA11);	// @ (0x142 * 8 + 1)
#define                                 TU16BPRL1_bit       _BIT_ACCESS(TU16BPRL,1)
// TU16BPRL<TU16BPRL2>
extern volatile __bit                   TU16BPRL2           __at(0xA12);	// @ (0x142 * 8 + 2)
#define                                 TU16BPRL2_bit       _BIT_ACCESS(TU16BPRL,2)
// TU16BPRL<TU16BPRL3>
extern volatile __bit                   TU16BPRL3           __at(0xA13);	// @ (0x142 * 8 + 3)
#define                                 TU16BPRL3_bit       _BIT_ACCESS(TU16BPRL,3)
// TU16BPRL<TU16BPRL4>
extern volatile __bit                   TU16BPRL4           __at(0xA14);	// @ (0x142 * 8 + 4)
#define                                 TU16BPRL4_bit       _BIT_ACCESS(TU16BPRL,4)
// TU16BPRL<TU16BPRL5>
extern volatile __bit                   TU16BPRL5           __at(0xA15);	// @ (0x142 * 8 + 5)
#define                                 TU16BPRL5_bit       _BIT_ACCESS(TU16BPRL,5)
// TU16BPRL<TU16BPRL6>
extern volatile __bit                   TU16BPRL6           __at(0xA16);	// @ (0x142 * 8 + 6)
#define                                 TU16BPRL6_bit       _BIT_ACCESS(TU16BPRL,6)
// TU16BPRL<TU16BPRL7>
extern volatile __bit                   TU16BPRL7           __at(0xA17);	// @ (0x142 * 8 + 7)
#define                                 TU16BPRL7_bit       _BIT_ACCESS(TU16BPRL,7)
// TU16BPRT<TU16BPRT0>
extern volatile __bit                   TU16BPRT0           __at(0xA28);	// @ (0x145 * 8 + 0)
#define                                 TU16BPRT0_bit       _BIT_ACCESS(TU16BPRT,0)
// TU16BPRT<TU16BPRT1>
extern volatile __bit                   TU16BPRT1           __at(0xA29);	// @ (0x145 * 8 + 1)
#define                                 TU16BPRT1_bit       _BIT_ACCESS(TU16BPRT,1)
// TU16BPRT<TU16BPRT2>
extern volatile __bit                   TU16BPRT2           __at(0xA2A);	// @ (0x145 * 8 + 2)
#define                                 TU16BPRT2_bit       _BIT_ACCESS(TU16BPRT,2)
// TU16BPRT<TU16BPRT3>
extern volatile __bit                   TU16BPRT3           __at(0xA2B);	// @ (0x145 * 8 + 3)
#define                                 TU16BPRT3_bit       _BIT_ACCESS(TU16BPRT,3)
// TU16BPRT<TU16BPRT4>
extern volatile __bit                   TU16BPRT4           __at(0xA2C);	// @ (0x145 * 8 + 4)
#define                                 TU16BPRT4_bit       _BIT_ACCESS(TU16BPRT,4)
// TU16BPRT<TU16BPRT5>
extern volatile __bit                   TU16BPRT5           __at(0xA2D);	// @ (0x145 * 8 + 5)
#define                                 TU16BPRT5_bit       _BIT_ACCESS(TU16BPRT,5)
// TU16BPRT<TU16BPRT6>
extern volatile __bit                   TU16BPRT6           __at(0xA2E);	// @ (0x145 * 8 + 6)
#define                                 TU16BPRT6_bit       _BIT_ACCESS(TU16BPRT,6)
// TU16BPRT<TU16BPRT7>
extern volatile __bit                   TU16BPRT7           __at(0xA2F);	// @ (0x145 * 8 + 7)
#define                                 TU16BPRT7_bit       _BIT_ACCESS(TU16BPRT,7)
// TU16BPS<TU16BPS0>
extern volatile __bit                   TU16BPS0            __at(0x9E8);	// @ (0x13D * 8 + 0)
#define                                 TU16BPS0_bit        _BIT_ACCESS(TU16BPS,0)
// TU16BPS<TU16BPS1>
extern volatile __bit                   TU16BPS1            __at(0x9E9);	// @ (0x13D * 8 + 1)
#define                                 TU16BPS1_bit        _BIT_ACCESS(TU16BPS,1)
// TU16BPS<TU16BPS2>
extern volatile __bit                   TU16BPS2            __at(0x9EA);	// @ (0x13D * 8 + 2)
#define                                 TU16BPS2_bit        _BIT_ACCESS(TU16BPS,2)
// TU16BPS<TU16BPS3>
extern volatile __bit                   TU16BPS3            __at(0x9EB);	// @ (0x13D * 8 + 3)
#define                                 TU16BPS3_bit        _BIT_ACCESS(TU16BPS,3)
// TU16BPS<TU16BPS4>
extern volatile __bit                   TU16BPS4            __at(0x9EC);	// @ (0x13D * 8 + 4)
#define                                 TU16BPS4_bit        _BIT_ACCESS(TU16BPS,4)
// TU16BPS<TU16BPS5>
extern volatile __bit                   TU16BPS5            __at(0x9ED);	// @ (0x13D * 8 + 5)
#define                                 TU16BPS5_bit        _BIT_ACCESS(TU16BPS,5)
// TU16BPS<TU16BPS6>
extern volatile __bit                   TU16BPS6            __at(0x9EE);	// @ (0x13D * 8 + 6)
#define                                 TU16BPS6_bit        _BIT_ACCESS(TU16BPS,6)
// TU16BPS<TU16BPS7>
extern volatile __bit                   TU16BPS7            __at(0x9EF);	// @ (0x13D * 8 + 7)
#define                                 TU16BPS7_bit        _BIT_ACCESS(TU16BPS,7)
// TU16BCON0<TU16BRDSEL>
extern volatile __bit                   TU16BRDSEL          __at(0x9D3);	// @ (0x13A * 8 + 3)
#define                                 TU16BRDSEL_bit      _BIT_ACCESS(TU16BCON0,3)
// TU16BHLT<TU16BRESET0>
extern volatile __bit                   TU16BRESET0         __at(0x9E2);	// @ (0x13C * 8 + 2)
#define                                 TU16BRESET0_bit     _BIT_ACCESS(TU16BHLT,2)
// TU16BHLT<TU16BRESET1>
extern volatile __bit                   TU16BRESET1         __at(0x9E3);	// @ (0x13C * 8 + 3)
#define                                 TU16BRESET1_bit     _BIT_ACCESS(TU16BHLT,3)
// TU16BCON1<TU16BRUN>
extern volatile __bit                   TU16BRUN            __at(0x9DF);	// @ (0x13B * 8 + 7)
#define                                 TU16BRUN_bit        _BIT_ACCESS(TU16BCON1,7)
// TU16BHLT<TU16BSTART0>
extern volatile __bit                   TU16BSTART0         __at(0x9E4);	// @ (0x13C * 8 + 4)
#define                                 TU16BSTART0_bit     _BIT_ACCESS(TU16BHLT,4)
// TU16BHLT<TU16BSTART1>
extern volatile __bit                   TU16BSTART1         __at(0x9E5);	// @ (0x13C * 8 + 5)
#define                                 TU16BSTART1_bit     _BIT_ACCESS(TU16BHLT,5)
// TU16BHLT<TU16BSTOP0>
extern volatile __bit                   TU16BSTOP0          __at(0x9E0);	// @ (0x13C * 8 + 0)
#define                                 TU16BSTOP0_bit      _BIT_ACCESS(TU16BHLT,0)
// TU16BHLT<TU16BSTOP1>
extern volatile __bit                   TU16BSTOP1          __at(0x9E1);	// @ (0x13C * 8 + 1)
#define                                 TU16BSTOP1_bit      _BIT_ACCESS(TU16BHLT,1)
// TU16BTMRL<TU16BTMR0>
extern volatile __bit                   TU16BTMR0           __at(0x9F0);	// @ (0x13E * 8 + 0)
#define                                 TU16BTMR0_bit       _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMR1>
extern volatile __bit                   TU16BTMR1           __at(0x9F1);	// @ (0x13E * 8 + 1)
#define                                 TU16BTMR1_bit       _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRH<TU16BTMR10>
extern volatile __bit                   TU16BTMR10          __at(0x9FA);	// @ (0x13F * 8 + 2)
#define                                 TU16BTMR10_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMR11>
extern volatile __bit                   TU16BTMR11          __at(0x9FB);	// @ (0x13F * 8 + 3)
#define                                 TU16BTMR11_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMR12>
extern volatile __bit                   TU16BTMR12          __at(0x9FC);	// @ (0x13F * 8 + 4)
#define                                 TU16BTMR12_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMR13>
extern volatile __bit                   TU16BTMR13          __at(0x9FD);	// @ (0x13F * 8 + 5)
#define                                 TU16BTMR13_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMR14>
extern volatile __bit                   TU16BTMR14          __at(0x9FE);	// @ (0x13F * 8 + 6)
#define                                 TU16BTMR14_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMR15>
extern volatile __bit                   TU16BTMR15          __at(0x9FF);	// @ (0x13F * 8 + 7)
#define                                 TU16BTMR15_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMR2>
extern volatile __bit                   TU16BTMR2           __at(0x9F2);	// @ (0x13E * 8 + 2)
#define                                 TU16BTMR2_bit       _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRT<TU16BTMR24>
extern volatile __bit                   TU16BTMR24          __at(0xA08);	// @ (0x141 * 8 + 0)
#define                                 TU16BTMR24_bit      _BIT_ACCESS(TU16BTMRT,0)
// TU16BTMRT<TU16BTMR25>
extern volatile __bit                   TU16BTMR25          __at(0xA09);	// @ (0x141 * 8 + 1)
#define                                 TU16BTMR25_bit      _BIT_ACCESS(TU16BTMRT,1)
// TU16BTMRT<TU16BTMR26>
extern volatile __bit                   TU16BTMR26          __at(0xA0A);	// @ (0x141 * 8 + 2)
#define                                 TU16BTMR26_bit      _BIT_ACCESS(TU16BTMRT,2)
// TU16BTMRT<TU16BTMR27>
extern volatile __bit                   TU16BTMR27          __at(0xA0B);	// @ (0x141 * 8 + 3)
#define                                 TU16BTMR27_bit      _BIT_ACCESS(TU16BTMRT,3)
// TU16BTMRT<TU16BTMR28>
extern volatile __bit                   TU16BTMR28          __at(0xA0C);	// @ (0x141 * 8 + 4)
#define                                 TU16BTMR28_bit      _BIT_ACCESS(TU16BTMRT,4)
// TU16BTMRT<TU16BTMR29>
extern volatile __bit                   TU16BTMR29          __at(0xA0D);	// @ (0x141 * 8 + 5)
#define                                 TU16BTMR29_bit      _BIT_ACCESS(TU16BTMRT,5)
// TU16BTMRL<TU16BTMR3>
extern volatile __bit                   TU16BTMR3           __at(0x9F3);	// @ (0x13E * 8 + 3)
#define                                 TU16BTMR3_bit       _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRT<TU16BTMR30>
extern volatile __bit                   TU16BTMR30          __at(0xA0E);	// @ (0x141 * 8 + 6)
#define                                 TU16BTMR30_bit      _BIT_ACCESS(TU16BTMRT,6)
// TU16BTMRT<TU16BTMR31>
extern volatile __bit                   TU16BTMR31          __at(0xA0F);	// @ (0x141 * 8 + 7)
#define                                 TU16BTMR31_bit      _BIT_ACCESS(TU16BTMRT,7)
// TU16BTMRL<TU16BTMR4>
extern volatile __bit                   TU16BTMR4           __at(0x9F4);	// @ (0x13E * 8 + 4)
#define                                 TU16BTMR4_bit       _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMR5>
extern volatile __bit                   TU16BTMR5           __at(0x9F5);	// @ (0x13E * 8 + 5)
#define                                 TU16BTMR5_bit       _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMR6>
extern volatile __bit                   TU16BTMR6           __at(0x9F6);	// @ (0x13E * 8 + 6)
#define                                 TU16BTMR6_bit       _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMR7>
extern volatile __bit                   TU16BTMR7           __at(0x9F7);	// @ (0x13E * 8 + 7)
#define                                 TU16BTMR7_bit       _BIT_ACCESS(TU16BTMRL,7)
// TU16BTMRH<TU16BTMR8>
extern volatile __bit                   TU16BTMR8           __at(0x9F8);	// @ (0x13F * 8 + 0)
#define                                 TU16BTMR8_bit       _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMR9>
extern volatile __bit                   TU16BTMR9           __at(0x9F9);	// @ (0x13F * 8 + 1)
#define                                 TU16BTMR9_bit       _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH0>
extern volatile __bit                   TU16BTMRH0          __at(0x9F8);	// @ (0x13F * 8 + 0)
#define                                 TU16BTMRH0_bit      _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMRH1>
extern volatile __bit                   TU16BTMRH1          __at(0x9F9);	// @ (0x13F * 8 + 1)
#define                                 TU16BTMRH1_bit      _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH2>
extern volatile __bit                   TU16BTMRH2          __at(0x9FA);	// @ (0x13F * 8 + 2)
#define                                 TU16BTMRH2_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMRH3>
extern volatile __bit                   TU16BTMRH3          __at(0x9FB);	// @ (0x13F * 8 + 3)
#define                                 TU16BTMRH3_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMRH4>
extern volatile __bit                   TU16BTMRH4          __at(0x9FC);	// @ (0x13F * 8 + 4)
#define                                 TU16BTMRH4_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMRH5>
extern volatile __bit                   TU16BTMRH5          __at(0x9FD);	// @ (0x13F * 8 + 5)
#define                                 TU16BTMRH5_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMRH6>
extern volatile __bit                   TU16BTMRH6          __at(0x9FE);	// @ (0x13F * 8 + 6)
#define                                 TU16BTMRH6_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMRH7>
extern volatile __bit                   TU16BTMRH7          __at(0x9FF);	// @ (0x13F * 8 + 7)
#define                                 TU16BTMRH7_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMRL0>
extern volatile __bit                   TU16BTMRL0          __at(0x9F0);	// @ (0x13E * 8 + 0)
#define                                 TU16BTMRL0_bit      _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMRL1>
extern volatile __bit                   TU16BTMRL1          __at(0x9F1);	// @ (0x13E * 8 + 1)
#define                                 TU16BTMRL1_bit      _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRL<TU16BTMRL2>
extern volatile __bit                   TU16BTMRL2          __at(0x9F2);	// @ (0x13E * 8 + 2)
#define                                 TU16BTMRL2_bit      _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRL<TU16BTMRL3>
extern volatile __bit                   TU16BTMRL3          __at(0x9F3);	// @ (0x13E * 8 + 3)
#define                                 TU16BTMRL3_bit      _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRL<TU16BTMRL4>
extern volatile __bit                   TU16BTMRL4          __at(0x9F4);	// @ (0x13E * 8 + 4)
#define                                 TU16BTMRL4_bit      _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMRL5>
extern volatile __bit                   TU16BTMRL5          __at(0x9F5);	// @ (0x13E * 8 + 5)
#define                                 TU16BTMRL5_bit      _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMRL6>
extern volatile __bit                   TU16BTMRL6          __at(0x9F6);	// @ (0x13E * 8 + 6)
#define                                 TU16BTMRL6_bit      _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMRL7>
extern volatile __bit                   TU16BTMRL7          __at(0x9F7);	// @ (0x13E * 8 + 7)
#define                                 TU16BTMRL7_bit      _BIT_ACCESS(TU16BTMRL,7)
// TU16BTMRT<TU16BTMRT0>
extern volatile __bit                   TU16BTMRT0          __at(0xA08);	// @ (0x141 * 8 + 0)
#define                                 TU16BTMRT0_bit      _BIT_ACCESS(TU16BTMRT,0)
// TU16BTMRT<TU16BTMRT1>
extern volatile __bit                   TU16BTMRT1          __at(0xA09);	// @ (0x141 * 8 + 1)
#define                                 TU16BTMRT1_bit      _BIT_ACCESS(TU16BTMRT,1)
// TU16BTMRT<TU16BTMRT2>
extern volatile __bit                   TU16BTMRT2          __at(0xA0A);	// @ (0x141 * 8 + 2)
#define                                 TU16BTMRT2_bit      _BIT_ACCESS(TU16BTMRT,2)
// TU16BTMRT<TU16BTMRT3>
extern volatile __bit                   TU16BTMRT3          __at(0xA0B);	// @ (0x141 * 8 + 3)
#define                                 TU16BTMRT3_bit      _BIT_ACCESS(TU16BTMRT,3)
// TU16BTMRT<TU16BTMRT4>
extern volatile __bit                   TU16BTMRT4          __at(0xA0C);	// @ (0x141 * 8 + 4)
#define                                 TU16BTMRT4_bit      _BIT_ACCESS(TU16BTMRT,4)
// TU16BTMRT<TU16BTMRT5>
extern volatile __bit                   TU16BTMRT5          __at(0xA0D);	// @ (0x141 * 8 + 5)
#define                                 TU16BTMRT5_bit      _BIT_ACCESS(TU16BTMRT,5)
// TU16BTMRT<TU16BTMRT6>
extern volatile __bit                   TU16BTMRT6          __at(0xA0E);	// @ (0x141 * 8 + 6)
#define                                 TU16BTMRT6_bit      _BIT_ACCESS(TU16BTMRT,6)
// TU16BTMRT<TU16BTMRT7>
extern volatile __bit                   TU16BTMRT7          __at(0xA0F);	// @ (0x141 * 8 + 7)
#define                                 TU16BTMRT7_bit      _BIT_ACCESS(TU16BTMRT,7)
// TU16BCON0<TU16BZIE>
extern volatile __bit                   TU16BZIE            __at(0x9D1);	// @ (0x13A * 8 + 1)
#define                                 TU16BZIE_bit        _BIT_ACCESS(TU16BCON0,1)
// TU16BCON1<TU16BZIF>
extern volatile __bit                   TU16BZIF            __at(0x9D9);	// @ (0x13B * 8 + 1)
#define                                 TU16BZIF_bit        _BIT_ACCESS(TU16BCON1,1)
// TUIN0PPS<TUIN0PPS0>
extern volatile __bit                   TUIN0PPS0           __at(0x1B28);	// @ (0x365 * 8 + 0)
#define                                 TUIN0PPS0_bit       _BIT_ACCESS(TUIN0PPS,0)
// TUIN0PPS<TUIN0PPS1>
extern volatile __bit                   TUIN0PPS1           __at(0x1B29);	// @ (0x365 * 8 + 1)
